{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. //////////////////////////////////////////////////TABLE S5: NFL at v1 AND v3 vs. Hippocampus and LnLesion volume adjusted for ICV_volM2,  by race///////////////////////////////////////////////////////////////////////////////////
>           
.           ////////////////////////////////////////LnNFLw1 EXPOSURE/////////////////////////////////////////////
> 
. 
. ***********************LnNFLw1, MODELS 1 AND 2*********************
. 
. *********************AFRICAN-AMERICAN*******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(6, 67)        = {res}     7.71
{txt}       Model {c |} {res}  3161844.4         6  526974.066   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 4577672.47        67  68323.4697   {txt}R-squared       ={res}    0.4085
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3556
{txt}       Total {c |} {res} 7739516.87        73  106020.779   {txt}Root MSE        =   {res} 261.39

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-6.358199{col 26}{space 2} 73.58911{col 37}{space 1}   -0.09{col 46}{space 3}0.931{col 67}{space 3}-.0103999
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 34.42944{col 26}{space 2} 82.95157{col 37}{space 1}    0.42{col 46}{space 3}0.679{col 67}{space 3}  .053055
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-8.401735{col 26}{space 2} 4.161038{col 37}{space 1}   -2.02{col 46}{space 3}0.047{col 67}{space 3}-.2520762
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-226.0558{col 26}{space 2} 74.81627{col 37}{space 1}   -3.02{col 46}{space 3}0.004{col 67}{space 3}-.3412307
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0225053{col 26}{space 2} .0604604{col 37}{space 1}    0.37{col 46}{space 3}0.711{col 67}{space 3} .0397651
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0013043{col 26}{space 2} .0003456{col 37}{space 1}    3.77{col 46}{space 3}0.000{col 67}{space 3} .4879405
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}     2339{col 26}{space 2} 456.6844{col 37}{space 1}    5.12{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(6, 67)        = {res}     8.27
{txt}       Model {c |} {res} 3252044.26         6  542007.377   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 4393144.72        67  65569.3242   {txt}R-squared       ={res}    0.4254
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3739
{txt}       Total {c |} {res} 7645188.98        73  104728.616   {txt}Root MSE        =   {res} 256.07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 6.767405{col 26}{space 2} 72.09065{col 37}{space 1}    0.09{col 46}{space 3}0.925{col 67}{space 3} .0111373
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 19.79455{col 26}{space 2} 81.26247{col 37}{space 1}    0.24{col 46}{space 3}0.808{col 67}{space 3} .0306906
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-8.541307{col 26}{space 2} 4.076309{col 37}{space 1}   -2.10{col 46}{space 3}0.040{col 67}{space 3}-.2578399
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} -202.953{col 26}{space 2} 73.29283{col 37}{space 1}   -2.77{col 46}{space 3}0.007{col 67}{space 3}-.3082413
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0437382{col 26}{space 2} .0592293{col 37}{space 1}    0.74{col 46}{space 3}0.463{col 67}{space 3} .0777571
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}  .001457{col 26}{space 2} .0003386{col 37}{space 1}    4.30{col 46}{space 3}0.000{col 67}{space 3} .5483987
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  2339.15{col 26}{space 2} 447.3852{col 37}{space 1}    5.23{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final==1 & Race==2,beta 
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(6, 67)        = {res}     2.47
{txt}       Model {c |} {res} 133.512749         6  22.2521248   {txt}Prob > F        ={res}    0.0320
{txt}    Residual {c |} {res}  602.62766        67  8.99444269   {txt}R-squared       ={res}    0.1814
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1081
{txt}       Total {c |} {res} 736.140409        73  10.0841152   {txt}Root MSE        =   {res} 2.9991

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 1.611988{col 26}{space 2} .8443368{col 37}{space 1}    1.91{col 46}{space 3}0.061{col 67}{space 3} .2703534
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .3198221{col 26}{space 2} .9517585{col 37}{space 1}    0.34{col 46}{space 3}0.738{col 67}{space 3} .0505338
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0281886{col 26}{space 2} .0477424{col 37}{space 1}    0.59{col 46}{space 3}0.557{col 67}{space 3} .0867186
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}  -.10995{col 26}{space 2} .8584169{col 37}{space 1}   -0.13{col 46}{space 3}0.898{col 67}{space 3}-.0170178
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0008185{col 26}{space 2} .0006937{col 37}{space 1}   -1.18{col 46}{space 3}0.242{col 67}{space 3}-.1482991
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 4.70e-06{col 26}{space 2} 3.97e-06{col 37}{space 1}    1.18{col 46}{space 3}0.240{col 67}{space 3} .1801736
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.967853{col 26}{space 2} 5.239844{col 37}{space 1}   -0.57{col 46}{space 3}0.573{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        66
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     64.09
{txt}{col 49}        avg{col 67}= {res}     64.09
{txt}{col 49}        max{col 67}= {res}     64.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   64.1{txt}){col 67}= {res}      6.64
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-38.00275{col 26}{space 2} 85.82275{col 37}{space 1}   -0.44{col 46}{space 3}0.659{col 54}{space 4}-209.4489{col 67}{space 3} 133.4434
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 26.38201{col 26}{space 2} 83.98706{col 37}{space 1}    0.31{col 46}{space 3}0.754{col 54}{space 4} -141.397{col 67}{space 3} 194.1611
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.711308{col 26}{space 2} 4.784625{col 37}{space 1}   -1.40{col 46}{space 3}0.166{col 54}{space 4}-16.26945{col 67}{space 3} 2.846829
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-219.6944{col 26}{space 2} 75.59615{col 37}{space 1}   -2.91{col 46}{space 3}0.005{col 54}{space 4}-370.7112{col 67}{space 3}-68.67769
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0206297{col 26}{space 2} .0607317{col 37}{space 1}    0.34{col 46}{space 3}0.735{col 54}{space 4}-.1006926{col 67}{space 3} .1419521
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-4.225061{col 26}{space 2} 5.837316{col 37}{space 1}   -0.72{col 46}{space 3}0.472{col 54}{space 4}-15.88613{col 67}{space 3} 7.436013
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0013171{col 26}{space 2} .0003473{col 37}{space 1}    3.79{col 46}{space 3}0.000{col 54}{space 4} .0006233{col 67}{space 3} .0020109
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2434.244{col 26}{space 2} 476.8322{col 37}{space 1}    5.11{col 46}{space 3}0.000{col 54}{space 4} 1481.687{col 67}{space 3} 3386.801
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        66
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     64.09
{txt}{col 49}        avg{col 67}= {res}     64.09
{txt}{col 49}        max{col 67}= {res}     64.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   64.1{txt}){col 67}= {res}      7.29
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-40.77472{col 26}{space 2} 83.62284{col 37}{space 1}   -0.49{col 46}{space 3}0.627{col 54}{space 4}-207.8262{col 67}{space 3} 126.2767
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 7.704265{col 26}{space 2}  81.8342{col 37}{space 1}    0.09{col 46}{space 3}0.925{col 54}{space 4}-155.7741{col 67}{space 3} 171.1826
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.001645{col 26}{space 2}  4.66198{col 37}{space 1}   -1.29{col 46}{space 3}0.203{col 54}{space 4}-15.31478{col 67}{space 3} 3.311487
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-193.3959{col 26}{space 2} 73.65839{col 37}{space 1}   -2.63{col 46}{space 3}0.011{col 54}{space 4}-340.5416{col 67}{space 3}-46.25019
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0409203{col 26}{space 2} .0591749{col 37}{space 1}    0.69{col 46}{space 3}0.492{col 54}{space 4}-.0772921{col 67}{space 3} .1591328
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-6.347645{col 26}{space 2} 5.687687{col 37}{space 1}   -1.12{col 46}{space 3}0.269{col 54}{space 4}-17.70981{col 67}{space 3} 5.014519
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0014762{col 26}{space 2} .0003384{col 37}{space 1}    4.36{col 46}{space 3}0.000{col 54}{space 4} .0008002{col 67}{space 3} .0021522
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2482.243{col 26}{space 2} 464.6095{col 37}{space 1}    5.34{col 46}{space 3}0.000{col 54}{space 4} 1554.103{col 67}{space 3} 3410.383
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        66
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     64.09
{txt}{col 49}        avg{col 67}= {res}     64.09
{txt}{col 49}        max{col 67}= {res}     64.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   64.1{txt}){col 67}= {res}      2.49
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0252

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.360651{col 26}{space 2}   .97191{col 37}{space 1}    2.43{col 46}{space 3}0.018{col 54}{space 4}  .419088{col 67}{space 3} 4.302213
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .5102121{col 26}{space 2} .9511215{col 37}{space 1}    0.54{col 46}{space 3}0.594{col 54}{space 4}-1.389822{col 67}{space 3} 2.410246
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0118044{col 26}{space 2} .0541841{col 37}{space 1}   -0.22{col 46}{space 3}0.828{col 54}{space 4}-.1200467{col 67}{space 3} .0964379
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.2604496{col 26}{space 2} .8560977{col 37}{space 1}   -0.30{col 46}{space 3}0.762{col 54}{space 4}-1.970657{col 67}{space 3} 1.449758
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0007742{col 26}{space 2} .0006878{col 37}{space 1}   -1.13{col 46}{space 3}0.265{col 54}{space 4}-.0021481{col 67}{space 3} .0005998
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0999586{col 26}{space 2} .0661054{col 37}{space 1}    1.51{col 46}{space 3}0.135{col 54}{space 4}-.0320986{col 67}{space 3} .2320158
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 4.40e-06{col 26}{space 2} 3.93e-06{col 37}{space 1}    1.12{col 46}{space 3}0.268{col 54}{space 4}-3.46e-06{col 67}{space 3} .0000123
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-5.221191{col 26}{space 2} 5.399944{col 37}{space 1}   -0.97{col 46}{space 3}0.337{col 54}{space 4}-16.00854{col 67}{space 3} 5.566155
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. *********************WHITES******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       105
{txt}{hline 13}{c +}{hline 34}   F(6, 98)        = {res}    11.99
{txt}       Model {c |} {res} 6950409.51         6  1158401.59   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 9467057.41        98  96602.6266   {txt}R-squared       ={res}    0.4234
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3880
{txt}       Total {c |} {res} 16417466.9       104  157860.259   {txt}Root MSE        =   {res} 310.81

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-103.6316{col 26}{space 2}  75.1092{col 37}{space 1}   -1.38{col 46}{space 3}0.171{col 67}{space 3}-.1296019
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-95.27648{col 26}{space 2} 84.99091{col 37}{space 1}   -1.12{col 46}{space 3}0.265{col 67}{space 3}-.1195482
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-3.195228{col 26}{space 2}  4.38251{col 37}{space 1}   -0.73{col 46}{space 3}0.468{col 67}{space 3}-.0677443
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-60.92969{col 26}{space 2} 73.79929{col 37}{space 1}   -0.83{col 46}{space 3}0.411{col 67}{space 3}-.0673458
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0241601{col 26}{space 2} .0491332{col 37}{space 1}    0.49{col 46}{space 3}0.624{col 67}{space 3} .0397173
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019794{col 26}{space 2} .0003001{col 37}{space 1}    6.59{col 46}{space 3}0.000{col 67}{space 3}  .715584
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1451.472{col 26}{space 2} 424.3795{col 37}{space 1}    3.42{col 46}{space 3}0.001{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       105
{txt}{hline 13}{c +}{hline 34}   F(6, 98)        = {res}    15.39
{txt}       Model {c |} {res} 9555553.42         6  1592592.24   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 10144073.9        98  103510.958   {txt}R-squared       ={res}    0.4851
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4535
{txt}       Total {c |} {res} 19699627.3       104  189419.494   {txt}Root MSE        =   {res} 321.73

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-116.6859{col 26}{space 2} 77.74847{col 37}{space 1}   -1.50{col 46}{space 3}0.137{col 67}{space 3}-.1332175
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-222.7057{col 26}{space 2} 87.97741{col 37}{space 1}   -2.53{col 46}{space 3}0.013{col 67}{space 3}-.2551013
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .6715583{col 26}{space 2} 4.536507{col 37}{space 1}    0.15{col 46}{space 3}0.883{col 67}{space 3} .0129981
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-27.53293{col 26}{space 2} 76.39253{col 37}{space 1}   -0.36{col 46}{space 3}0.719{col 67}{space 3}-.0277816
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0682891{col 26}{space 2} .0508597{col 37}{space 1}    1.34{col 46}{space 3}0.182{col 67}{space 3} .1024842
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0025951{col 26}{space 2} .0003107{col 37}{space 1}    8.35{col 46}{space 3}0.000{col 67}{space 3} .8564742
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 805.5914{col 26}{space 2} 439.2918{col 37}{space 1}    1.83{col 46}{space 3}0.070{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final==1 & Race==1,beta 
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       105
{txt}{hline 13}{c +}{hline 34}   F(6, 98)        = {res}     1.95
{txt}       Model {c |} {res} 200.676736         6  33.4461226   {txt}Prob > F        ={res}    0.0799
{txt}    Residual {c |} {res} 1678.91212        98  17.1317564   {txt}R-squared       ={res}    0.1068
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0521
{txt}       Total {c |} {res} 1879.58886       104  18.0729698   {txt}Root MSE        =   {res} 4.1391

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.666271{col 26}{space 2} 1.000229{col 37}{space 1}    2.67{col 46}{space 3}0.009{col 67}{space 3}  .311634
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0420056{col 26}{space 2} 1.131824{col 37}{space 1}    0.04{col 46}{space 3}0.970{col 67}{space 3} .0049259
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0126647{col 26}{space 2} .0583619{col 37}{space 1}   -0.22{col 46}{space 3}0.829{col 67}{space 3}-.0250951
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 1.682622{col 26}{space 2} .9827853{col 37}{space 1}    1.71{col 46}{space 3}0.090{col 67}{space 3}  .173816
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0006233{col 26}{space 2} .0006543{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 67}{space 3}-.0957623
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.50e-06{col 26}{space 2} 4.00e-06{col 37}{space 1}    0.38{col 46}{space 3}0.708{col 67}{space 3} .0506524
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.659572{col 26}{space 2} 5.651462{col 37}{space 1}   -0.47{col 46}{space 3}0.639{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        97
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     95.06
{txt}{col 49}        avg{col 67}= {res}     95.06
{txt}{col 49}        max{col 67}= {res}     95.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   95.1{txt}){col 67}= {res}     10.82
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-94.04136{col 26}{space 2}  74.7394{col 37}{space 1}   -1.26{col 46}{space 3}0.211{col 54}{space 4}-242.4166{col 67}{space 3} 54.33391
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-83.36669{col 26}{space 2} 84.62714{col 37}{space 1}   -0.99{col 46}{space 3}0.327{col 54}{space 4}-251.3714{col 67}{space 3} 84.63806
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2.818141{col 26}{space 2} 4.353396{col 37}{space 1}   -0.65{col 46}{space 3}0.519{col 54}{space 4}-11.46065{col 67}{space 3} 5.824372
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-62.44051{col 26}{space 2} 73.20925{col 37}{space 1}   -0.85{col 46}{space 3}0.396{col 54}{space 4}-207.7781{col 67}{space 3} 82.89704
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0356711{col 26}{space 2}  .049256{col 37}{space 1}    0.72{col 46}{space 3}0.471{col 54}{space 4}-.0621136{col 67}{space 3} .1334557
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 7.814146{col 26}{space 2} 4.843935{col 37}{space 1}    1.61{col 46}{space 3}0.110{col 54}{space 4}-1.802202{col 67}{space 3} 17.43049
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019839{col 26}{space 2} .0002977{col 37}{space 1}    6.66{col 46}{space 3}0.000{col 54}{space 4} .0013929{col 67}{space 3}  .002575
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1140.166{col 26}{space 2} 463.0771{col 37}{space 1}    2.46{col 46}{space 3}0.016{col 54}{space 4} 220.8493{col 67}{space 3} 2059.483
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        97
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     95.06
{txt}{col 49}        avg{col 67}= {res}     95.06
{txt}{col 49}        max{col 67}= {res}     95.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   95.1{txt}){col 67}= {res}     14.36
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-103.4927{col 26}{space 2} 76.56638{col 37}{space 1}   -1.35{col 46}{space 3}0.180{col 54}{space 4}-255.4949{col 67}{space 3} 48.50955
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-206.3216{col 26}{space 2} 86.69582{col 37}{space 1}   -2.38{col 46}{space 3}0.019{col 54}{space 4}-378.4331{col 67}{space 3}-34.21001
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.190312{col 26}{space 2} 4.459813{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 54}{space 4}-7.663463{col 67}{space 3} 10.04409
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-29.61134{col 26}{space 2} 74.99882{col 37}{space 1}   -0.39{col 46}{space 3}0.694{col 54}{space 4}-178.5016{col 67}{space 3} 119.2789
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0841246{col 26}{space 2}   .05046{col 37}{space 1}    1.67{col 46}{space 3}0.099{col 54}{space 4}-.0160504{col 67}{space 3} .1842996
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 10.74981{col 26}{space 2} 4.962343{col 37}{space 1}    2.17{col 46}{space 3}0.033{col 54}{space 4} .8983986{col 67}{space 3} 20.60123
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0026014{col 26}{space 2}  .000305{col 37}{space 1}    8.53{col 46}{space 3}0.000{col 54}{space 4} .0019959{col 67}{space 3} .0032069
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 377.3324{col 26}{space 2} 474.3969{col 37}{space 1}    0.80{col 46}{space 3}0.428{col 54}{space 4}-564.4568{col 67}{space 3} 1319.122
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        97
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     95.06
{txt}{col 49}        avg{col 67}= {res}     95.06
{txt}{col 49}        max{col 67}= {res}     95.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   95.1{txt}){col 67}= {res}      1.70
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1175

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.709534{col 26}{space 2} 1.007055{col 37}{space 1}    2.69{col 46}{space 3}0.008{col 54}{space 4} .7102939{col 67}{space 3} 4.708774
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0957317{col 26}{space 2} 1.140284{col 37}{space 1}    0.08{col 46}{space 3}0.933{col 54}{space 4}   -2.168{col 67}{space 3} 2.359464
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0109637{col 26}{space 2} .0586586{col 37}{space 1}   -0.19{col 46}{space 3}0.852{col 54}{space 4}-.1274147{col 67}{space 3} .1054874
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.675807{col 26}{space 2}  .986437{col 37}{space 1}    1.70{col 46}{space 3}0.093{col 54}{space 4}-.2825025{col 67}{space 3} 3.634116
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0005714{col 26}{space 2} .0006637{col 37}{space 1}   -0.86{col 46}{space 3}0.391{col 54}{space 4}-.0018889{col 67}{space 3} .0007462
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0352503{col 26}{space 2} .0652682{col 37}{space 1}    0.54{col 46}{space 3}0.590{col 54}{space 4}-.0943224{col 67}{space 3}  .164823
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.52e-06{col 26}{space 2} 4.01e-06{col 37}{space 1}    0.38{col 46}{space 3}0.706{col 54}{space 4}-6.44e-06{col 67}{space 3} 9.48e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.063899{col 26}{space 2}   6.2396{col 37}{space 1}   -0.65{col 46}{space 3}0.516{col 54}{space 4}-16.45097{col 67}{space 3} 8.323172
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //INTERACTION BY Race//
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       169
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    167.03
{txt}{col 49}        avg{col 67}= {res}    167.03
{txt}{col 49}        max{col 67}= {res}    167.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  167.0{txt}){col 67}= {res}     15.67
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} -75.8096{col 28}{space 2} 65.60414{col 39}{space 1}   -1.16{col 48}{space 3}0.250{col 56}{space 4}-205.3297{col 69}{space 3} 53.71055
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-260.2224{col 28}{space 2} 178.5799{col 39}{space 1}   -1.46{col 48}{space 3}0.147{col 56}{space 4}-612.7869{col 69}{space 3} 92.34212
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 85.98341{col 28}{space 2} 88.37906{col 39}{space 1}    0.97{col 48}{space 3}0.332{col 56}{space 4}-88.50054{col 69}{space 3} 260.4674
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-28.47875{col 28}{space 2} 60.53477{col 39}{space 1}   -0.47{col 48}{space 3}0.639{col 56}{space 4}-147.9906{col 69}{space 3} 91.03311
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-5.893159{col 28}{space 2} 3.070426{col 39}{space 1}   -1.92{col 48}{space 3}0.057{col 56}{space 4}  -11.955{col 69}{space 3} .1686843
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-136.3797{col 28}{space 2} 52.29295{col 39}{space 1}   -2.61{col 48}{space 3}0.010{col 56}{space 4}-239.6199{col 69}{space 3}-33.13937
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0196849{col 28}{space 2} .0377044{col 39}{space 1}    0.52{col 48}{space 3}0.602{col 56}{space 4}-.0547536{col 69}{space 3} .0941235
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2.568116{col 28}{space 2} 3.608855{col 39}{space 1}    0.71{col 48}{space 3}0.478{col 56}{space 4} -4.55673{col 69}{space 3} 9.692962
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2}  .001686{col 28}{space 2}  .000225{col 39}{space 1}    7.49{col 48}{space 3}0.000{col 56}{space 4} .0012418{col 69}{space 3} .0021303
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1860.42{col 28}{space 2}  333.881{col 39}{space 1}    5.57{col 48}{space 3}0.000{col 56}{space 4}  1201.25{col 69}{space 3} 2519.591
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       169
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    167.03
{txt}{col 49}        avg{col 67}= {res}    167.03
{txt}{col 49}        max{col 67}= {res}    167.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  167.0{txt}){col 67}= {res}     18.30
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-63.75557{col 28}{space 2} 67.78397{col 39}{space 1}   -0.94{col 48}{space 3}0.348{col 56}{space 4}-197.5793{col 69}{space 3} 70.06815
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-255.4588{col 28}{space 2} 184.5136{col 39}{space 1}   -1.38{col 48}{space 3}0.168{col 56}{space 4} -619.738{col 69}{space 3} 108.8204
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 84.53142{col 28}{space 2} 91.31564{col 39}{space 1}    0.93{col 48}{space 3}0.356{col 56}{space 4}-95.75011{col 69}{space 3}  264.813
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-104.7303{col 28}{space 2} 62.54617{col 39}{space 1}   -1.67{col 48}{space 3}0.096{col 56}{space 4}-228.2132{col 69}{space 3} 18.75262
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-4.274684{col 28}{space 2} 3.172447{col 39}{space 1}   -1.35{col 48}{space 3}0.180{col 56}{space 4}-10.53795{col 69}{space 3} 1.988576
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-109.3181{col 28}{space 2} 54.03049{col 39}{space 1}   -2.02{col 48}{space 3}0.045{col 56}{space 4}-215.9888{col 69}{space 3}-2.647455
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0531392{col 28}{space 2} .0389572{col 39}{space 1}    1.36{col 48}{space 3}0.174{col 56}{space 4}-.0237728{col 69}{space 3} .1300511
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}  2.95044{col 28}{space 2} 3.728766{col 39}{space 1}    0.79{col 48}{space 3}0.430{col 56}{space 4}-4.411143{col 69}{space 3} 10.31202
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021162{col 28}{space 2} .0002325{col 39}{space 1}    9.10{col 48}{space 3}0.000{col 56}{space 4} .0016572{col 69}{space 3} .0025753
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1470.063{col 28}{space 2} 344.9749{col 39}{space 1}    4.26{col 48}{space 3}0.000{col 56}{space 4} 788.9905{col 69}{space 3} 2151.136
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 if sample_final==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       169
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    167.03
{txt}{col 49}        avg{col 67}= {res}    167.03
{txt}{col 49}        max{col 67}= {res}    167.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  167.0{txt}){col 67}= {res}      2.51
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0102

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 2.498087{col 28}{space 2} .8311381{col 39}{space 1}    3.01{col 48}{space 3}0.003{col 56}{space 4} .8571981{col 69}{space 3} 4.138977
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.937549{col 28}{space 2} 2.262426{col 39}{space 1}    0.86{col 48}{space 3}0.393{col 56}{space 4}-2.529087{col 69}{space 3} 6.404185
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.2929593{col 28}{space 2} 1.119673{col 39}{space 1}   -0.26{col 48}{space 3}0.794{col 56}{space 4}-2.503494{col 69}{space 3} 1.917576
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .3602476{col 28}{space 2} .7669144{col 39}{space 1}    0.47{col 48}{space 3}0.639{col 56}{space 4}-1.153847{col 69}{space 3} 1.874342
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0021176{col 28}{space 2} .0388992{col 39}{space 1}    0.05{col 48}{space 3}0.957{col 56}{space 4}-.0746799{col 69}{space 3}  .078915
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .8212899{col 28}{space 2} .6624987{col 39}{space 1}    1.24{col 48}{space 3}0.217{col 56}{space 4}-.4866601{col 69}{space 3}  2.12924
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0006621{col 28}{space 2} .0004777{col 39}{space 1}   -1.39{col 48}{space 3}0.168{col 56}{space 4}-.0016051{col 69}{space 3}  .000281
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0586706{col 28}{space 2} .0457205{col 39}{space 1}    1.28{col 48}{space 3}0.201{col 56}{space 4} -.031594{col 69}{space 3} .1489352
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.06e-06{col 28}{space 2} 2.85e-06{col 39}{space 1}    0.72{col 48}{space 3}0.472{col 56}{space 4}-3.57e-06{col 69}{space 3} 7.69e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-4.820375{col 28}{space 2} 4.229934{col 39}{space 1}   -1.14{col 48}{space 3}0.256{col 56}{space 4} -13.1714{col 69}{space 3} 3.530649
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. *********************LnNFLw1, MODELS 3-6***************************
. 
. ***********MODEL 3: MODEL 2+w1dxDiabetes w1Glucose******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0087
{txt}{col 49}Largest FMI{col 67}= {res}    0.0643
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     55.45
{txt}{col 49}        avg{col 67}= {res}     61.08
{txt}{col 49}        max{col 67}= {res}     62.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   62.0{txt}){col 67}= {res}      6.03
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-62.24114{col 26}{space 2} 87.73721{col 37}{space 1}   -0.71{col 46}{space 3}0.481{col 54}{space 4}-237.6261{col 67}{space 3} 113.1438
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 22.97723{col 26}{space 2} 82.50392{col 37}{space 1}    0.28{col 46}{space 3}0.782{col 54}{space 4} -141.969{col 67}{space 3} 187.9235
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-4.879436{col 26}{space 2} 4.907853{col 37}{space 1}   -0.99{col 46}{space 3}0.324{col 54}{space 4}-14.69028{col 67}{space 3} 4.931405
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-220.7932{col 26}{space 2} 73.57264{col 37}{space 1}   -3.00{col 46}{space 3}0.004{col 54}{space 4}-367.8603{col 67}{space 3} -73.7261
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0099781{col 26}{space 2} .0595406{col 37}{space 1}    0.17{col 46}{space 3}0.867{col 54}{space 4}-.1090407{col 67}{space 3} .1289969
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-5.915442{col 26}{space 2} 5.739545{col 37}{space 1}   -1.03{col 46}{space 3}0.307{col 54}{space 4}-17.38862{col 67}{space 3} 5.557741
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-80.73287{col 26}{space 2} 60.97053{col 37}{space 1}   -1.32{col 46}{space 3}0.191{col 54}{space 4}-202.8985{col 67}{space 3} 41.43275
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 4.111424{col 26}{space 2} 1.746412{col 37}{space 1}    2.35{col 46}{space 3}0.022{col 54}{space 4} .6185759{col 67}{space 3} 7.604271
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0011746{col 26}{space 2} .0003466{col 37}{space 1}    3.39{col 46}{space 3}0.001{col 54}{space 4} .0004816{col 67}{space 3} .0018677
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2291.579{col 26}{space 2} 470.4509{col 37}{space 1}    4.87{col 46}{space 3}0.000{col 54}{space 4} 1351.168{col 67}{space 3}  3231.99
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0020
{txt}{col 49}Largest FMI{col 67}= {res}    0.0108
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     61.41
{txt}{col 49}        avg{col 67}= {res}     61.89
{txt}{col 49}        max{col 67}= {res}     62.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   62.1{txt}){col 67}= {res}      7.95
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-48.72315{col 26}{space 2} 81.66978{col 37}{space 1}   -0.60{col 46}{space 3}0.553{col 54}{space 4}-211.9847{col 67}{space 3} 114.5384
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-5.875064{col 26}{space 2} 76.56983{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-158.9409{col 67}{space 3} 147.1908
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-4.877442{col 26}{space 2} 4.567927{col 37}{space 1}   -1.07{col 46}{space 3}0.290{col 54}{space 4}-14.00903{col 67}{space 3} 4.254142
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-195.8194{col 26}{space 2} 68.43409{col 37}{space 1}   -2.86{col 46}{space 3}0.006{col 54}{space 4}-332.6144{col 67}{space 3}-59.02439
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0324939{col 26}{space 2} .0553746{col 37}{space 1}    0.59{col 46}{space 3}0.559{col 54}{space 4}-.0781963{col 67}{space 3} .1431842
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-8.339839{col 26}{space 2} 5.341684{col 37}{space 1}   -1.56{col 46}{space 3}0.124{col 54}{space 4}-19.01794{col 67}{space 3} 2.338267
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-57.56606{col 26}{space 2} 55.23857{col 37}{space 1}   -1.04{col 46}{space 3}0.301{col 54}{space 4}-168.0077{col 67}{space 3} 52.87555
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 5.346139{col 26}{space 2} 1.610128{col 37}{space 1}    3.32{col 46}{space 3}0.002{col 54}{space 4} 2.127413{col 67}{space 3} 8.564864
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0013264{col 26}{space 2} .0003213{col 37}{space 1}    4.13{col 46}{space 3}0.000{col 54}{space 4}  .000684{col 67}{space 3} .0019687
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2245.681{col 26}{space 2} 437.5157{col 37}{space 1}    5.13{col 46}{space 3}0.000{col 54}{space 4} 1371.115{col 67}{space 3} 3120.246
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0020
{txt}{col 49}Largest FMI{col 67}= {res}    0.0192
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     60.70
{txt}{col 49}        avg{col 67}= {res}     61.87
{txt}{col 49}        max{col 67}= {res}     62.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   62.1{txt}){col 67}= {res}      1.90
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0689

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.366877{col 26}{space 2} 1.035944{col 37}{space 1}    2.28{col 46}{space 3}0.026{col 54}{space 4} .2960338{col 67}{space 3} 4.437719
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .5347419{col 26}{space 2} .9704888{col 37}{space 1}    0.55{col 46}{space 3}0.584{col 54}{space 4}-1.405185{col 67}{space 3} 2.474669
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}  -.01315{col 26}{space 2} .0579338{col 37}{space 1}   -0.23{col 46}{space 3}0.821{col 54}{space 4}-.1289597{col 67}{space 3} .1026597
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.2580325{col 26}{space 2} .8684206{col 37}{space 1}   -0.30{col 46}{space 3}0.767{col 54}{space 4}-1.993931{col 67}{space 3} 1.477866
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0007638{col 26}{space 2} .0007028{col 37}{space 1}   -1.09{col 46}{space 3}0.281{col 54}{space 4}-.0021686{col 67}{space 3}  .000641
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .1028994{col 26}{space 2} .0677294{col 37}{space 1}    1.52{col 46}{space 3}0.134{col 54}{space 4} -.032487{col 67}{space 3} .2382858
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} .0673641{col 26}{space 2} .7039412{col 37}{space 1}    0.10{col 46}{space 3}0.924{col 54}{space 4}-1.340392{col 67}{space 3}  1.47512
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-.0076459{col 26}{space 2} .0204695{col 37}{space 1}   -0.37{col 46}{space 3}0.710{col 54}{space 4}-.0485685{col 67}{space 3} .0332767
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 4.59e-06{col 26}{space 2} 4.07e-06{col 37}{space 1}    1.13{col 46}{space 3}0.264{col 54}{space 4}-3.55e-06{col 67}{space 3} .0000127
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.864048{col 26}{space 2} 5.551723{col 37}{space 1}   -0.88{col 46}{space 3}0.384{col 54}{space 4}-15.96147{col 67}{space 3} 6.233373
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //Whites//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     93.06
{txt}{col 49}        avg{col 67}= {res}     93.06
{txt}{col 49}        max{col 67}= {res}     93.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.1{txt}){col 67}= {res}      8.36
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-111.6542{col 26}{space 2} 81.58549{col 37}{space 1}   -1.37{col 46}{space 3}0.174{col 54}{space 4}-273.6655{col 67}{space 3} 50.35697
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-93.54561{col 26}{space 2} 86.38106{col 37}{space 1}   -1.08{col 46}{space 3}0.282{col 54}{space 4}-265.0798{col 67}{space 3} 77.98857
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2.928006{col 26}{space 2} 4.437966{col 37}{space 1}   -0.66{col 46}{space 3}0.511{col 54}{space 4}-11.74085{col 67}{space 3}  5.88484
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-69.29682{col 26}{space 2} 74.29012{col 37}{space 1}   -0.93{col 46}{space 3}0.353{col 54}{space 4} -216.821{col 67}{space 3} 78.22736
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0434966{col 26}{space 2} .0506754{col 37}{space 1}    0.86{col 46}{space 3}0.393{col 54}{space 4}-.0571337{col 67}{space 3}  .144127
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  6.68633{col 26}{space 2} 5.094426{col 37}{space 1}    1.31{col 46}{space 3}0.193{col 54}{space 4}-3.430103{col 67}{space 3} 16.80276
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}  28.8385{col 26}{space 2} 67.94456{col 37}{space 1}    0.42{col 46}{space 3}0.672{col 54}{space 4}-106.0848{col 67}{space 3} 163.7618
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}  .291531{col 26}{space 2} 1.479706{col 37}{space 1}    0.20{col 46}{space 3}0.844{col 54}{space 4}-2.646846{col 67}{space 3} 3.229908
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}  .001979{col 26}{space 2} .0003029{col 37}{space 1}    6.53{col 46}{space 3}0.000{col 54}{space 4} .0013775{col 67}{space 3} .0025805
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1189.39{col 26}{space 2} 496.9025{col 37}{space 1}    2.39{col 46}{space 3}0.019{col 54}{space 4} 202.6483{col 67}{space 3} 2176.131
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     93.06
{txt}{col 49}        avg{col 67}= {res}     93.06
{txt}{col 49}        max{col 67}= {res}     93.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.1{txt}){col 67}= {res}     11.08
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-128.7242{col 26}{space 2} 83.55112{col 37}{space 1}   -1.54{col 46}{space 3}0.127{col 54}{space 4}-294.6388{col 67}{space 3} 37.19031
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-217.7574{col 26}{space 2} 88.46223{col 37}{space 1}   -2.46{col 46}{space 3}0.016{col 54}{space 4}-393.4243{col 67}{space 3}-42.09045
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.348028{col 26}{space 2}  4.54489{col 37}{space 1}    0.30{col 46}{space 3}0.767{col 54}{space 4}-7.677144{col 67}{space 3}  10.3732
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-35.67366{col 26}{space 2} 76.07999{col 37}{space 1}   -0.47{col 46}{space 3}0.640{col 54}{space 4}-186.7521{col 67}{space 3} 115.4048
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0908903{col 26}{space 2} .0518963{col 37}{space 1}    1.75{col 46}{space 3}0.083{col 54}{space 4}-.0121645{col 67}{space 3} .1939451
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 9.666363{col 26}{space 2} 5.217166{col 37}{space 1}    1.85{col 46}{space 3}0.067{col 54}{space 4}-.6938048{col 67}{space 3} 20.02653
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 5.118204{col 26}{space 2} 69.58154{col 37}{space 1}    0.07{col 46}{space 3}0.942{col 54}{space 4}-133.0558{col 67}{space 3} 143.2922
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} .8398709{col 26}{space 2} 1.515356{col 37}{space 1}    0.55{col 46}{space 3}0.581{col 54}{space 4}  -2.1693{col 67}{space 3} 3.849042
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0026132{col 26}{space 2} .0003102{col 37}{space 1}    8.42{col 46}{space 3}0.000{col 54}{space 4} .0019972{col 67}{space 3} .0032292
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 361.6543{col 26}{space 2} 508.8743{col 37}{space 1}    0.71{col 46}{space 3}0.479{col 54}{space 4}-648.8605{col 67}{space 3} 1372.169
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     93.06
{txt}{col 49}        avg{col 67}= {res}     93.06
{txt}{col 49}        max{col 67}= {res}     93.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.1{txt}){col 67}= {res}      1.42
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1913

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 3.093677{col 26}{space 2} 1.097117{col 37}{space 1}    2.82{col 46}{space 3}0.006{col 54}{space 4} .9150383{col 67}{space 3} 5.272316
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  .280786{col 26}{space 2} 1.161606{col 37}{space 1}    0.24{col 46}{space 3}0.810{col 54}{space 4}-2.025912{col 67}{space 3} 2.587484
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0122684{col 26}{space 2} .0596794{col 37}{space 1}   -0.21{col 46}{space 3}0.838{col 54}{space 4}-.1307788{col 67}{space 3} .1062419
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.781186{col 26}{space 2} .9990132{col 37}{space 1}    1.78{col 46}{space 3}0.078{col 54}{space 4}-.2026388{col 67}{space 3} 3.765011
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0006898{col 26}{space 2} .0006815{col 37}{space 1}   -1.01{col 46}{space 3}0.314{col 54}{space 4}-.0020431{col 67}{space 3} .0006634
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0535974{col 26}{space 2} .0685071{col 37}{space 1}    0.78{col 46}{space 3}0.436{col 54}{space 4}-.0824429{col 67}{space 3} .1896377
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-.2038654{col 26}{space 2} .9136815{col 37}{space 1}   -0.22{col 46}{space 3}0.824{col 54}{space 4} -2.01824{col 67}{space 3} 1.610509
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-.0113176{col 26}{space 2} .0198983{col 37}{space 1}   -0.57{col 46}{space 3}0.571{col 54}{space 4}-.0508313{col 67}{space 3} .0281961
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.41e-06{col 26}{space 2} 4.07e-06{col 37}{space 1}    0.35{col 46}{space 3}0.731{col 54}{space 4}-6.68e-06{col 67}{space 3} 9.49e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.125121{col 26}{space 2} 6.682075{col 37}{space 1}   -0.62{col 46}{space 3}0.539{col 54}{space 4}-17.39428{col 67}{space 3}  9.14404
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //INTERACTION by Race//
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0035
{txt}{col 49}Largest FMI{col 67}= {res}    0.0379
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    150.90
{txt}{col 49}        avg{col 67}= {res}    163.47
{txt}{col 49}        max{col 67}= {res}    165.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  165.0{txt}){col 67}= {res}     13.04
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-110.9607{col 28}{space 2}  69.5279{col 39}{space 1}   -1.60{col 48}{space 3}0.112{col 56}{space 4}-248.2398{col 69}{space 3} 26.31852
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-325.0225{col 28}{space 2} 183.3459{col 39}{space 1}   -1.77{col 48}{space 3}0.078{col 56}{space 4}-687.0286{col 69}{space 3} 36.98357
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 121.2835{col 28}{space 2} 91.15676{col 39}{space 1}    1.33{col 48}{space 3}0.185{col 56}{space 4}-58.70038{col 69}{space 3} 301.2673
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-40.89512{col 28}{space 2}  61.0508{col 39}{space 1}   -0.67{col 48}{space 3}0.504{col 56}{space 4}-161.4365{col 69}{space 3} 79.64629
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-5.706097{col 28}{space 2} 3.131221{col 39}{space 1}   -1.82{col 48}{space 3}0.070{col 56}{space 4}-11.88858{col 69}{space 3} .4763891
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-142.0743{col 28}{space 2} 52.34823{col 39}{space 1}   -2.71{col 48}{space 3}0.007{col 56}{space 4}-245.4329{col 69}{space 3}-38.71577
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0257788{col 28}{space 2}  .038096{col 39}{space 1}    0.68{col 48}{space 3}0.500{col 56}{space 4}-.0494398{col 69}{space 3} .1009975
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1.373428{col 28}{space 2} 3.692523{col 39}{space 1}    0.37{col 48}{space 3}0.710{col 56}{space 4}-5.917257{col 69}{space 3} 8.664114
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-1.742345{col 28}{space 2} 45.79427{col 39}{space 1}   -0.04{col 48}{space 3}0.970{col 56}{space 4}-92.22309{col 69}{space 3}  88.7384
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 1.371714{col 28}{space 2} 1.115553{col 39}{space 1}    1.23{col 48}{space 3}0.221{col 56}{space 4}-.8312749{col 69}{space 3} 3.574702
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0016923{col 28}{space 2} .0002248{col 39}{space 1}    7.53{col 48}{space 3}0.000{col 56}{space 4} .0012485{col 69}{space 3} .0021361
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1825.685{col 28}{space 2} 342.8773{col 39}{space 1}    5.32{col 48}{space 3}0.000{col 56}{space 4} 1148.684{col 69}{space 3} 2502.686
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0002
{txt}{col 49}Largest FMI{col 67}= {res}    0.0023
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    164.66
{txt}{col 49}        avg{col 67}= {res}    164.99
{txt}{col 49}        max{col 67}= {res}    165.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  165.0{txt}){col 67}= {res}     15.67
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-113.5233{col 28}{space 2} 71.32109{col 39}{space 1}   -1.59{col 48}{space 3}0.113{col 56}{space 4}-254.3428{col 69}{space 3} 27.29607
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-350.7107{col 28}{space 2}  188.095{col 39}{space 1}   -1.86{col 48}{space 3}0.064{col 56}{space 4}-722.0935{col 69}{space 3} 20.67209
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}  136.092{col 28}{space 2} 93.52009{col 39}{space 1}    1.46{col 48}{space 3}0.148{col 56}{space 4}-48.55805{col 69}{space 3}  320.742
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-123.3025{col 28}{space 2} 62.63051{col 39}{space 1}   -1.97{col 48}{space 3}0.051{col 56}{space 4}-246.9629{col 69}{space 3} .3578239
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-4.107155{col 28}{space 2} 3.210241{col 39}{space 1}   -1.28{col 48}{space 3}0.203{col 56}{space 4} -10.4456{col 69}{space 3} 2.231285
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-117.6083{col 28}{space 2} 53.70646{col 39}{space 1}   -2.19{col 48}{space 3}0.030{col 56}{space 4}-223.6486{col 69}{space 3}  -11.568
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0626818{col 28}{space 2} .0390762{col 39}{space 1}    1.60{col 48}{space 3}0.111{col 56}{space 4}-.0144718{col 69}{space 3} .1398355
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1.175368{col 28}{space 2}  3.78797{col 39}{space 1}    0.31{col 48}{space 3}0.757{col 56}{space 4}-6.303761{col 69}{space 3} 8.654497
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} 5.382747{col 28}{space 2} 46.16101{col 39}{space 1}    0.12{col 48}{space 3}0.907{col 56}{space 4}-85.76107{col 69}{space 3} 96.52656
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 1.862021{col 28}{space 2} 1.136464{col 39}{space 1}    1.64{col 48}{space 3}0.103{col 56}{space 4}-.3818764{col 69}{space 3} 4.105918
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021253{col 28}{space 2} .0002306{col 39}{space 1}    9.22{col 48}{space 3}0.000{col 56}{space 4}   .00167{col 69}{space 3} .0025806
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}   1432.8{col 28}{space 2} 351.4862{col 39}{space 1}    4.08{col 48}{space 3}0.000{col 56}{space 4} 738.8099{col 69}{space 3}  2126.79
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0002
{txt}{col 49}Largest FMI{col 67}= {res}    0.0023
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    164.66
{txt}{col 49}        avg{col 67}= {res}    164.99
{txt}{col 49}        max{col 67}= {res}    165.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  165.0{txt}){col 67}= {res}      2.15
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0194

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 2.783001{col 28}{space 2} .8840738{col 39}{space 1}    3.15{col 48}{space 3}0.002{col 56}{space 4} 1.037448{col 69}{space 3} 4.528554
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 2.529013{col 28}{space 2} 2.331578{col 39}{space 1}    1.08{col 48}{space 3}0.280{col 56}{space 4}-2.074553{col 69}{space 3} 7.132579
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.6093748{col 28}{space 2}  1.15925{col 39}{space 1}   -0.53{col 48}{space 3}0.600{col 56}{space 4}-2.898248{col 69}{space 3} 1.679499
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .4776212{col 28}{space 2} .7763645{col 39}{space 1}    0.62{col 48}{space 3}0.539{col 56}{space 4}-1.055266{col 69}{space 3} 2.010509
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0024046{col 28}{space 2} .0397926{col 39}{space 1}    0.06{col 48}{space 3}0.952{col 56}{space 4}-.0761637{col 69}{space 3} .0809729
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .8721799{col 28}{space 2} .6657322{col 39}{space 1}    1.31{col 48}{space 3}0.192{col 56}{space 4}  -.44227{col 69}{space 3}  2.18663
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0007282{col 28}{space 2} .0004844{col 39}{space 1}   -1.50{col 48}{space 3}0.135{col 56}{space 4}-.0016846{col 69}{space 3} .0002282
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0698099{col 28}{space 2} .0469552{col 39}{space 1}    1.49{col 48}{space 3}0.139{col 56}{space 4}-.0229005{col 69}{space 3} .1625203
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-.1279618{col 28}{space 2} .5722001{col 39}{space 1}   -0.22{col 48}{space 3}0.823{col 56}{space 4}-1.257757{col 69}{space 3} 1.001834
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2}-.0096899{col 28}{space 2} .0140869{col 39}{space 1}   -0.69{col 48}{space 3}0.493{col 56}{space 4}-.0375037{col 69}{space 3}  .018124
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.01e-06{col 28}{space 2} 2.86e-06{col 39}{space 1}    0.70{col 48}{space 3}0.484{col 56}{space 4}-3.64e-06{col 69}{space 3} 7.65e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-4.757355{col 28}{space 2} 4.356876{col 39}{space 1}   -1.09{col 48}{space 3}0.276{col 56}{space 4}-13.35976{col 69}{space 3} 3.845053
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 4: MODEL 2+liver/kidney disease******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.1204
{txt}{col 49}Largest FMI{col 67}= {res}    0.6234
{txt}{col 49}Complete DF{col 67}= {res}        61
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      8.58
{txt}{col 49}        avg{col 67}= {res}     50.67
{txt}{col 49}        max{col 67}= {res}     58.69
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   57.2{txt}){col 67}= {res}      3.61
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0007

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-32.38699{col 26}{space 2} 94.67995{col 37}{space 1}   -0.34{col 46}{space 3}0.734{col 54}{space 4}-222.3738{col 67}{space 3} 157.5998
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 22.24142{col 26}{space 2} 121.5399{col 37}{space 1}    0.18{col 46}{space 3}0.856{col 54}{space 4}-223.6394{col 67}{space 3} 268.1222
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.622047{col 26}{space 2} 5.648811{col 37}{space 1}   -1.17{col 46}{space 3}0.246{col 54}{space 4}-17.92809{col 67}{space 3} 4.683995
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-210.7129{col 26}{space 2} 79.67188{col 37}{space 1}   -2.64{col 46}{space 3}0.011{col 54}{space 4}-370.2246{col 67}{space 3}-51.20116
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0141827{col 26}{space 2} .0662193{col 37}{space 1}    0.21{col 46}{space 3}0.831{col 54}{space 4}-.1186939{col 67}{space 3} .1470593
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-2.967164{col 26}{space 2} 6.591715{col 37}{space 1}   -0.45{col 46}{space 3}0.654{col 54}{space 4}-16.15861{col 67}{space 3} 10.22428
{txt}w1Creatinine {c |}{col 14}{res}{space 2}  94.2276{col 26}{space 2} 234.1046{col 37}{space 1}    0.40{col 46}{space 3}0.697{col 54}{space 4}-439.2907{col 67}{space 3} 627.7459
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-4636.801{col 26}{space 2} 5259.011{col 37}{space 1}   -0.88{col 46}{space 3}0.382{col 54}{space 4}-15166.04{col 67}{space 3} 5892.439
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} .1933146{col 26}{space 2} 11.19181{col 37}{space 1}    0.02{col 46}{space 3}0.986{col 54}{space 4}-22.27704{col 67}{space 3} 22.66367
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.2406371{col 26}{space 2} 1.689214{col 37}{space 1}   -0.14{col 46}{space 3}0.887{col 54}{space 4}-3.624611{col 67}{space 3} 3.143336
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} -13.3002{col 26}{space 2} 30.02616{col 37}{space 1}   -0.44{col 46}{space 3}0.660{col 54}{space 4} -73.4603{col 67}{space 3} 46.85991
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0013231{col 26}{space 2}  .000388{col 37}{space 1}    3.41{col 46}{space 3}0.001{col 54}{space 4} .0005454{col 67}{space 3} .0021007
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7113.202{col 26}{space 2} 5353.017{col 37}{space 1}    1.33{col 46}{space 3}0.189{col 54}{space 4} -3601.87{col 67}{space 3} 17828.27
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0511
{txt}{col 49}Largest FMI{col 67}= {res}    0.3820
{txt}{col 49}Complete DF{col 67}= {res}        61
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     18.37
{txt}{col 49}        avg{col 67}= {res}     54.05
{txt}{col 49}        max{col 67}= {res}     58.96
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   58.6{txt}){col 67}= {res}      4.37
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-45.41348{col 26}{space 2} 90.78748{col 37}{space 1}   -0.50{col 46}{space 3}0.619{col 54}{space 4}-227.3443{col 67}{space 3} 136.5173
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-27.82467{col 26}{space 2} 112.6511{col 37}{space 1}   -0.25{col 46}{space 3}0.806{col 54}{space 4}-253.9398{col 67}{space 3} 198.2905
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.779229{col 26}{space 2} 5.458635{col 37}{space 1}   -1.24{col 46}{space 3}0.219{col 54}{space 4} -17.7021{col 67}{space 3} 4.143641
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-198.8452{col 26}{space 2} 76.72905{col 37}{space 1}   -2.59{col 46}{space 3}0.012{col 54}{space 4}-352.3927{col 67}{space 3}-45.29771
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0505098{col 26}{space 2} .0632553{col 37}{space 1}    0.80{col 46}{space 3}0.428{col 54}{space 4} -.076205{col 67}{space 3} .1772246
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-8.314222{col 26}{space 2} 6.394648{col 37}{space 1}   -1.30{col 46}{space 3}0.199{col 54}{space 4}-21.11091{col 67}{space 3} 4.482469
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 86.83815{col 26}{space 2} 185.7556{col 37}{space 1}    0.47{col 46}{space 3}0.646{col 54}{space 4}-302.8535{col 67}{space 3} 476.5298
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 237.6194{col 26}{space 2} 5095.234{col 37}{space 1}    0.05{col 46}{space 3}0.963{col 54}{space 4}-9962.313{col 67}{space 3} 10437.55
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 11.17375{col 26}{space 2} 10.62459{col 37}{space 1}    1.05{col 46}{space 3}0.297{col 54}{space 4}-10.10673{col 67}{space 3} 32.45424
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.2767773{col 26}{space 2} 1.625345{col 37}{space 1}   -0.17{col 46}{space 3}0.865{col 54}{space 4}-3.530607{col 67}{space 3} 2.977052
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-10.00655{col 26}{space 2} 28.81172{col 37}{space 1}   -0.35{col 46}{space 3}0.730{col 54}{space 4}-67.68159{col 67}{space 3} 47.66849
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0015792{col 26}{space 2} .0003726{col 37}{space 1}    4.24{col 46}{space 3}0.000{col 54}{space 4} .0008331{col 67}{space 3} .0023253
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2108.417{col 26}{space 2} 5192.726{col 37}{space 1}    0.41{col 46}{space 3}0.686{col 54}{space 4}-8285.296{col 67}{space 3} 12502.13
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0135
{txt}{col 49}Largest FMI{col 67}= {res}    0.0595
{txt}{col 49}Complete DF{col 67}= {res}        61
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     53.52
{txt}{col 49}        avg{col 67}= {res}     57.99
{txt}{col 49}        max{col 67}= {res}     58.87
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   59.0{txt}){col 67}= {res}      1.83
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0691

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.281103{col 26}{space 2} 1.030348{col 37}{space 1}    2.21{col 46}{space 3}0.031{col 54}{space 4} .2188569{col 67}{space 3} 4.343349
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  .415251{col 26}{space 2} 1.254183{col 37}{space 1}    0.33{col 46}{space 3}0.742{col 54}{space 4}-2.094491{col 67}{space 3} 2.924993
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0008309{col 26}{space 2} .0631389{col 37}{space 1}    0.01{col 46}{space 3}0.990{col 54}{space 4}-.1255326{col 67}{space 3} .1271944
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.0767695{col 26}{space 2} .8882236{col 37}{space 1}   -0.09{col 46}{space 3}0.931{col 54}{space 4}-1.854647{col 67}{space 3} 1.701108
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0009447{col 26}{space 2} .0007249{col 37}{space 1}   -1.30{col 46}{space 3}0.198{col 54}{space 4}-.0023961{col 67}{space 3} .0005067
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  .111049{col 26}{space 2} .0741995{col 37}{space 1}    1.50{col 46}{space 3}0.140{col 54}{space 4}-.0374906{col 67}{space 3} .2595887
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 1.563545{col 26}{space 2} 1.789661{col 37}{space 1}    0.87{col 46}{space 3}0.386{col 54}{space 4}-2.025254{col 67}{space 3} 5.152344
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-77.44488{col 26}{space 2} 58.49397{col 37}{space 1}   -1.32{col 46}{space 3}0.191{col 54}{space 4}-194.5118{col 67}{space 3} 39.62205
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}  .052385{col 26}{space 2} .1208678{col 37}{space 1}    0.43{col 46}{space 3}0.666{col 54}{space 4}-.1894951{col 67}{space 3}  .294265
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0106696{col 26}{space 2} .0185981{col 37}{space 1}   -0.57{col 46}{space 3}0.568{col 54}{space 4} -.047886{col 67}{space 3} .0265468
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-.3417972{col 26}{space 2}  .330931{col 37}{space 1}   -1.03{col 46}{space 3}0.306{col 54}{space 4} -1.00411{col 67}{space 3} .3205155
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 4.80e-06{col 26}{space 2} 4.26e-06{col 37}{space 1}    1.12{col 46}{space 3}0.265{col 54}{space 4}-3.74e-06{col 67}{space 3} .0000133
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 73.32848{col 26}{space 2} 59.73154{col 37}{space 1}    1.23{col 46}{space 3}0.224{col 54}{space 4}-46.21417{col 67}{space 3} 192.8711
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0181
{txt}{col 49}Largest FMI{col 67}= {res}    0.1121
{txt}{col 49}Complete DF{col 67}= {res}        92
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     66.00
{txt}{col 49}        avg{col 67}= {res}     84.22
{txt}{col 49}        max{col 67}= {res}     89.96
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   89.9{txt}){col 67}= {res}      6.92
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-105.9754{col 26}{space 2} 77.99683{col 37}{space 1}   -1.36{col 46}{space 3}0.178{col 54}{space 4}-260.9338{col 67}{space 3} 48.98304
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-97.94924{col 26}{space 2} 106.4054{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-309.3726{col 67}{space 3} 113.4742
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2.238842{col 26}{space 2} 4.535047{col 37}{space 1}   -0.49{col 46}{space 3}0.623{col 54}{space 4}-11.24856{col 67}{space 3} 6.770878
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-58.03509{col 26}{space 2} 74.78925{col 37}{space 1}   -0.78{col 46}{space 3}0.440{col 54}{space 4}-206.6217{col 67}{space 3} 90.55152
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}  .035944{col 26}{space 2} .0515303{col 37}{space 1}    0.70{col 46}{space 3}0.487{col 54}{space 4}  -.06644{col 67}{space 3}  .138328
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 6.971719{col 26}{space 2}  5.40487{col 37}{space 1}    1.29{col 46}{space 3}0.200{col 54}{space 4}-3.766268{col 67}{space 3} 17.70971
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-102.4406{col 26}{space 2}  204.994{col 37}{space 1}   -0.50{col 46}{space 3}0.619{col 54}{space 4}-511.7246{col 67}{space 3} 306.8434
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-962.4941{col 26}{space 2} 6236.402{col 37}{space 1}   -0.15{col 46}{space 3}0.878{col 54}{space 4}-13401.96{col 67}{space 3} 11476.97
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 12.27572{col 26}{space 2} 9.269335{col 37}{space 1}    1.32{col 46}{space 3}0.189{col 54}{space 4}-6.161691{col 67}{space 3} 30.71312
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-1.764376{col 26}{space 2} 1.539886{col 37}{space 1}   -1.15{col 46}{space 3}0.255{col 54}{space 4}-4.823747{col 67}{space 3} 1.294994
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} .4020883{col 26}{space 2} 27.89109{col 37}{space 1}    0.01{col 46}{space 3}0.989{col 54}{space 4}-55.01329{col 67}{space 3} 55.81747
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0020568{col 26}{space 2} .0003148{col 37}{space 1}    6.53{col 46}{space 3}0.000{col 54}{space 4} .0014314{col 67}{space 3} .0026823
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2096.997{col 26}{space 2} 6236.121{col 37}{space 1}    0.34{col 46}{space 3}0.738{col 54}{space 4}-10340.86{col 67}{space 3} 14534.86
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0154
{txt}{col 49}Largest FMI{col 67}= {res}    0.1056
{txt}{col 49}Complete DF{col 67}= {res}        92
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     67.72
{txt}{col 49}        avg{col 67}= {res}     84.48
{txt}{col 49}        max{col 67}= {res}     90.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   89.9{txt}){col 67}= {res}      9.03
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-127.2779{col 26}{space 2} 80.04171{col 37}{space 1}   -1.59{col 46}{space 3}0.115{col 54}{space 4}-286.2961{col 67}{space 3} 31.74034
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-203.6701{col 26}{space 2} 109.4009{col 37}{space 1}   -1.86{col 46}{space 3}0.066{col 54}{space 4} -421.057{col 67}{space 3} 13.71677
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.325301{col 26}{space 2} 4.654324{col 37}{space 1}    0.28{col 46}{space 3}0.776{col 54}{space 4}-7.921253{col 67}{space 3} 10.57185
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-25.44553{col 26}{space 2}  76.7769{col 37}{space 1}   -0.33{col 46}{space 3}0.741{col 54}{space 4}-177.9799{col 67}{space 3} 127.0889
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0784456{col 26}{space 2}  .052927{col 37}{space 1}    1.48{col 46}{space 3}0.142{col 54}{space 4}-.0267144{col 67}{space 3} .1836056
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 10.76364{col 26}{space 2} 5.547763{col 37}{space 1}    1.94{col 46}{space 3}0.055{col 54}{space 4}-.2581084{col 67}{space 3}  21.7854
{txt}w1Creatinine {c |}{col 14}{res}{space 2} -19.0933{col 26}{space 2} 208.5684{col 37}{space 1}   -0.09{col 46}{space 3}0.927{col 54}{space 4}-434.9803{col 67}{space 3} 396.7937
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-420.5493{col 26}{space 2} 6426.332{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4}-13245.07{col 67}{space 3} 12403.97
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 13.93673{col 26}{space 2} 9.479823{col 37}{space 1}    1.47{col 46}{space 3}0.145{col 54}{space 4}-4.913619{col 67}{space 3} 32.78708
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.4492366{col 26}{space 2} 1.579983{col 37}{space 1}   -0.28{col 46}{space 3}0.777{col 54}{space 4}  -3.5882{col 67}{space 3} 2.689727
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-16.10095{col 26}{space 2} 28.55975{col 37}{space 1}   -0.56{col 46}{space 3}0.574{col 54}{space 4}-72.83982{col 67}{space 3} 40.63792
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0026211{col 26}{space 2} .0003231{col 37}{space 1}    8.11{col 46}{space 3}0.000{col 54}{space 4} .0019793{col 67}{space 3}  .003263
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 756.0437{col 26}{space 2} 6428.794{col 37}{space 1}    0.12{col 46}{space 3}0.907{col 54}{space 4}-12073.02{col 67}{space 3} 13585.11
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0052
{txt}{col 49}Largest FMI{col 67}= {res}    0.0514
{txt}{col 49}Complete DF{col 67}= {res}        92
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     81.50
{txt}{col 49}        avg{col 67}= {res}     89.03
{txt}{col 49}        max{col 67}= {res}     90.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   90.0{txt}){col 67}= {res}      1.42
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1797

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.757244{col 26}{space 2} 1.046557{col 37}{space 1}    2.63{col 46}{space 3}0.010{col 54}{space 4}  .678083{col 67}{space 3} 4.836405
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.9435204{col 26}{space 2} 1.424352{col 37}{space 1}   -0.66{col 46}{space 3}0.509{col 54}{space 4}-3.773322{col 67}{space 3} 1.886281
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0152744{col 26}{space 2} .0608885{col 37}{space 1}   -0.25{col 46}{space 3}0.802{col 54}{space 4}-.1362393{col 67}{space 3} .1056904
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.442921{col 26}{space 2} 1.003492{col 37}{space 1}    1.44{col 46}{space 3}0.154{col 54}{space 4} -.550691{col 67}{space 3} 3.436533
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0006881{col 26}{space 2} .0006907{col 37}{space 1}   -1.00{col 46}{space 3}0.322{col 54}{space 4}-.0020603{col 67}{space 3} .0006841
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-.0121552{col 26}{space 2} .0725226{col 37}{space 1}   -0.17{col 46}{space 3}0.867{col 54}{space 4}-.1562334{col 67}{space 3} .1319229
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-.4390173{col 26}{space 2} 2.671601{col 37}{space 1}   -0.16{col 46}{space 3}0.870{col 54}{space 4}-5.754168{col 67}{space 3} 4.876133
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 117.3272{col 26}{space 2} 80.28242{col 37}{space 1}    1.46{col 46}{space 3}0.147{col 54}{space 4} -42.1999{col 67}{space 3} 276.8544
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-.0004007{col 26}{space 2} .1223769{col 37}{space 1}   -0.00{col 46}{space 3}0.997{col 54}{space 4}-.2435637{col 67}{space 3} .2427623
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0064081{col 26}{space 2} .0206544{col 37}{space 1}   -0.31{col 46}{space 3}0.757{col 54}{space 4}-.0474415{col 67}{space 3} .0346254
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} .3831209{col 26}{space 2} .3738775{col 37}{space 1}    1.02{col 46}{space 3}0.308{col 54}{space 4} -.359668{col 67}{space 3}  1.12591
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.41e-06{col 26}{space 2} 4.22e-06{col 37}{space 1}    0.57{col 46}{space 3}0.570{col 54}{space 4}-5.98e-06{col 67}{space 3} .0000108
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -122.555{col 26}{space 2} 80.34474{col 37}{space 1}   -1.53{col 46}{space 3}0.131{col 54}{space 4}-282.2073{col 67}{space 3} 37.09725
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. **INTERACTION by Race**
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0419
{txt}{col 49}Largest FMI{col 67}= {res}    0.3870
{txt}{col 49}Complete DF{col 67}= {res}       164
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     25.15
{txt}{col 49}        avg{col 67}= {res}    146.60
{txt}{col 49}        max{col 67}= {res}    161.92
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  160.7{txt}){col 67}= {res}     10.33
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} -85.3246{col 28}{space 2} 68.23129{col 39}{space 1}   -1.25{col 48}{space 3}0.213{col 56}{space 4}-220.0736{col 69}{space 3} 49.42441
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-255.2646{col 28}{space 2} 187.9865{col 39}{space 1}   -1.36{col 48}{space 3}0.177{col 56}{space 4}-626.6587{col 69}{space 3} 116.1295
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 92.41925{col 28}{space 2} 91.69964{col 39}{space 1}    1.01{col 48}{space 3}0.315{col 56}{space 4} -88.7113{col 69}{space 3} 273.5498
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-39.14595{col 28}{space 2} 77.77643{col 39}{space 1}   -0.50{col 48}{space 3}0.616{col 56}{space 4}-192.9277{col 69}{space 3} 114.6358
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-6.000881{col 28}{space 2} 3.281812{col 39}{space 1}   -1.83{col 48}{space 3}0.069{col 56}{space 4}-12.48159{col 69}{space 3} .4798284
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-133.4207{col 28}{space 2} 53.14768{col 39}{space 1}   -2.51{col 48}{space 3}0.013{col 56}{space 4}-238.3732{col 69}{space 3}-28.46806
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0173688{col 28}{space 2} .0383989{col 39}{space 1}    0.45{col 48}{space 3}0.652{col 56}{space 4}-.0584613{col 69}{space 3}  .093199
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2.293407{col 28}{space 2} 4.012472{col 39}{space 1}    0.57{col 48}{space 3}0.568{col 56}{space 4}-5.630112{col 69}{space 3} 10.21693
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} 12.83697{col 28}{space 2} 145.7066{col 39}{space 1}    0.09{col 48}{space 3}0.930{col 56}{space 4}-287.1578{col 69}{space 3} 312.8317
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} -1609.84{col 28}{space 2} 3973.325{col 39}{space 1}   -0.41{col 48}{space 3}0.686{col 56}{space 4}-9462.591{col 69}{space 3} 6242.911
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 6.930816{col 28}{space 2} 6.892116{col 39}{space 1}    1.01{col 48}{space 3}0.316{col 56}{space 4}-6.692003{col 69}{space 3} 20.55363
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} -.843838{col 28}{space 2} 1.112092{col 39}{space 1}   -0.76{col 48}{space 3}0.449{col 56}{space 4}-3.039952{col 69}{space 3} 1.352276
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-5.029264{col 28}{space 2} 19.96638{col 39}{space 1}   -0.25{col 48}{space 3}0.801{col 56}{space 4}-44.45916{col 69}{space 3} 34.40063
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0017142{col 28}{space 2}  .000234{col 39}{space 1}    7.32{col 48}{space 3}0.000{col 56}{space 4} .0012521{col 69}{space 3} .0021764
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 3489.774{col 28}{space 2} 4005.015{col 39}{space 1}    0.87{col 48}{space 3}0.385{col 56}{space 4}-4425.716{col 69}{space 3} 11405.26
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0137
{txt}{col 49}Largest FMI{col 67}= {res}    0.1347
{txt}{col 49}Complete DF{col 67}= {res}       164
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     90.46
{txt}{col 49}        avg{col 67}= {res}    154.98
{txt}{col 49}        max{col 67}= {res}    161.92
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  161.8{txt}){col 67}= {res}     12.66
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-89.33034{col 28}{space 2} 69.95145{col 39}{space 1}   -1.28{col 48}{space 3}0.203{col 56}{space 4}-227.4666{col 69}{space 3} 48.80597
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-262.1329{col 28}{space 2} 191.2926{col 39}{space 1}   -1.37{col 48}{space 3}0.172{col 56}{space 4}-639.9086{col 69}{space 3} 115.6428
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}  99.5104{col 28}{space 2}  93.6196{col 39}{space 1}    1.06{col 48}{space 3}0.289{col 56}{space 4}-85.37038{col 69}{space 3} 284.3912
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-113.4531{col 28}{space 2}  78.4062{col 39}{space 1}   -1.45{col 48}{space 3}0.150{col 56}{space 4}-268.3086{col 69}{space 3} 41.40239
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-4.318645{col 28}{space 2} 3.375519{col 39}{space 1}   -1.28{col 48}{space 3}0.203{col 56}{space 4} -10.9844{col 69}{space 3} 2.347108
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-107.7378{col 28}{space 2} 54.64795{col 39}{space 1}   -1.97{col 48}{space 3}0.050{col 56}{space 4}-215.6523{col 69}{space 3} .1768221
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0477365{col 28}{space 2} .0394784{col 39}{space 1}    1.21{col 48}{space 3}0.228{col 56}{space 4}-.0302248{col 69}{space 3} .1256978
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2.584043{col 28}{space 2} 4.128896{col 39}{space 1}    0.63{col 48}{space 3}0.532{col 56}{space 4}-5.569437{col 69}{space 3} 10.73752
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}  57.8998{col 28}{space 2} 129.4466{col 39}{space 1}    0.45{col 48}{space 3}0.656{col 56}{space 4}-199.2509{col 69}{space 3} 315.0504
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} 759.0653{col 28}{space 2} 4068.835{col 39}{space 1}    0.19{col 48}{space 3}0.852{col 56}{space 4}-7280.345{col 69}{space 3} 8798.475
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 10.39532{col 28}{space 2} 6.968239{col 39}{space 1}    1.49{col 48}{space 3}0.138{col 56}{space 4}-3.366566{col 69}{space 3}  24.1572
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.1490371{col 28}{space 2} 1.143985{col 39}{space 1}   -0.13{col 48}{space 3}0.897{col 56}{space 4}-2.408136{col 69}{space 3} 2.110062
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-16.09825{col 28}{space 2} 20.50247{col 39}{space 1}   -0.79{col 48}{space 3}0.433{col 56}{space 4}-56.58546{col 69}{space 3} 24.38896
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2}   .00213{col 28}{space 2} .0002407{col 39}{space 1}    8.85{col 48}{space 3}0.000{col 56}{space 4} .0016546{col 69}{space 3} .0026054
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 660.1075{col 28}{space 2}  4099.61{col 39}{space 1}    0.16{col 48}{space 3}0.872{col 56}{space 4}-7440.025{col 69}{space 3}  8760.24
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0013
{txt}{col 49}Largest FMI{col 67}= {res}    0.0136
{txt}{col 49}Complete DF{col 67}= {res}       164
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    158.80
{txt}{col 49}        avg{col 67}= {res}    161.69
{txt}{col 49}        max{col 67}= {res}    162.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  162.0{txt}){col 67}= {res}      1.82
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0440

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 2.421109{col 28}{space 2} .8626664{col 39}{space 1}    2.81{col 48}{space 3}0.006{col 56}{space 4} .7175882{col 69}{space 3}  4.12463
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.806318{col 28}{space 2} 2.352927{col 39}{space 1}    0.77{col 48}{space 3}0.444{col 56}{space 4}-2.840051{col 69}{space 3} 6.452687
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.1739186{col 28}{space 2} 1.152704{col 39}{space 1}   -0.15{col 48}{space 3}0.880{col 56}{space 4}-2.450182{col 69}{space 3} 2.102345
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-.1422883{col 28}{space 2} .9618345{col 39}{space 1}   -0.15{col 48}{space 3}0.883{col 56}{space 4}-2.041661{col 69}{space 3} 1.757084
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-.0008986{col 28}{space 2} .0416528{col 39}{space 1}   -0.02{col 48}{space 3}0.983{col 56}{space 4}-.0831515{col 69}{space 3} .0813542
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .7757153{col 28}{space 2} .6743955{col 39}{space 1}    1.15{col 48}{space 3}0.252{col 56}{space 4}-.5560244{col 69}{space 3} 2.107455
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0006854{col 28}{space 2} .0004866{col 39}{space 1}   -1.41{col 48}{space 3}0.161{col 56}{space 4}-.0016463{col 69}{space 3} .0002754
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}  .037666{col 28}{space 2} .0509363{col 39}{space 1}    0.74{col 48}{space 3}0.461{col 56}{space 4}-.0629187{col 69}{space 3} .1382507
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}  .402283{col 28}{space 2} 1.503444{col 39}{space 1}    0.27{col 48}{space 3}0.789{col 56}{space 4}-2.567041{col 69}{space 3} 3.371607
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} 32.52181{col 28}{space 2} 49.45208{col 39}{space 1}    0.66{col 48}{space 3}0.512{col 56}{space 4}-65.13351{col 69}{space 3} 130.1771
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} .0388398{col 28}{space 2} .0855988{col 39}{space 1}    0.45{col 48}{space 3}0.651{col 56}{space 4}-.1301947{col 69}{space 3} .2078744
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.0069481{col 28}{space 2} .0141043{col 39}{space 1}   -0.49{col 48}{space 3}0.623{col 56}{space 4}-.0348003{col 69}{space 3}  .020904
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2} .1037808{col 28}{space 2} .2528425{col 39}{space 1}    0.41{col 48}{space 3}0.682{col 56}{space 4}-.3955118{col 69}{space 3} .6030733
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.63e-06{col 28}{space 2} 2.97e-06{col 39}{space 1}    0.88{col 48}{space 3}0.378{col 56}{space 4}-3.24e-06{col 69}{space 3} 8.49e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-37.96102{col 28}{space 2} 49.83764{col 39}{space 1}   -0.76{col 48}{space 3}0.447{col 56}{space 4}-136.3778{col 69}{space 3} 60.45574
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0424
{txt}{col 49}Largest FMI{col 67}= {res}    0.3704
{txt}{col 49}Complete DF{col 67}= {res}       165
{txt}{col 49}DF:     min{col 67}= {res}     27.02
{txt}{col 49}        avg{col 67}= {res}    147.88
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}        max{col 67}= {res}    162.99
{txt}{col 49}{help j_robustsingular##|_new:F(  12,      .)}{col 67}=          {res}.
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}=          {res}.

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-46.08662{col 26}{space 2} 55.98793{col 37}{space 1}   -0.82{col 46}{space 3}0.412{col 54}{space 4}-156.6433{col 67}{space 3} 64.47007
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-28.60585{col 26}{space 2} 76.77417{col 37}{space 1}   -0.37{col 46}{space 3}0.710{col 54}{space 4}-180.3579{col 67}{space 3} 123.1462
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-5.942988{col 26}{space 2} 3.282719{col 37}{space 1}   -1.81{col 46}{space 3}0.072{col 54}{space 4}-12.42523{col 67}{space 3} .5392491
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-75.00867{col 26}{space 2} 55.08858{col 37}{space 1}   -1.36{col 46}{space 3}0.175{col 54}{space 4}-183.8047{col 67}{space 3} 33.78733
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-134.2964{col 26}{space 2} 53.15182{col 37}{space 1}   -2.53{col 46}{space 3}0.012{col 54}{space 4}-239.2525{col 67}{space 3}-29.34037
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0151062{col 26}{space 2} .0383342{col 37}{space 1}    0.39{col 46}{space 3}0.694{col 54}{space 4}-.0605924{col 67}{space 3} .0908048
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 2.035893{col 26}{space 2} 4.006237{col 37}{space 1}    0.51{col 46}{space 3}0.612{col 54}{space 4}-5.874987{col 67}{space 3} 9.946773
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-6.016731{col 26}{space 2} 142.3017{col 37}{space 1}   -0.04{col 46}{space 3}0.967{col 54}{space 4} -297.985{col 67}{space 3} 285.9516
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-1914.674{col 26}{space 2} 3963.256{col 37}{space 1}   -0.48{col 46}{space 3}0.630{col 54}{space 4}-9747.328{col 67}{space 3}  5917.98
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 7.170885{col 26}{space 2} 6.876716{col 37}{space 1}    1.04{col 46}{space 3}0.299{col 54}{space 4}-6.419295{col 67}{space 3} 20.76107
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} -.782888{col 26}{space 2} 1.110225{col 37}{space 1}   -0.71{col 46}{space 3}0.482{col 54}{space 4}-2.975203{col 67}{space 3} 1.409427
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-3.919335{col 26}{space 2} 19.93909{col 37}{space 1}   -0.20{col 46}{space 3}0.844{col 54}{space 4}-43.29354{col 67}{space 3} 35.45487
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0016723{col 26}{space 2} .0002303{col 37}{space 1}    7.26{col 46}{space 3}0.000{col 54}{space 4} .0012175{col 67}{space 3} .0021271
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 3846.925{col 26}{space 2} 3991.835{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}-4042.244{col 67}{space 3} 11736.09
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0134
{txt}{col 49}Largest FMI{col 67}= {res}    0.1239
{txt}{col 49}Complete DF{col 67}= {res}       165
{txt}{col 49}DF:     min{col 67}= {res}     96.70
{txt}{col 49}        avg{col 67}= {res}    155.96
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}        max{col 67}= {res}    162.95
{txt}{col 49}{help j_robustsingular##|_new:F(  12,      .)}{col 67}=          {res}.
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}=          {res}.

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-47.06249{col 26}{space 2}  57.5738{col 37}{space 1}   -0.82{col 46}{space 3}0.415{col 54}{space 4}-160.7497{col 67}{space 3} 66.62473
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} -102.101{col 26}{space 2} 77.60912{col 37}{space 1}   -1.32{col 46}{space 3}0.190{col 54}{space 4}-255.3695{col 67}{space 3} 51.16746
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-4.257574{col 26}{space 2} 3.375131{col 37}{space 1}   -1.26{col 46}{space 3}0.209{col 54}{space 4}-10.92222{col 67}{space 3} 2.407069
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-68.06511{col 26}{space 2} 56.39321{col 37}{space 1}   -1.21{col 46}{space 3}0.229{col 54}{space 4}-179.4235{col 67}{space 3} 43.29327
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-108.6887{col 26}{space 2} 54.66313{col 37}{space 1}   -1.99{col 46}{space 3}0.048{col 54}{space 4}-216.6282{col 67}{space 3}-.7490662
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0453079{col 26}{space 2} .0394096{col 37}{space 1}    1.15{col 46}{space 3}0.252{col 54}{space 4}-.0325132{col 67}{space 3}  .123129
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 2.309858{col 26}{space 2}  4.12036{col 37}{space 1}    0.56{col 46}{space 3}0.576{col 54}{space 4}-5.826324{col 67}{space 3} 10.44604
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 37.63954{col 26}{space 2}  127.156{col 37}{space 1}    0.30{col 46}{space 3}0.768{col 54}{space 4}-214.7398{col 67}{space 3} 290.0189
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 429.9676{col 26}{space 2} 4062.779{col 37}{space 1}    0.11{col 46}{space 3}0.916{col 54}{space 4}-7597.597{col 67}{space 3} 8457.532
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 10.65167{col 26}{space 2} 6.962272{col 37}{space 1}    1.53{col 46}{space 3}0.128{col 54}{space 4}-3.097551{col 67}{space 3} 24.40089
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0825929{col 26}{space 2}  1.14218{col 37}{space 1}   -0.07{col 46}{space 3}0.942{col 54}{space 4}-2.338006{col 67}{space 3}  2.17282
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-14.89916{col 26}{space 2} 20.48011{col 37}{space 1}   -0.73{col 46}{space 3}0.468{col 54}{space 4}-55.34038{col 67}{space 3} 25.54206
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0020848{col 26}{space 2}  .000237{col 37}{space 1}    8.80{col 46}{space 3}0.000{col 54}{space 4} .0016168{col 67}{space 3} .0025528
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1032.785{col 26}{space 2} 4090.817{col 37}{space 1}    0.25{col 46}{space 3}0.801{col 54}{space 4}-7050.071{col 67}{space 3}  9115.64
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0014
{txt}{col 49}Largest FMI{col 67}= {res}    0.0131
{txt}{col 49}Complete DF{col 67}= {res}       165
{txt}{col 49}DF:     min{col 67}= {res}    159.91
{txt}{col 49}        avg{col 67}= {res}    162.67
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}        max{col 67}= {res}    163.00
{txt}{col 49}{help j_robustsingular##|_new:F(  12,      .)}{col 67}=          {res}.
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}=          {res}.

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.347178{col 26}{space 2} .7080767{col 37}{space 1}    3.31{col 46}{space 3}0.001{col 54}{space 4} .9489916{col 67}{space 3} 3.745365
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} -.162122{col 26}{space 2} .9499113{col 37}{space 1}   -0.17{col 46}{space 3}0.865{col 54}{space 4}-2.037861{col 67}{space 3} 1.713617
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0010014{col 26}{space 2} .0415235{col 37}{space 1}   -0.02{col 46}{space 3}0.981{col 54}{space 4}-.0829951{col 67}{space 3} .0809923
{txt}{space 8}Race {c |}{col 14}{res}{space 2} 1.467206{col 26}{space 2} .6927199{col 37}{space 1}    2.12{col 46}{space 3}0.036{col 54}{space 4} .0993423{col 67}{space 3} 2.835069
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .7774002{col 26}{space 2} .6723053{col 37}{space 1}    1.16{col 46}{space 3}0.249{col 54}{space 4}-.5501508{col 67}{space 3} 2.104951
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0006812{col 26}{space 2} .0004843{col 37}{space 1}   -1.41{col 46}{space 3}0.161{col 54}{space 4}-.0016376{col 67}{space 3} .0002752
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0381352{col 26}{space 2} .0506855{col 37}{space 1}    0.75{col 46}{space 3}0.453{col 54}{space 4}-.0619497{col 67}{space 3} .1382201
{txt}w1Creatinine {c |}{col 14}{res}{space 2} .4374598{col 26}{space 2} 1.479735{col 37}{space 1}    0.30{col 46}{space 3}0.768{col 54}{space 4}-2.484883{col 67}{space 3} 3.359803
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 33.09921{col 26}{space 2} 49.15378{col 37}{space 1}    0.67{col 46}{space 3}0.502{col 54}{space 4}-63.96249{col 67}{space 3} 130.1609
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} .0384001{col 26}{space 2} .0852878{col 37}{space 1}    0.45{col 46}{space 3}0.653{col 54}{space 4}-.1300125{col 67}{space 3} .2068126
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0070671{col 26}{space 2} .0140413{col 37}{space 1}   -0.50{col 46}{space 3}0.615{col 54}{space 4}-.0347935{col 67}{space 3} .0206593
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} .1016758{col 26}{space 2} .2517083{col 37}{space 1}    0.40{col 46}{space 3}0.687{col 54}{space 4}-.3953542{col 67}{space 3} .5987057
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.71e-06{col 26}{space 2} 2.92e-06{col 37}{space 1}    0.93{col 46}{space 3}0.355{col 54}{space 4}-3.05e-06{col 67}{space 3} 8.46e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-39.96267{col 26}{space 2}  49.5063{col 37}{space 1}   -0.81{col 46}{space 3}0.421{col 54}{space 4}-137.7205{col 67}{space 3} 57.79519
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. ***********MODEL 5: MODEL2+OXIDATIVE STRESS******
. 
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0628
{txt}{col 49}Largest FMI{col 67}= {res}    0.4272
{txt}{col 49}Complete DF{col 67}= {res}        63
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     16.04
{txt}{col 49}        avg{col 67}= {res}     56.31
{txt}{col 49}        max{col 67}= {res}     61.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   60.4{txt}){col 67}= {res}      4.66
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-40.09528{col 26}{space 2} 89.24444{col 37}{space 1}   -0.45{col 46}{space 3}0.655{col 54}{space 4}-218.6753{col 67}{space 3} 138.4847
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 15.02056{col 26}{space 2}  86.0511{col 37}{space 1}    0.17{col 46}{space 3}0.862{col 54}{space 4}-157.0548{col 67}{space 3} 187.0959
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.120342{col 26}{space 2} 4.851434{col 37}{space 1}   -1.26{col 46}{space 3}0.212{col 54}{space 4}-15.82206{col 67}{space 3} 3.581373
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-223.1669{col 26}{space 2} 76.48087{col 37}{space 1}   -2.92{col 46}{space 3}0.005{col 54}{space 4}-376.1336{col 67}{space 3}-70.20017
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0358564{col 26}{space 2} .0643448{col 37}{space 1}    0.56{col 46}{space 3}0.579{col 54}{space 4}-.0928969{col 67}{space 3} .1646096
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-2.685876{col 26}{space 2}  6.06748{col 37}{space 1}   -0.44{col 46}{space 3}0.660{col 54}{space 4}-14.81929{col 67}{space 3} 9.447539
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} .1972855{col 26}{space 2} 6.016425{col 37}{space 1}    0.03{col 46}{space 3}0.974{col 54}{space 4}-12.55448{col 67}{space 3} 12.94905
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}  189.069{col 26}{space 2} 120.6495{col 37}{space 1}    1.57{col 46}{space 3}0.122{col 54}{space 4}-52.18522{col 67}{space 3} 430.3232
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-2.303787{col 26}{space 2} 18.34376{col 37}{space 1}   -0.13{col 46}{space 3}0.900{col 54}{space 4} -38.9859{col 67}{space 3} 34.37833
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0013265{col 26}{space 2} .0003571{col 37}{space 1}    3.71{col 46}{space 3}0.000{col 54}{space 4} .0006121{col 67}{space 3} .0020409
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1528.11{col 26}{space 2}  755.009{col 37}{space 1}    2.02{col 46}{space 3}0.047{col 54}{space 4} 18.40051{col 67}{space 3}  3037.82
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0472
{txt}{col 49}Largest FMI{col 67}= {res}    0.3479
{txt}{col 49}Complete DF{col 67}= {res}        63
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     20.94
{txt}{col 49}        avg{col 67}= {res}     56.75
{txt}{col 49}        max{col 67}= {res}     60.97
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   60.6{txt}){col 67}= {res}      5.09
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-32.77983{col 26}{space 2} 86.66376{col 37}{space 1}   -0.38{col 46}{space 3}0.707{col 54}{space 4}-206.1238{col 67}{space 3} 140.5641
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-8.317525{col 26}{space 2} 84.36264{col 37}{space 1}   -0.10{col 46}{space 3}0.922{col 54}{space 4}-177.0423{col 67}{space 3} 160.4073
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-5.235692{col 26}{space 2} 4.755061{col 37}{space 1}   -1.10{col 46}{space 3}0.275{col 54}{space 4}-14.74607{col 67}{space 3} 4.274686
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-200.2926{col 26}{space 2} 74.59413{col 37}{space 1}   -2.69{col 46}{space 3}0.009{col 54}{space 4}-349.4701{col 67}{space 3}-51.11518
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0440126{col 26}{space 2} .0627399{col 37}{space 1}    0.70{col 46}{space 3}0.486{col 54}{space 4}-.0815097{col 67}{space 3}  .169535
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-5.402471{col 26}{space 2} 5.946488{col 37}{space 1}   -0.91{col 46}{space 3}0.367{col 54}{space 4}-17.29561{col 67}{space 3} 6.490667
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-2.911254{col 26}{space 2} 5.574358{col 37}{space 1}   -0.52{col 46}{space 3}0.607{col 54}{space 4} -14.5057{col 67}{space 3} 8.683187
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 156.6912{col 26}{space 2} 118.0972{col 37}{space 1}    1.33{col 46}{space 3}0.190{col 54}{space 4}-79.47605{col 67}{space 3} 392.8584
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-1.786181{col 26}{space 2} 17.93018{col 37}{space 1}   -0.10{col 46}{space 3}0.921{col 54}{space 4}-37.64149{col 67}{space 3} 34.06913
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0015276{col 26}{space 2} .0003497{col 37}{space 1}    4.37{col 46}{space 3}0.000{col 54}{space 4} .0008279{col 67}{space 3} .0022274
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1737.949{col 26}{space 2} 738.3537{col 37}{space 1}    2.35{col 46}{space 3}0.022{col 54}{space 4} 261.5026{col 67}{space 3} 3214.395
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0221
{txt}{col 49}Largest FMI{col 67}= {res}    0.1898
{txt}{col 49}Complete DF{col 67}= {res}        63
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     36.72
{txt}{col 49}        avg{col 67}= {res}     58.67
{txt}{col 49}        max{col 67}= {res}     61.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   60.9{txt}){col 67}= {res}      1.72
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0962

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.372156{col 26}{space 2} 1.018809{col 37}{space 1}    2.33{col 46}{space 3}0.023{col 54}{space 4} .3346583{col 67}{space 3} 4.409653
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .5656869{col 26}{space 2} .9915413{col 37}{space 1}    0.57{col 46}{space 3}0.570{col 54}{space 4}-1.417091{col 67}{space 3} 2.548465
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0183154{col 26}{space 2} .0558348{col 37}{space 1}   -0.33{col 46}{space 3}0.744{col 54}{space 4}-.1299659{col 67}{space 3} .0933352
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.2069948{col 26}{space 2} .8782079{col 37}{space 1}   -0.24{col 46}{space 3}0.814{col 54}{space 4}-1.963167{col 67}{space 3} 1.549178
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0007603{col 26}{space 2} .0007352{col 37}{space 1}   -1.03{col 46}{space 3}0.305{col 54}{space 4}-.0022307{col 67}{space 3} .0007101
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0994516{col 26}{space 2} .0697868{col 37}{space 1}    1.43{col 46}{space 3}0.159{col 54}{space 4}-.0400932{col 67}{space 3} .2389965
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} .0197658{col 26}{space 2} .0600508{col 37}{space 1}    0.33{col 46}{space 3}0.744{col 54}{space 4}-.1019404{col 67}{space 3} .1414721
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-.8098262{col 26}{space 2} 1.390903{col 37}{space 1}   -0.58{col 46}{space 3}0.563{col 54}{space 4}-3.591178{col 67}{space 3} 1.971526
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} .0773382{col 26}{space 2} .2111043{col 37}{space 1}    0.37{col 46}{space 3}0.715{col 54}{space 4}-.3447854{col 67}{space 3} .4994618
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 4.05e-06{col 26}{space 2} 4.09e-06{col 37}{space 1}    0.99{col 46}{space 3}0.326{col 54}{space 4}-4.12e-06{col 67}{space 3} .0000122
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.658191{col 26}{space 2} 8.698848{col 37}{space 1}   -0.19{col 46}{space 3}0.849{col 54}{space 4}-19.05227{col 67}{space 3} 15.73589
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITE//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0106
{txt}{col 49}Largest FMI{col 67}= {res}    0.0722
{txt}{col 49}Complete DF{col 67}= {res}        94
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     77.97
{txt}{col 49}        avg{col 67}= {res}     90.26
{txt}{col 49}        max{col 67}= {res}     92.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   92.0{txt}){col 67}= {res}      7.41
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-89.23056{col 26}{space 2} 79.81573{col 37}{space 1}   -1.12{col 46}{space 3}0.267{col 54}{space 4}-247.7647{col 67}{space 3} 69.30355
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-101.3977{col 26}{space 2} 88.71359{col 37}{space 1}   -1.14{col 46}{space 3}0.256{col 54}{space 4}-277.5904{col 67}{space 3} 74.79514
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2.650734{col 26}{space 2} 4.429923{col 37}{space 1}   -0.60{col 46}{space 3}0.551{col 54}{space 4}-11.44894{col 67}{space 3} 6.147473
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-62.19843{col 26}{space 2} 74.36378{col 37}{space 1}   -0.84{col 46}{space 3}0.405{col 54}{space 4}-209.8913{col 67}{space 3} 85.49448
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0460839{col 26}{space 2} .0512992{col 37}{space 1}    0.90{col 46}{space 3}0.371{col 54}{space 4}-.0558016{col 67}{space 3} .1479695
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 9.367322{col 26}{space 2} 5.224711{col 37}{space 1}    1.79{col 46}{space 3}0.076{col 54}{space 4}-1.009532{col 67}{space 3} 19.74418
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} .9347004{col 26}{space 2} 3.304023{col 37}{space 1}    0.28{col 46}{space 3}0.778{col 54}{space 4} -5.64314{col 67}{space 3} 7.512541
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 106.3947{col 26}{space 2} 132.9422{col 37}{space 1}    0.80{col 46}{space 3}0.426{col 54}{space 4}-157.6443{col 67}{space 3} 370.4337
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-.0279324{col 26}{space 2} 15.30368{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-30.44218{col 67}{space 3} 30.38632
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019982{col 26}{space 2} .0003018{col 37}{space 1}    6.62{col 46}{space 3}0.000{col 54}{space 4} .0013987{col 67}{space 3} .0025976
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 573.9373{col 26}{space 2} 809.6411{col 37}{space 1}    0.71{col 46}{space 3}0.480{col 54}{space 4}-1034.079{col 67}{space 3} 2181.954
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0062
{txt}{col 49}Largest FMI{col 67}= {res}    0.0396
{txt}{col 49}Complete DF{col 67}= {res}        94
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     85.88
{txt}{col 49}        avg{col 67}= {res}     91.18
{txt}{col 49}        max{col 67}= {res}     92.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   92.0{txt}){col 67}= {res}      9.76
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-94.19027{col 26}{space 2} 81.76229{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-256.5787{col 67}{space 3} 68.19819
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-216.9566{col 26}{space 2}  91.0654{col 37}{space 1}   -2.38{col 46}{space 3}0.019{col 54}{space 4}-397.8189{col 67}{space 3} -36.0943
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.147118{col 26}{space 2} 4.547926{col 37}{space 1}    0.25{col 46}{space 3}0.801{col 54}{space 4}-7.885414{col 67}{space 3} 10.17965
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-33.23886{col 26}{space 2}  76.3394{col 37}{space 1}   -0.44{col 46}{space 3}0.664{col 54}{space 4}-184.8546{col 67}{space 3} 118.3769
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0856228{col 26}{space 2} .0526504{col 37}{space 1}    1.63{col 46}{space 3}0.107{col 54}{space 4}-.0189452{col 67}{space 3} .1901907
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 11.45713{col 26}{space 2} 5.362194{col 37}{space 1}    2.14{col 46}{space 3}0.035{col 54}{space 4} .8073575{col 67}{space 3}  22.1069
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-.5147437{col 26}{space 2} 3.312298{col 37}{space 1}   -0.16{col 46}{space 3}0.877{col 54}{space 4}-7.096263{col 67}{space 3} 6.066776
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 43.39869{col 26}{space 2}  136.432{col 37}{space 1}    0.32{col 46}{space 3}0.751{col 54}{space 4}-227.5674{col 67}{space 3} 314.3648
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 8.198211{col 26}{space 2} 15.78352{col 37}{space 1}    0.52{col 46}{space 3}0.605{col 54}{space 4}-23.17902{col 67}{space 3} 39.57544
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0026135{col 26}{space 2} .0003099{col 37}{space 1}    8.43{col 46}{space 3}0.000{col 54}{space 4}  .001998{col 67}{space 3} .0032289
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 139.5006{col 26}{space 2} 831.1302{col 37}{space 1}    0.17{col 46}{space 3}0.867{col 54}{space 4}-1511.184{col 67}{space 3} 1790.185
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0036
{txt}{col 49}Largest FMI{col 67}= {res}    0.0274
{txt}{col 49}Complete DF{col 67}= {res}        94
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     88.31
{txt}{col 49}        avg{col 67}= {res}     91.60
{txt}{col 49}        max{col 67}= {res}     92.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   92.0{txt}){col 67}= {res}      1.56
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1308

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 3.238409{col 26}{space 2} 1.059222{col 37}{space 1}    3.06{col 46}{space 3}0.003{col 54}{space 4}  1.13458{col 67}{space 3} 5.342238
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} -.451512{col 26}{space 2} 1.178641{col 37}{space 1}   -0.38{col 46}{space 3}0.703{col 54}{space 4}-2.792419{col 67}{space 3} 1.889395
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0143142{col 26}{space 2} .0588195{col 37}{space 1}   -0.24{col 46}{space 3}0.808{col 54}{space 4}-.1311341{col 67}{space 3} .1025056
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.551699{col 26}{space 2} .9875645{col 37}{space 1}    1.57{col 46}{space 3}0.120{col 54}{space 4}-.4096866{col 67}{space 3} 3.513086
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0004341{col 26}{space 2} .0006811{col 37}{space 1}   -0.64{col 46}{space 3}0.525{col 54}{space 4}-.0017869{col 67}{space 3} .0009187
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0695025{col 26}{space 2} .0693803{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4} -.068294{col 67}{space 3}  .207299
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-.0328884{col 26}{space 2} .0429195{col 37}{space 1}   -0.77{col 46}{space 3}0.446{col 54}{space 4}-.1181776{col 67}{space 3} .0524009
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 3.005376{col 26}{space 2} 1.766374{col 37}{space 1}    1.70{col 46}{space 3}0.092{col 54}{space 4}-.5028995{col 67}{space 3} 6.513652
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} .1177193{col 26}{space 2} .2003027{col 37}{space 1}    0.59{col 46}{space 3}0.558{col 54}{space 4}-.2800979{col 67}{space 3} .5155364
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.94e-06{col 26}{space 2} 4.01e-06{col 37}{space 1}    0.48{col 46}{space 3}0.630{col 54}{space 4}-6.03e-06{col 67}{space 3} 9.90e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-18.48264{col 26}{space 2} 10.75687{col 37}{space 1}   -1.72{col 46}{space 3}0.089{col 54}{space 4}-39.84693{col 67}{space 3} 2.881645
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. **********INTERACTION by Race***************
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0232
{txt}{col 49}Largest FMI{col 67}= {res}    0.2160
{txt}{col 49}Complete DF{col 67}= {res}       166
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     57.22
{txt}{col 49}        avg{col 67}= {res}    154.75
{txt}{col 49}        max{col 67}= {res}    163.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  163.6{txt}){col 67}= {res}     11.67
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-63.94436{col 28}{space 2} 67.86558{col 39}{space 1}   -0.94{col 48}{space 3}0.347{col 56}{space 4}-197.9568{col 69}{space 3} 70.06811
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-240.0652{col 28}{space 2} 180.7916{col 39}{space 1}   -1.33{col 48}{space 3}0.186{col 56}{space 4}-597.0561{col 69}{space 3} 116.9258
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 78.95038{col 28}{space 2} 88.77252{col 39}{space 1}    0.89{col 48}{space 3}0.375{col 56}{space 4}-96.33412{col 69}{space 3} 254.2349
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-44.78008{col 28}{space 2} 62.09262{col 39}{space 1}   -0.72{col 48}{space 3}0.472{col 56}{space 4}-167.3843{col 69}{space 3} 77.82417
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-5.794361{col 28}{space 2} 3.077511{col 39}{space 1}   -1.88{col 48}{space 3}0.061{col 56}{space 4}-11.87102{col 69}{space 3} .2822948
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-138.8538{col 28}{space 2} 52.69842{col 39}{space 1}   -2.63{col 48}{space 3}0.009{col 56}{space 4}-242.9109{col 69}{space 3}-34.79674
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0301085{col 28}{space 2} .0389269{col 39}{space 1}    0.77{col 48}{space 3}0.440{col 56}{space 4}-.0467583{col 69}{space 3} .1069752
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 4.152213{col 28}{space 2} 3.802676{col 39}{space 1}    1.09{col 48}{space 3}0.276{col 56}{space 4}-3.356361{col 69}{space 3} 11.66079
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2}-.0014127{col 28}{space 2} 2.840772{col 39}{space 1}   -0.00{col 48}{space 3}1.000{col 56}{space 4}-5.689487{col 69}{space 3} 5.686662
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 138.8731{col 28}{space 2} 90.22485{col 39}{space 1}    1.54{col 48}{space 3}0.126{col 56}{space 4} -39.2808{col 69}{space 3}  317.027
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-1.009412{col 28}{space 2} 11.64545{col 39}{space 1}   -0.09{col 48}{space 3}0.931{col 56}{space 4}-24.01342{col 69}{space 3}  21.9946
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0016951{col 28}{space 2}  .000226{col 39}{space 1}    7.50{col 48}{space 3}0.000{col 56}{space 4} .0012489{col 69}{space 3} .0021414
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1176.235{col 28}{space 2} 561.9715{col 39}{space 1}    2.09{col 48}{space 3}0.038{col 56}{space 4} 66.59724{col 69}{space 3} 2285.873
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0105
{txt}{col 49}Largest FMI{col 67}= {res}    0.0768
{txt}{col 49}Complete DF{col 67}= {res}       166
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    126.19
{txt}{col 49}        avg{col 67}= {res}    159.94
{txt}{col 49}        max{col 67}= {res}    164.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  163.9{txt}){col 67}= {res}     13.61
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-42.83516{col 28}{space 2} 70.10333{col 39}{space 1}   -0.61{col 48}{space 3}0.542{col 56}{space 4}-181.2588{col 69}{space 3} 95.58851
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-255.1394{col 28}{space 2} 187.2625{col 39}{space 1}   -1.36{col 48}{space 3}0.175{col 56}{space 4}-624.9083{col 69}{space 3} 114.6295
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 77.84163{col 28}{space 2} 92.01202{col 39}{space 1}    0.85{col 48}{space 3}0.399{col 56}{space 4}-103.8416{col 69}{space 3} 259.5249
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-119.6609{col 28}{space 2} 64.31368{col 39}{space 1}   -1.86{col 48}{space 3}0.065{col 56}{space 4}-246.6508{col 69}{space 3}  7.32906
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-4.283771{col 28}{space 2}  3.18874{col 39}{space 1}   -1.34{col 48}{space 3}0.181{col 56}{space 4}-10.58009{col 69}{space 3}  2.01255
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-115.7683{col 28}{space 2} 54.55185{col 39}{space 1}   -2.12{col 48}{space 3}0.035{col 56}{space 4}-223.4842{col 69}{space 3} -8.05249
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0546878{col 28}{space 2} .0402488{col 39}{space 1}    1.36{col 48}{space 3}0.176{col 56}{space 4}-.0247865{col 69}{space 3} .1341622
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 3.817789{col 28}{space 2} 3.936946{col 39}{space 1}    0.97{col 48}{space 3}0.334{col 56}{space 4}-3.955861{col 69}{space 3} 11.59144
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2}-2.362422{col 28}{space 2} 2.735952{col 39}{space 1}   -0.86{col 48}{space 3}0.390{col 56}{space 4}-7.776713{col 69}{space 3} 3.051869
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 91.23837{col 28}{space 2} 93.37984{col 39}{space 1}    0.98{col 48}{space 3}0.330{col 56}{space 4}-93.14314{col 69}{space 3} 275.6199
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} 4.152563{col 28}{space 2} 12.10541{col 39}{space 1}    0.34{col 48}{space 3}0.732{col 56}{space 4}-19.76448{col 69}{space 3}  28.0696
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021363{col 28}{space 2} .0002341{col 39}{space 1}    9.13{col 48}{space 3}0.000{col 56}{space 4} .0016741{col 69}{space 3} .0025985
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1053.314{col 28}{space 2} 581.8594{col 39}{space 1}    1.81{col 48}{space 3}0.072{col 56}{space 4}-95.58785{col 69}{space 3} 2202.216
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0086
{txt}{col 49}Largest FMI{col 67}= {res}    0.0961
{txt}{col 49}Complete DF{col 67}= {res}       166
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    113.75
{txt}{col 49}        avg{col 67}= {res}    159.97
{txt}{col 49}        max{col 67}= {res}    164.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  164.0{txt}){col 67}= {res}      2.03
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0244

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 2.707045{col 28}{space 2} .8604773{col 39}{space 1}    3.15{col 48}{space 3}0.002{col 56}{space 4} 1.007904{col 69}{space 3} 4.406186
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 2.147077{col 28}{space 2}  2.28957{col 39}{space 1}    0.94{col 48}{space 3}0.350{col 56}{space 4}-2.373764{col 69}{space 3} 6.667919
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.3454254{col 28}{space 2} 1.126332{col 39}{space 1}   -0.31{col 48}{space 3}0.759{col 56}{space 4}-2.569412{col 69}{space 3} 1.878561
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .1265717{col 28}{space 2}  .787667{col 39}{space 1}    0.16{col 48}{space 3}0.873{col 56}{space 4}-1.428705{col 69}{space 3} 1.681848
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0015522{col 28}{space 2} .0390445{col 39}{space 1}    0.04{col 48}{space 3}0.968{col 56}{space 4}-.0755426{col 69}{space 3}  .078647
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .7657716{col 28}{space 2} .6677929{col 39}{space 1}    1.15{col 48}{space 3}0.253{col 56}{space 4}-.5528115{col 69}{space 3} 2.084355
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0005875{col 28}{space 2}  .000493{col 39}{space 1}   -1.19{col 48}{space 3}0.235{col 56}{space 4} -.001561{col 69}{space 3} .0003861
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0758676{col 28}{space 2}  .048227{col 39}{space 1}    1.57{col 48}{space 3}0.118{col 56}{space 4}-.0193586{col 69}{space 3} .1710938
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2}-.0093309{col 28}{space 2} .0338431{col 39}{space 1}   -0.28{col 48}{space 3}0.783{col 56}{space 4}-.0763755{col 69}{space 3} .0577136
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 1.109665{col 28}{space 2} 1.144352{col 39}{space 1}    0.97{col 48}{space 3}0.334{col 56}{space 4}-1.149911{col 69}{space 3} 3.369241
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} .1576671{col 28}{space 2} .1457878{col 39}{space 1}    1.08{col 48}{space 3}0.281{col 56}{space 4}-.1301965{col 69}{space 3} .4455307
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.26e-06{col 28}{space 2} 2.87e-06{col 39}{space 1}    0.79{col 48}{space 3}0.432{col 56}{space 4}-3.40e-06{col 69}{space 3} 7.91e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-10.81038{col 28}{space 2} 7.127169{col 39}{space 1}   -1.52{col 48}{space 3}0.131{col 56}{space 4}-24.88322{col 69}{space 3} 3.262464
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***********MODEL 6: MODEL 2+lifestyle/health-related factors*******  
. 
. 
. 
. //AFRICAN-AMERICAN//
. 
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0100
{txt}{col 49}Largest FMI{col 67}= {res}    0.0345
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     59.17
{txt}{col 49}        avg{col 67}= {res}     61.50
{txt}{col 49}        max{col 67}= {res}     62.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   62.0{txt}){col 67}= {res}      5.79
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-15.31509{col 26}{space 2} 87.36124{col 37}{space 1}   -0.18{col 46}{space 3}0.861{col 54}{space 4}-189.9636{col 67}{space 3} 159.3334
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 39.19211{col 26}{space 2}  82.9113{col 37}{space 1}    0.47{col 46}{space 3}0.638{col 54}{space 4}-126.5429{col 67}{space 3} 204.9271
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-7.789998{col 26}{space 2} 4.798895{col 37}{space 1}   -1.62{col 46}{space 3}0.110{col 54}{space 4}-17.38401{col 67}{space 3} 1.804011
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-237.6955{col 26}{space 2} 74.86483{col 37}{space 1}   -3.17{col 46}{space 3}0.002{col 54}{space 4}-387.3592{col 67}{space 3}-88.03172
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0297641{col 26}{space 2} .0602608{col 37}{space 1}    0.49{col 46}{space 3}0.623{col 54}{space 4}-.0907194{col 67}{space 3} .1502476
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-4.497188{col 26}{space 2}  5.76386{col 37}{space 1}   -0.78{col 46}{space 3}0.438{col 54}{space 4}-16.01982{col 67}{space 3} 7.025442
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-141.7197{col 26}{space 2}  72.0921{col 37}{space 1}   -1.97{col 46}{space 3}0.054{col 54}{space 4} -285.967{col 67}{space 3} 2.527545
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-37.48104{col 26}{space 2} 40.82628{col 37}{space 1}   -0.92{col 46}{space 3}0.362{col 54}{space 4}-119.1024{col 67}{space 3}  44.1403
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0014031{col 26}{space 2} .0003453{col 37}{space 1}    4.06{col 46}{space 3}0.000{col 54}{space 4} .0007129{col 67}{space 3} .0020934
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2447.419{col 26}{space 2} 468.6346{col 37}{space 1}    5.22{col 46}{space 3}0.000{col 54}{space 4} 1510.643{col 67}{space 3} 3384.195
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0091
{txt}{col 49}Largest FMI{col 67}= {res}    0.0258
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     60.09
{txt}{col 49}        avg{col 67}= {res}     61.60
{txt}{col 49}        max{col 67}= {res}     62.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   62.0{txt}){col 67}= {res}      6.19
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-13.24875{col 26}{space 2} 85.47654{col 37}{space 1}   -0.15{col 46}{space 3}0.877{col 54}{space 4}-184.1261{col 67}{space 3} 157.6286
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 16.66617{col 26}{space 2} 81.15826{col 37}{space 1}    0.21{col 46}{space 3}0.838{col 54}{space 4}-145.5646{col 67}{space 3}  178.897
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}  -7.2385{col 26}{space 2} 4.694677{col 37}{space 1}   -1.54{col 46}{space 3}0.128{col 54}{space 4}-16.62389{col 67}{space 3} 2.146892
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-209.7918{col 26}{space 2} 73.24659{col 37}{space 1}   -2.86{col 46}{space 3}0.006{col 54}{space 4}-356.2173{col 67}{space 3}-63.36625
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0509192{col 26}{space 2} .0590211{col 37}{space 1}    0.86{col 46}{space 3}0.392{col 54}{space 4}-.0670895{col 67}{space 3} .1689278
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-6.767531{col 26}{space 2} 5.640195{col 37}{space 1}   -1.20{col 46}{space 3}0.235{col 54}{space 4}-18.04278{col 67}{space 3} 4.507718
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-135.5759{col 26}{space 2} 70.26884{col 37}{space 1}   -1.93{col 46}{space 3}0.058{col 54}{space 4}-276.1304{col 67}{space 3} 4.978615
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-19.26605{col 26}{space 2} 39.96927{col 37}{space 1}   -0.48{col 46}{space 3}0.631{col 54}{space 4}-99.17468{col 67}{space 3} 60.64258
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0015407{col 26}{space 2} .0003379{col 37}{space 1}    4.56{col 46}{space 3}0.000{col 54}{space 4} .0008653{col 67}{space 3} .0022162
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  2485.84{col 26}{space 2} 458.7059{col 37}{space 1}    5.42{col 46}{space 3}0.000{col 54}{space 4} 1568.912{col 67}{space 3} 3402.768
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0025
{txt}{col 49}Largest FMI{col 67}= {res}    0.0153
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     61.05
{txt}{col 49}        avg{col 67}= {res}     61.95
{txt}{col 49}        max{col 67}= {res}     62.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   62.1{txt}){col 67}= {res}      2.27
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0290

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 1.981343{col 26}{space 2} .9996958{col 37}{space 1}    1.98{col 46}{space 3}0.052{col 54}{space 4}-.0169997{col 67}{space 3} 3.979685
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .6243057{col 26}{space 2} .9507441{col 37}{space 1}    0.66{col 46}{space 3}0.514{col 54}{space 4}-1.276155{col 67}{space 3} 2.524767
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0027419{col 26}{space 2} .0548717{col 37}{space 1}    0.05{col 46}{space 3}0.960{col 54}{space 4} -.106943{col 67}{space 3} .1124269
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.2295722{col 26}{space 2} .8567047{col 37}{space 1}   -0.27{col 46}{space 3}0.790{col 54}{space 4}-1.942054{col 67}{space 3} 1.482909
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0008693{col 26}{space 2} .0006887{col 37}{space 1}   -1.26{col 46}{space 3}0.212{col 54}{space 4} -.002246{col 67}{space 3} .0005073
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .1090704{col 26}{space 2} .0659671{col 37}{space 1}    1.65{col 46}{space 3}0.103{col 54}{space 4} -.022793{col 67}{space 3} .2409338
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} .5528994{col 26}{space 2} .8192201{col 37}{space 1}    0.67{col 46}{space 3}0.502{col 54}{space 4}-1.085206{col 67}{space 3} 2.191004
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-.6780199{col 26}{space 2} .4669501{col 37}{space 1}   -1.45{col 46}{space 3}0.152{col 54}{space 4}-1.611442{col 67}{space 3} .2554017
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 4.93e-06{col 26}{space 2} 3.95e-06{col 37}{space 1}    1.25{col 46}{space 3}0.217{col 54}{space 4}-2.97e-06{col 67}{space 3} .0000128
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.827109{col 26}{space 2} 5.373347{col 37}{space 1}   -0.90{col 46}{space 3}0.372{col 54}{space 4}-15.56799{col 67}{space 3} 5.913768
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0097
{txt}{col 49}Largest FMI{col 67}= {res}    0.0620
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     81.41
{txt}{col 49}        avg{col 67}= {res}     91.46
{txt}{col 49}        max{col 67}= {res}     92.91
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.0{txt}){col 67}= {res}      8.36
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-106.9989{col 26}{space 2} 78.23763{col 37}{space 1}   -1.37{col 46}{space 3}0.175{col 54}{space 4}-262.3876{col 67}{space 3} 48.38991
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} -70.1245{col 26}{space 2} 86.69938{col 37}{space 1}   -0.81{col 46}{space 3}0.421{col 54}{space 4}-242.2963{col 67}{space 3} 102.0472
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.953686{col 26}{space 2} 4.504681{col 37}{space 1}   -0.43{col 46}{space 3}0.666{col 54}{space 4}-10.89996{col 67}{space 3} 6.992585
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-58.47529{col 26}{space 2} 76.64378{col 37}{space 1}   -0.76{col 46}{space 3}0.447{col 54}{space 4}-210.6824{col 67}{space 3}  93.7318
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0349178{col 26}{space 2}  .051812{col 37}{space 1}    0.67{col 46}{space 3}0.502{col 54}{space 4}-.0679879{col 67}{space 3} .1378234
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 8.478271{col 26}{space 2} 4.972724{col 37}{space 1}    1.70{col 46}{space 3}0.092{col 54}{space 4}-1.396738{col 67}{space 3} 18.35328
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}  89.2939{col 26}{space 2} 95.19371{col 37}{space 1}    0.94{col 46}{space 3}0.351{col 54}{space 4}-100.0972{col 67}{space 3}  278.685
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-12.19537{col 26}{space 2} 43.84029{col 37}{space 1}   -0.28{col 46}{space 3}0.781{col 54}{space 4}-99.25454{col 67}{space 3}  74.8638
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0020004{col 26}{space 2} .0003011{col 37}{space 1}    6.64{col 46}{space 3}0.000{col 54}{space 4} .0014024{col 67}{space 3} .0025983
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1074.381{col 26}{space 2} 481.7663{col 37}{space 1}    2.23{col 46}{space 3}0.028{col 54}{space 4} 117.6734{col 67}{space 3} 2031.088
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0124
{txt}{col 49}Largest FMI{col 67}= {res}    0.0977
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     71.75
{txt}{col 49}        avg{col 67}= {res}     90.59
{txt}{col 49}        max{col 67}= {res}     92.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.0{txt}){col 67}= {res}     11.02
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-124.3378{col 26}{space 2} 80.01712{col 37}{space 1}   -1.55{col 46}{space 3}0.124{col 54}{space 4}-283.2509{col 67}{space 3} 34.57519
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-202.5507{col 26}{space 2} 88.80883{col 37}{space 1}   -2.28{col 46}{space 3}0.025{col 54}{space 4}-378.9106{col 67}{space 3}-26.19076
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 2.205487{col 26}{space 2} 4.614349{col 37}{space 1}    0.48{col 46}{space 3}0.634{col 54}{space 4}-6.958538{col 67}{space 3} 11.36951
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-40.05518{col 26}{space 2} 78.49532{col 37}{space 1}   -0.51{col 46}{space 3}0.611{col 54}{space 4}-195.9376{col 67}{space 3} 115.8273
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0923899{col 26}{space 2} .0529605{col 37}{space 1}    1.74{col 46}{space 3}0.084{col 54}{space 4} -.012788{col 67}{space 3} .1975678
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 10.75805{col 26}{space 2}  5.09725{col 37}{space 1}    2.11{col 46}{space 3}0.038{col 54}{space 4} .6355997{col 67}{space 3} 20.88051
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 53.19163{col 26}{space 2} 99.27556{col 37}{space 1}    0.54{col 46}{space 3}0.594{col 54}{space 4}-144.7222{col 67}{space 3} 251.1055
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-37.37031{col 26}{space 2} 44.90583{col 37}{space 1}   -0.83{col 46}{space 3}0.407{col 54}{space 4} -126.545{col 67}{space 3} 51.80438
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0026317{col 26}{space 2} .0003084{col 37}{space 1}    8.53{col 46}{space 3}0.000{col 54}{space 4} .0020194{col 67}{space 3} .0032441
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 396.6329{col 26}{space 2} 493.9664{col 37}{space 1}    0.80{col 46}{space 3}0.424{col 54}{space 4}-584.3255{col 67}{space 3} 1377.591
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0043
{txt}{col 49}Largest FMI{col 67}= {res}    0.0117
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     91.78
{txt}{col 49}        avg{col 67}= {res}     92.72
{txt}{col 49}        max{col 67}= {res}     93.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.0{txt}){col 67}= {res}      1.44
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1807

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.852127{col 26}{space 2} 1.050486{col 37}{space 1}    2.72{col 46}{space 3}0.008{col 54}{space 4} .7659285{col 67}{space 3} 4.938326
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.1239777{col 26}{space 2} 1.167011{col 37}{space 1}   -0.11{col 46}{space 3}0.916{col 54}{space 4}-2.441487{col 67}{space 3} 2.193532
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0222866{col 26}{space 2} .0604609{col 37}{space 1}   -0.37{col 46}{space 3}0.713{col 54}{space 4} -.142351{col 67}{space 3} .0977778
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.584345{col 26}{space 2} 1.030042{col 37}{space 1}    1.54{col 46}{space 3}0.127{col 54}{space 4}-.4611244{col 67}{space 3} 3.629815
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0005462{col 26}{space 2} .0006964{col 37}{space 1}   -0.78{col 46}{space 3}0.435{col 54}{space 4}-.0019293{col 67}{space 3} .0008368
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0238439{col 26}{space 2} .0668757{col 37}{space 1}    0.36{col 46}{space 3}0.722{col 54}{space 4}-.1089571{col 67}{space 3} .1566448
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-1.380175{col 26}{space 2} 1.249801{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-3.862468{col 67}{space 3} 1.102117
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} .0958102{col 26}{space 2} .5899314{col 37}{space 1}    0.16{col 46}{space 3}0.871{col 54}{space 4}-1.075683{col 67}{space 3} 1.267303
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.34e-06{col 26}{space 2} 4.05e-06{col 37}{space 1}    0.33{col 46}{space 3}0.742{col 54}{space 4}-6.71e-06{col 67}{space 3} 9.39e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -2.85864{col 26}{space 2} 6.481316{col 37}{space 1}   -0.44{col 46}{space 3}0.660{col 54}{space 4}-15.72928{col 67}{space 3}   10.012
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. ******************INTERACTION by Race***********************
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0045
{txt}{col 49}Largest FMI{col 67}= {res}    0.0450
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    146.93
{txt}{col 49}        avg{col 67}= {res}    163.43
{txt}{col 49}        max{col 67}= {res}    165.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  165.0{txt}){col 67}= {res}     12.78
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-83.03118{col 28}{space 2} 66.96676{col 39}{space 1}   -1.24{col 48}{space 3}0.217{col 56}{space 4}-215.2535{col 69}{space 3} 49.19116
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-261.5352{col 28}{space 2} 179.3482{col 39}{space 1}   -1.46{col 48}{space 3}0.147{col 56}{space 4}-615.6493{col 69}{space 3} 92.57902
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 88.81644{col 28}{space 2} 89.10396{col 39}{space 1}    1.00{col 48}{space 3}0.320{col 56}{space 4}-87.11592{col 69}{space 3} 264.7488
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-30.65727{col 28}{space 2} 60.84957{col 39}{space 1}   -0.50{col 48}{space 3}0.615{col 56}{space 4}-150.8016{col 69}{space 3} 89.48707
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-5.796823{col 28}{space 2} 3.147892{col 39}{space 1}   -1.84{col 48}{space 3}0.067{col 56}{space 4}-12.01218{col 69}{space 3} .4185357
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-146.5396{col 28}{space 2} 53.41842{col 39}{space 1}   -2.74{col 48}{space 3}0.007{col 56}{space 4}-252.0113{col 69}{space 3}-41.06794
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0257932{col 28}{space 2} .0383648{col 39}{space 1}    0.67{col 48}{space 3}0.502{col 56}{space 4}-.0499563{col 69}{space 3} .1015427
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2.143864{col 28}{space 2} 3.653787{col 39}{space 1}    0.59{col 48}{space 3}0.558{col 56}{space 4}-5.070395{col 69}{space 3} 9.358124
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-34.36175{col 28}{space 2} 59.21689{col 39}{space 1}   -0.58{col 48}{space 3}0.563{col 56}{space 4}-151.3886{col 69}{space 3}  82.6651
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-25.11726{col 28}{space 2} 30.02815{col 39}{space 1}   -0.84{col 48}{space 3}0.404{col 56}{space 4}-84.40636{col 69}{space 3} 34.17184
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0017059{col 28}{space 2} .0002269{col 39}{space 1}    7.52{col 48}{space 3}0.000{col 56}{space 4} .0012579{col 69}{space 3}  .002154
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1920.897{col 28}{space 2} 340.3473{col 39}{space 1}    5.64{col 48}{space 3}0.000{col 56}{space 4} 1248.893{col 69}{space 3} 2592.901
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0066
{txt}{col 49}Largest FMI{col 67}= {res}    0.0627
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    135.98
{txt}{col 49}        avg{col 67}= {res}    162.46
{txt}{col 49}        max{col 67}= {res}    165.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  165.0{txt}){col 67}= {res}     15.00
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-72.40033{col 28}{space 2} 69.06164{col 39}{space 1}   -1.05{col 48}{space 3}0.296{col 56}{space 4}-208.7593{col 69}{space 3} 63.95867
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-257.7413{col 28}{space 2} 184.9505{col 39}{space 1}   -1.39{col 48}{space 3}0.165{col 56}{space 4}-622.9179{col 69}{space 3} 107.4352
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 88.88633{col 28}{space 2} 91.90159{col 39}{space 1}    0.97{col 48}{space 3}0.335{col 56}{space 4}-92.57081{col 69}{space 3} 270.3435
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-107.9627{col 28}{space 2}  62.7557{col 39}{space 1}   -1.72{col 48}{space 3}0.087{col 56}{space 4} -231.871{col 69}{space 3}  15.9457
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-4.198031{col 28}{space 2} 3.245489{col 39}{space 1}   -1.29{col 48}{space 3}0.198{col 56}{space 4}-10.60608{col 69}{space 3}  2.21002
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-122.7337{col 28}{space 2} 55.07723{col 39}{space 1}   -2.23{col 48}{space 3}0.027{col 56}{space 4}-231.4806{col 69}{space 3}-13.98677
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0612293{col 28}{space 2} .0395755{col 39}{space 1}    1.55{col 48}{space 3}0.124{col 56}{space 4}-.0169112{col 69}{space 3} .1393699
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2.369787{col 28}{space 2} 3.767655{col 39}{space 1}    0.63{col 48}{space 3}0.530{col 56}{space 4}-5.069313{col 69}{space 3} 9.808886
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-49.58124{col 28}{space 2} 61.59922{col 39}{space 1}   -0.80{col 48}{space 3}0.422{col 56}{space 4}-171.3976{col 69}{space 3} 72.23509
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-31.82383{col 28}{space 2} 30.97216{col 39}{space 1}   -1.03{col 48}{space 3}0.306{col 56}{space 4}-92.97718{col 69}{space 3} 29.32951
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021415{col 28}{space 2}  .000234{col 39}{space 1}    9.15{col 48}{space 3}0.000{col 56}{space 4} .0016795{col 69}{space 3} .0026035
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1550.74{col 28}{space 2} 350.9739{col 39}{space 1}    4.42{col 48}{space 3}0.000{col 56}{space 4}  857.752{col 69}{space 3} 2243.727
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0005
{txt}{col 49}Largest FMI{col 67}= {res}    0.0058
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    163.92
{txt}{col 49}        avg{col 67}= {res}    164.93
{txt}{col 49}        max{col 67}= {res}    165.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  165.0{txt}){col 67}= {res}      2.07
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0254

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 2.419459{col 28}{space 2} .8500167{col 39}{space 1}    2.85{col 48}{space 3}0.005{col 56}{space 4} .7411497{col 69}{space 3} 4.097769
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.951141{col 28}{space 2} 2.276281{col 39}{space 1}    0.86{col 48}{space 3}0.393{col 56}{space 4}-2.543246{col 69}{space 3} 6.445528
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.2948566{col 28}{space 2} 1.130543{col 39}{space 1}   -0.26{col 48}{space 3}0.795{col 56}{space 4}-2.527051{col 69}{space 3} 1.937338
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .3540274{col 28}{space 2} .7723401{col 39}{space 1}    0.46{col 48}{space 3}0.647{col 56}{space 4}-1.170914{col 69}{space 3} 1.878969
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0045053{col 28}{space 2}  .039953{col 39}{space 1}    0.11{col 48}{space 3}0.910{col 56}{space 4}-.0743797{col 69}{space 3} .0833904
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .7452925{col 28}{space 2} .6781116{col 39}{space 1}    1.10{col 48}{space 3}0.273{col 56}{space 4}-.5936002{col 69}{space 3} 2.084185
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0006145{col 28}{space 2} .0004869{col 39}{space 1}   -1.26{col 48}{space 3}0.209{col 56}{space 4}-.0015759{col 69}{space 3} .0003468
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0563146{col 28}{space 2} .0463596{col 39}{space 1}    1.21{col 48}{space 3}0.226{col 56}{space 4}-.0352199{col 69}{space 3} .1478492
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2} -.121404{col 28}{space 2} .7372964{col 39}{space 1}   -0.16{col 48}{space 3}0.869{col 56}{space 4}-1.577227{col 69}{space 3} 1.334419
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-.2300037{col 28}{space 2} .3811103{col 39}{space 1}   -0.60{col 48}{space 3}0.547{col 56}{space 4}-.9824843{col 69}{space 3} .5224769
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.24e-06{col 28}{space 2} 2.88e-06{col 39}{space 1}    0.78{col 48}{space 3}0.438{col 56}{space 4}-3.45e-06{col 69}{space 3} 7.93e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} -4.41411{col 28}{space 2} 4.317815{col 39}{space 1}   -1.02{col 48}{space 3}0.308{col 56}{space 4} -12.9394{col 69}{space 3} 4.111178
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ////////////////////////////////////////TABLE S5. LnNFLw3 exposure/////////////////////////////////////////////
> 
. 
. 
. 
. ***********************LnNFLw3, MODELS 1 AND 2*********************
. 
. 
. *********************AFRICAN-AMERICAN*******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. //ANALYSIS B//
. reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(6, 67)        = {res}     8.62
{txt}       Model {c |} {res} 3370999.52         6  561833.254   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 4368517.34        67  65201.7514   {txt}R-squared       ={res}    0.4356
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3850
{txt}       Total {c |} {res} 7739516.87        73  106020.779   {txt}Root MSE        =   {res} 255.35

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-95.04325{col 26}{space 2} 53.00145{col 37}{space 1}   -1.79{col 46}{space 3}0.077{col 67}{space 3}-.1888127
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 64.41694{col 26}{space 2} 80.73391{col 37}{space 1}    0.80{col 46}{space 3}0.428{col 67}{space 3} .0992651
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-5.588908{col 26}{space 2} 3.746774{col 37}{space 1}   -1.49{col 46}{space 3}0.140{col 67}{space 3}-.1676833
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-203.3794{col 26}{space 2} 74.02801{col 37}{space 1}   -2.75{col 46}{space 3}0.008{col 67}{space 3}-.3070007
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0193721{col 26}{space 2} .0586691{col 37}{space 1}    0.33{col 46}{space 3}0.742{col 67}{space 3}  .034229
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0012446{col 26}{space 2} .0003284{col 37}{space 1}    3.79{col 46}{space 3}0.000{col 67}{space 3} .4656064
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2404.049{col 26}{space 2} 431.9859{col 37}{space 1}    5.57{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(6, 67)        = {res}     8.74
{txt}       Model {c |} {res} 3357210.42         6  559535.071   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 4287978.56        67    63999.68   {txt}R-squared       ={res}    0.4391
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3889
{txt}       Total {c |} {res} 7645188.98        73  104728.616   {txt}Root MSE        =   {res} 252.98

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-67.49723{col 26}{space 2}  52.5106{col 37}{space 1}   -1.29{col 46}{space 3}0.203{col 67}{space 3}-.1349145
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 44.07066{col 26}{space 2} 79.98624{col 37}{space 1}    0.55{col 46}{space 3}0.583{col 67}{space 3} .0683296
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.181877{col 26}{space 2} 3.712075{col 37}{space 1}   -1.67{col 46}{space 3}0.101{col 67}{space 3}-.1866148
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-186.0157{col 26}{space 2} 73.34244{col 37}{space 1}   -2.54{col 46}{space 3}0.014{col 67}{space 3}-.2825172
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0403946{col 26}{space 2} .0581258{col 37}{space 1}    0.69{col 46}{space 3}0.489{col 67}{space 3} .0718131
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0014009{col 26}{space 2} .0003253{col 37}{space 1}    4.31{col 46}{space 3}0.000{col 67}{space 3} .5273009
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2404.047{col 26}{space 2} 427.9853{col 37}{space 1}    5.62{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final==1 & Race==2,beta 
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(6, 67)        = {res}     1.79
{txt}       Model {c |} {res} 101.670577         6  16.9450962   {txt}Prob > F        ={res}    0.1146
{txt}    Residual {c |} {res} 634.469831        67  9.46969898   {txt}R-squared       ={res}    0.1381
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0609
{txt}       Total {c |} {res} 736.140409        73  10.0841152   {txt}Root MSE        =   {res} 3.0773

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .2014758{col 26}{space 2} .6387431{col 37}{space 1}    0.32{col 46}{space 3}0.753{col 67}{space 3} .0410402
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .6784156{col 26}{space 2} .9729588{col 37}{space 1}    0.70{col 46}{space 3}0.488{col 67}{space 3} .1071937
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0734892{col 26}{space 2}  .045154{col 37}{space 1}    1.63{col 46}{space 3}0.108{col 67}{space 3} .2260805
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.0399791{col 26}{space 2} .8921431{col 37}{space 1}   -0.04{col 46}{space 3}0.964{col 67}{space 3}-.0061879
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0009704{col 26}{space 2}  .000707{col 37}{space 1}   -1.37{col 46}{space 3}0.175{col 67}{space 3}-.1758035
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.89e-06{col 26}{space 2} 3.96e-06{col 37}{space 1}    0.73{col 46}{space 3}0.468{col 67}{space 3} .1108274
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.4563551{col 26}{space 2} 5.206047{col 37}{space 1}   -0.09{col 46}{space 3}0.930{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        66
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     64.09
{txt}{col 49}        avg{col 67}= {res}     64.09
{txt}{col 49}        max{col 67}= {res}     64.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   64.1{txt}){col 67}= {res}      7.48
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-103.2193{col 26}{space 2} 53.83238{col 37}{space 1}   -1.92{col 46}{space 3}0.060{col 54}{space 4} -210.759{col 67}{space 3} 4.320459
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  49.6563{col 26}{space 2} 82.46382{col 37}{space 1}    0.60{col 46}{space 3}0.549{col 54}{space 4}-115.0798{col 67}{space 3} 214.3924
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-4.609311{col 26}{space 2} 3.904193{col 37}{space 1}   -1.18{col 46}{space 3}0.242{col 54}{space 4}-12.40863{col 67}{space 3} 3.190006
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-197.0987{col 26}{space 2}  74.4493{col 37}{space 1}   -2.65{col 46}{space 3}0.010{col 54}{space 4}-345.8244{col 67}{space 3}-48.37304
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0203927{col 26}{space 2} .0587579{col 37}{space 1}    0.35{col 46}{space 3}0.730{col 54}{space 4}-.0969866{col 67}{space 3}  .137772
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-4.503239{col 26}{space 2} 4.966207{col 37}{space 1}   -0.91{col 46}{space 3}0.368{col 54}{space 4}-14.42412{col 67}{space 3}  5.41764
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0012933{col 26}{space 2} .0003332{col 37}{space 1}    3.88{col 46}{space 3}0.000{col 54}{space 4} .0006277{col 67}{space 3} .0019588
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2456.165{col 26}{space 2} 436.3617{col 37}{space 1}    5.63{col 46}{space 3}0.000{col 54}{space 4} 1584.455{col 67}{space 3} 3327.875
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        66
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     64.09
{txt}{col 49}        avg{col 67}= {res}     64.09
{txt}{col 49}        max{col 67}= {res}     64.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   64.1{txt}){col 67}= {res}      7.78
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-78.66373{col 26}{space 2} 53.03388{col 37}{space 1}   -1.48{col 46}{space 3}0.143{col 54}{space 4}-184.6083{col 67}{space 3} 27.28086
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 23.91114{col 26}{space 2} 81.24063{col 37}{space 1}    0.29{col 46}{space 3}0.769{col 54}{space 4}-138.3814{col 67}{space 3} 186.2037
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-4.843982{col 26}{space 2} 3.846282{col 37}{space 1}   -1.26{col 46}{space 3}0.212{col 54}{space 4}-12.52761{col 67}{space 3} 2.839648
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-177.4378{col 26}{space 2} 73.34499{col 37}{space 1}   -2.42{col 46}{space 3}0.018{col 54}{space 4}-323.9575{col 67}{space 3}-30.91817
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0417884{col 26}{space 2} .0578863{col 37}{space 1}    0.72{col 46}{space 3}0.473{col 54}{space 4}-.0738498{col 67}{space 3} .1574267
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} -6.15035{col 26}{space 2} 4.892543{col 37}{space 1}   -1.26{col 46}{space 3}0.213{col 54}{space 4}-15.92407{col 67}{space 3} 3.623373
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0014673{col 26}{space 2} .0003282{col 37}{space 1}    4.47{col 46}{space 3}0.000{col 54}{space 4} .0008117{col 67}{space 3}  .002123
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2475.225{col 26}{space 2} 429.8892{col 37}{space 1}    5.76{col 46}{space 3}0.000{col 54}{space 4} 1616.445{col 67}{space 3} 3334.005
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        66
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     64.09
{txt}{col 49}        avg{col 67}= {res}     64.09
{txt}{col 49}        max{col 67}= {res}     64.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   64.1{txt}){col 67}= {res}      1.53
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1723

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .2412234{col 26}{space 2} .6521318{col 37}{space 1}    0.37{col 46}{space 3}0.713{col 54}{space 4}-1.061526{col 67}{space 3} 1.543972
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  .750174{col 26}{space 2} .9989764{col 37}{space 1}    0.75{col 46}{space 3}0.455{col 54}{space 4}-1.245459{col 67}{space 3} 2.745807
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0687269{col 26}{space 2} .0472958{col 37}{space 1}    1.45{col 46}{space 3}0.151{col 54}{space 4}-.0257549{col 67}{space 3} .1632088
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.0705122{col 26}{space 2} .9018876{col 37}{space 1}   -0.08{col 46}{space 3}0.938{col 54}{space 4}-1.872193{col 67}{space 3} 1.731168
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0009753{col 26}{space 2} .0007118{col 37}{space 1}   -1.37{col 46}{space 3}0.175{col 54}{space 4}-.0023973{col 67}{space 3} .0004466
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0218924{col 26}{space 2} .0601612{col 37}{space 1}    0.36{col 46}{space 3}0.717{col 54}{space 4}-.0982903{col 67}{space 3} .1420751
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.65e-06{col 26}{space 2} 4.04e-06{col 37}{space 1}    0.66{col 46}{space 3}0.513{col 54}{space 4}-5.41e-06{col 67}{space 3} .0000107
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.709717{col 26}{space 2} 5.286137{col 37}{space 1}   -0.13{col 46}{space 3}0.894{col 54}{space 4}-11.26971{col 67}{space 3}  9.85028
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. *********************WHITE******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. //ANALYSIS B//
. reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       105
{txt}{hline 13}{c +}{hline 34}   F(6, 98)        = {res}    13.17
{txt}       Model {c |} {res} 7328943.16         6  1221490.53   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 9088523.76        98  92740.0384   {txt}R-squared       ={res}    0.4464
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4125
{txt}       Total {c |} {res} 16417466.9       104  157860.259   {txt}Root MSE        =   {res} 304.53

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-164.9185{col 26}{space 2} 66.96786{col 37}{space 1}   -2.46{col 46}{space 3}0.016{col 67}{space 3}-.2105624
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-90.09159{col 26}{space 2} 83.13769{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 67}{space 3}-.1130424
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2.150193{col 26}{space 2} 4.006875{col 37}{space 1}   -0.54{col 46}{space 3}0.593{col 67}{space 3}-.0455878
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-62.82257{col 26}{space 2} 72.22915{col 37}{space 1}   -0.87{col 46}{space 3}0.387{col 67}{space 3} -.069438
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0313661{col 26}{space 2} .0480798{col 37}{space 1}    0.65{col 46}{space 3}0.516{col 67}{space 3} .0515634
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019895{col 26}{space 2} .0002924{col 37}{space 1}    6.81{col 46}{space 3}0.000{col 67}{space 3} .7192659
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1528.69{col 26}{space 2} 415.8821{col 37}{space 1}    3.68{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       105
{txt}{hline 13}{c +}{hline 34}   F(6, 98)        = {res}    16.19
{txt}       Model {c |} {res} 9806726.29         6  1634454.38   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 9892901.06        98   100947.97   {txt}R-squared       ={res}    0.4978
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4671
{txt}       Total {c |} {res} 19699627.3       104  189419.494   {txt}Root MSE        =   {res} 317.72

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-153.0387{col 26}{space 2} 69.86852{col 37}{space 1}   -2.19{col 46}{space 3}0.031{col 67}{space 3}-.1783762
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-216.5521{col 26}{space 2} 86.73875{col 37}{space 1}   -2.50{col 46}{space 3}0.014{col 67}{space 3}-.2480525
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}  .987417{col 26}{space 2}  4.18043{col 37}{space 1}    0.24{col 46}{space 3}0.814{col 67}{space 3} .0191115
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-27.91078{col 26}{space 2}  75.3577{col 37}{space 1}   -0.37{col 46}{space 3}0.712{col 67}{space 3}-.0281629
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0728169{col 26}{space 2} .0501623{col 37}{space 1}    1.45{col 46}{space 3}0.150{col 67}{space 3} .1092793
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0025926{col 26}{space 2}  .000305{col 37}{space 1}    8.50{col 46}{space 3}0.000{col 67}{space 3} .8556562
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 882.5354{col 26}{space 2} 433.8957{col 37}{space 1}    2.03{col 46}{space 3}0.045{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final==1 & Race==1,beta 
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       105
{txt}{hline 13}{c +}{hline 34}   F(6, 98)        = {res}     0.85
{txt}       Model {c |} {res} 93.2021497         6  15.5336916   {txt}Prob > F        ={res}    0.5330
{txt}    Residual {c |} {res} 1786.38671        98  18.2284358   {txt}R-squared       ={res}    0.0496
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0086
{txt}       Total {c |} {res} 1879.58886       104  18.0729698   {txt}Root MSE        =   {res} 4.2695

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .8303881{col 26}{space 2} .9388743{col 37}{space 1}    0.88{col 46}{space 3}0.379{col 67}{space 3} .0990865
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.1243748{col 26}{space 2} 1.165572{col 37}{space 1}   -0.11{col 46}{space 3}0.915{col 67}{space 3}-.0145852
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0504122{col 26}{space 2} .0561755{col 37}{space 1}    0.90{col 46}{space 3}0.372{col 67}{space 3} .0998915
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 1.548068{col 26}{space 2} 1.012636{col 37}{space 1}    1.53{col 46}{space 3}0.130{col 67}{space 3} .1599165
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0004339{col 26}{space 2} .0006741{col 37}{space 1}   -0.64{col 46}{space 3}0.521{col 67}{space 3}-.0666691
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.69e-06{col 26}{space 2} 4.10e-06{col 37}{space 1}    0.66{col 46}{space 3}0.512{col 67}{space 3} .0910431
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.601003{col 26}{space 2} 5.830574{col 37}{space 1}   -0.62{col 46}{space 3}0.538{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        97
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     95.06
{txt}{col 49}        avg{col 67}= {res}     95.06
{txt}{col 49}        max{col 67}= {res}     95.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   95.1{txt}){col 67}= {res}     11.83
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-158.1779{col 26}{space 2}  66.5747{col 37}{space 1}   -2.38{col 46}{space 3}0.020{col 54}{space 4}-290.3443{col 67}{space 3} -26.0115
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-79.07338{col 26}{space 2} 82.77094{col 37}{space 1}   -0.96{col 46}{space 3}0.342{col 54}{space 4}-243.3931{col 67}{space 3} 85.24637
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.665112{col 26}{space 2} 3.986912{col 37}{space 1}   -0.42{col 46}{space 3}0.677{col 54}{space 4}-9.580068{col 67}{space 3} 6.249844
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-64.55286{col 26}{space 2} 71.66933{col 37}{space 1}   -0.90{col 46}{space 3}0.370{col 54}{space 4}-206.8333{col 67}{space 3} 77.72758
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0427804{col 26}{space 2} .0482323{col 37}{space 1}    0.89{col 46}{space 3}0.377{col 54}{space 4} -.052972{col 67}{space 3} .1385328
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}    7.586{col 26}{space 2} 4.741588{col 37}{space 1}    1.60{col 46}{space 3}0.113{col 54}{space 4}-1.827165{col 67}{space 3} 16.99916
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019965{col 26}{space 2} .0002901{col 37}{space 1}    6.88{col 46}{space 3}0.000{col 54}{space 4} .0014206{col 67}{space 3} .0025724
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1222.01{col 26}{space 2}  454.965{col 37}{space 1}    2.69{col 46}{space 3}0.009{col 54}{space 4} 318.7978{col 67}{space 3} 2125.222
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        97
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     95.06
{txt}{col 49}        avg{col 67}= {res}     95.06
{txt}{col 49}        max{col 67}= {res}     95.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   95.1{txt}){col 67}= {res}     15.08
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-143.5879{col 26}{space 2} 68.71574{col 37}{space 1}   -2.09{col 46}{space 3}0.039{col 54}{space 4}-280.0048{col 67}{space 3}-7.171013
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-201.1037{col 26}{space 2} 85.43285{col 37}{space 1}   -2.35{col 46}{space 3}0.021{col 54}{space 4} -370.708{col 67}{space 3}-31.49947
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.667537{col 26}{space 2} 4.115131{col 37}{space 1}    0.41{col 46}{space 3}0.686{col 54}{space 4}-6.501964{col 67}{space 3} 9.837038
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-30.33679{col 26}{space 2} 73.97421{col 37}{space 1}   -0.41{col 46}{space 3}0.683{col 54}{space 4} -177.193{col 67}{space 3} 116.5194
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0888207{col 26}{space 2} .0497834{col 37}{space 1}    1.78{col 46}{space 3}0.078{col 54}{space 4}-.0100111{col 67}{space 3} .1876525
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 10.63615{col 26}{space 2} 4.894077{col 37}{space 1}    2.17{col 46}{space 3}0.032{col 54}{space 4} .9202616{col 67}{space 3} 20.35205
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0026024{col 26}{space 2} .0002994{col 37}{space 1}    8.69{col 46}{space 3}0.000{col 54}{space 4}  .002008{col 67}{space 3} .0031968
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 452.5459{col 26}{space 2} 469.5966{col 37}{space 1}    0.96{col 46}{space 3}0.338{col 54}{space 4}-479.7136{col 67}{space 3} 1384.805
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        97
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     95.06
{txt}{col 49}        avg{col 67}= {res}     95.06
{txt}{col 49}        max{col 67}= {res}     95.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   95.1{txt}){col 67}= {res}      0.74
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.6354

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .8527135{col 26}{space 2} .9449183{col 37}{space 1}    0.90{col 46}{space 3}0.369{col 54}{space 4}-1.023171{col 67}{space 3} 2.728598
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.0878816{col 26}{space 2} 1.174797{col 37}{space 1}   -0.07{col 46}{space 3}0.941{col 54}{space 4} -2.42013{col 67}{space 3} 2.244367
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0520188{col 26}{space 2} .0565877{col 37}{space 1}    0.92{col 46}{space 3}0.360{col 54}{space 4} -.060321{col 67}{space 3} .1643586
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.542337{col 26}{space 2} 1.017228{col 37}{space 1}    1.52{col 46}{space 3}0.133{col 54}{space 4}-.4770993{col 67}{space 3} 3.561774
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0003961{col 26}{space 2} .0006846{col 37}{space 1}   -0.58{col 46}{space 3}0.564{col 54}{space 4}-.0017552{col 67}{space 3} .0009629
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0251254{col 26}{space 2}  .067299{col 37}{space 1}    0.37{col 46}{space 3}0.710{col 54}{space 4}-.1084789{col 67}{space 3} .1587298
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.72e-06{col 26}{space 2} 4.12e-06{col 37}{space 1}    0.66{col 46}{space 3}0.511{col 54}{space 4}-5.46e-06{col 67}{space 3} .0000109
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.616753{col 26}{space 2} 6.457479{col 37}{space 1}   -0.71{col 46}{space 3}0.476{col 54}{space 4}-17.43637{col 67}{space 3} 8.202859
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //INTERACTION by Race//
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       169
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    167.03
{txt}{col 49}        avg{col 67}= {res}    167.03
{txt}{col 49}        max{col 67}= {res}    167.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  167.0{txt}){col 67}= {res}     17.13
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-153.3897{col 28}{space 2} 59.75841{col 39}{space 1}   -2.57{col 48}{space 3}0.011{col 56}{space 4}-271.3688{col 69}{space 3}-35.41059
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-230.8496{col 28}{space 2} 173.7777{col 39}{space 1}   -1.33{col 48}{space 3}0.186{col 56}{space 4}-573.9334{col 69}{space 3} 112.2342
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 57.24367{col 28}{space 2} 76.59076{col 39}{space 1}    0.75{col 48}{space 3}0.456{col 56}{space 4}-93.96701{col 69}{space 3} 208.4543
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-14.13137{col 28}{space 2} 59.37244{col 39}{space 1}   -0.24{col 48}{space 3}0.812{col 56}{space 4}-131.3485{col 69}{space 3} 103.0857
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -3.51857{col 28}{space 2} 2.759392{col 39}{space 1}   -1.28{col 48}{space 3}0.204{col 56}{space 4}-8.966349{col 69}{space 3}  1.92921
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-131.1826{col 28}{space 2} 51.30034{col 39}{space 1}   -2.56{col 48}{space 3}0.011{col 56}{space 4}-232.4632{col 69}{space 3}-29.90202
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0248345{col 28}{space 2} .0369487{col 39}{space 1}    0.67{col 48}{space 3}0.502{col 56}{space 4}-.0481121{col 69}{space 3} .0977812
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1.782435{col 28}{space 2}  3.41784{col 39}{space 1}    0.52{col 48}{space 3}0.603{col 56}{space 4}-4.965296{col 69}{space 3} 8.530166
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0016731{col 28}{space 2} .0002182{col 39}{space 1}    7.67{col 48}{space 3}0.000{col 56}{space 4} .0012423{col 69}{space 3} .0021039
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1941.581{col 28}{space 2} 330.5868{col 39}{space 1}    5.87{col 48}{space 3}0.000{col 56}{space 4} 1288.914{col 69}{space 3} 2594.247
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       169
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    167.03
{txt}{col 49}        avg{col 67}= {res}    167.03
{txt}{col 49}        max{col 67}= {res}    167.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  167.0{txt}){col 67}= {res}     19.18
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-125.2927{col 28}{space 2} 62.30239{col 39}{space 1}   -2.01{col 48}{space 3}0.046{col 56}{space 4}-248.2943{col 69}{space 3}-2.291108
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-214.9737{col 28}{space 2} 181.1756{col 39}{space 1}   -1.19{col 48}{space 3}0.237{col 56}{space 4}-572.6629{col 69}{space 3} 142.7156
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 51.76928{col 28}{space 2} 79.85131{col 39}{space 1}    0.65{col 48}{space 3}0.518{col 56}{space 4}-105.8786{col 69}{space 3} 209.4172
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-92.49017{col 28}{space 2} 61.89999{col 39}{space 1}   -1.49{col 48}{space 3}0.137{col 56}{space 4}-214.6973{col 69}{space 3} 29.71699
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2.249194{col 28}{space 2} 2.876863{col 39}{space 1}   -0.78{col 48}{space 3}0.435{col 56}{space 4}-7.928892{col 69}{space 3} 3.430503
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-105.6278{col 28}{space 2} 53.48425{col 39}{space 1}   -1.97{col 48}{space 3}0.050{col 56}{space 4}-211.2201{col 69}{space 3} -.035603
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}  .056976{col 28}{space 2} .0385217{col 39}{space 1}    1.48{col 48}{space 3}0.141{col 56}{space 4}-.0190761{col 69}{space 3} .1330281
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2.203241{col 28}{space 2} 3.563341{col 39}{space 1}    0.62{col 48}{space 3}0.537{col 56}{space 4}-4.831749{col 69}{space 3}  9.23823
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021006{col 28}{space 2} .0002275{col 39}{space 1}    9.23{col 48}{space 3}0.000{col 56}{space 4} .0016514{col 69}{space 3} .0025497
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1539.024{col 28}{space 2} 344.6603{col 39}{space 1}    4.47{col 48}{space 3}0.000{col 56}{space 4} 858.5719{col 69}{space 3} 2219.475
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 if sample_final==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       169
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    167.03
{txt}{col 49}        avg{col 67}= {res}    167.03
{txt}{col 49}        max{col 67}= {res}    167.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  167.0{txt}){col 67}= {res}      1.20
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.2992

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}   .69982{col 28}{space 2} .7978909{col 39}{space 1}    0.88{col 48}{space 3}0.382{col 56}{space 4}-.8754303{col 69}{space 3}  2.27507
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.844749{col 28}{space 2}  2.32027{col 39}{space 1}    0.80{col 48}{space 3}0.428{col 56}{space 4}-2.736086{col 69}{space 3} 6.425584
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.3740454{col 28}{space 2} 1.022635{col 39}{space 1}   -0.37{col 48}{space 3}0.715{col 56}{space 4}-2.393002{col 69}{space 3} 1.644911
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .3712739{col 28}{space 2} .7927374{col 39}{space 1}    0.47{col 48}{space 3}0.640{col 56}{space 4}-1.193802{col 69}{space 3}  1.93635
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0629548{col 28}{space 2} .0368432{col 39}{space 1}    1.71{col 48}{space 3}0.089{col 56}{space 4}-.0097836{col 69}{space 3} .1356933
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .7389948{col 28}{space 2} .6849592{col 39}{space 1}    1.08{col 48}{space 3}0.282{col 56}{space 4}-.6132981{col 69}{space 3} 2.091288
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0006244{col 28}{space 2} .0004933{col 39}{space 1}   -1.27{col 48}{space 3}0.207{col 56}{space 4}-.0015983{col 69}{space 3} .0003496
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0220064{col 28}{space 2} .0456348{col 39}{space 1}    0.48{col 48}{space 3}0.630{col 56}{space 4} -.068089{col 69}{space 3} .1121017
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.09e-06{col 28}{space 2} 2.91e-06{col 39}{space 1}    0.72{col 48}{space 3}0.475{col 56}{space 4}-3.67e-06{col 69}{space 3} 7.84e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} -3.06025{col 28}{space 2} 4.413977{col 39}{space 1}   -0.69{col 48}{space 3}0.489{col 56}{space 4}-11.77462{col 69}{space 3} 5.654122
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. *********************LnNFLw3, MODELS 3-6***************************
. 
. ***********MODEL 3: MODEL 2+w1dxDiabetes w1Glucose******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0175
{txt}{col 49}Largest FMI{col 67}= {res}    0.1365
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     44.71
{txt}{col 49}        avg{col 67}= {res}     59.07
{txt}{col 49}        max{col 67}= {res}     62.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   62.0{txt}){col 67}= {res}      7.18
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-136.5533{col 26}{space 2}  54.2624{col 37}{space 1}   -2.52{col 46}{space 3}0.015{col 54}{space 4}-245.1166{col 67}{space 3}-27.98991
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 52.71921{col 26}{space 2} 79.98497{col 37}{space 1}    0.66{col 46}{space 3}0.512{col 54}{space 4}-107.2539{col 67}{space 3} 212.6923
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2.289712{col 26}{space 2} 3.894999{col 37}{space 1}   -0.59{col 46}{space 3}0.559{col 54}{space 4}-10.07832{col 67}{space 3} 5.498899
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-193.2008{col 26}{space 2} 71.08337{col 37}{space 1}   -2.72{col 46}{space 3}0.009{col 54}{space 4}-335.2911{col 67}{space 3}-51.11051
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0083681{col 26}{space 2} .0563728{col 37}{space 1}    0.15{col 46}{space 3}0.882{col 54}{space 4}-.1043208{col 67}{space 3}  .121057
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-5.855158{col 26}{space 2}  4.79046{col 37}{space 1}   -1.22{col 46}{space 3}0.226{col 54}{space 4}-15.43155{col 67}{space 3} 3.721236
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-107.1846{col 26}{space 2} 59.92643{col 37}{space 1}   -1.79{col 46}{space 3}0.080{col 54}{space 4}-227.9044{col 67}{space 3} 13.53532
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 4.819073{col 26}{space 2} 1.714063{col 37}{space 1}    2.81{col 46}{space 3}0.007{col 54}{space 4} 1.387049{col 67}{space 3} 8.251097
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0011268{col 26}{space 2} .0003273{col 37}{space 1}    3.44{col 46}{space 3}0.001{col 54}{space 4} .0004722{col 67}{space 3} .0017814
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2264.604{col 26}{space 2} 422.6112{col 37}{space 1}    5.36{col 46}{space 3}0.000{col 54}{space 4} 1419.813{col 67}{space 3} 3109.396
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0043
{txt}{col 49}Largest FMI{col 67}= {res}    0.0283
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     59.83
{txt}{col 49}        avg{col 67}= {res}     61.54
{txt}{col 49}        max{col 67}= {res}     62.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   62.1{txt}){col 67}= {res}      8.90
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-107.1643{col 26}{space 2} 50.62808{col 37}{space 1}   -2.12{col 46}{space 3}0.038{col 54}{space 4}-208.3882{col 67}{space 3}-5.940476
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  17.4689{col 26}{space 2} 74.96176{col 37}{space 1}    0.23{col 46}{space 3}0.817{col 54}{space 4}-132.4053{col 67}{space 3} 167.3431
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2.841612{col 26}{space 2} 3.654223{col 37}{space 1}   -0.78{col 46}{space 3}0.440{col 54}{space 4}-10.14691{col 67}{space 3}  4.46369
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-174.1491{col 26}{space 2} 67.01158{col 37}{space 1}   -2.60{col 46}{space 3}0.012{col 54}{space 4}-308.1002{col 67}{space 3}-40.19797
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0312296{col 26}{space 2} .0531119{col 37}{space 1}    0.59{col 46}{space 3}0.559{col 54}{space 4} -.074938{col 67}{space 3} .1373972
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} -8.29726{col 26}{space 2} 4.512695{col 37}{space 1}   -1.84{col 46}{space 3}0.071{col 54}{space 4} -17.3181{col 67}{space 3} .7235758
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-78.22302{col 26}{space 2} 53.52285{col 37}{space 1}   -1.46{col 46}{space 3}0.149{col 54}{space 4} -185.291{col 67}{space 3} 28.84494
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 5.899523{col 26}{space 2} 1.584174{col 37}{space 1}    3.72{col 46}{space 3}0.000{col 54}{space 4} 2.732238{col 67}{space 3} 9.066808
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0012889{col 26}{space 2} .0003063{col 37}{space 1}    4.21{col 46}{space 3}0.000{col 54}{space 4} .0006765{col 67}{space 3} .0019012
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2224.824{col 26}{space 2} 398.3501{col 37}{space 1}    5.59{col 46}{space 3}0.000{col 54}{space 4} 1428.534{col 67}{space 3} 3021.115
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0006
{txt}{col 49}Largest FMI{col 67}= {res}    0.0050
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     61.83
{txt}{col 49}        avg{col 67}= {res}     62.04
{txt}{col 49}        max{col 67}= {res}     62.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   62.1{txt}){col 67}= {res}      1.23
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.2953

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .1645616{col 26}{space 2} .6862379{col 37}{space 1}    0.24{col 46}{space 3}0.811{col 54}{space 4}-1.207188{col 67}{space 3} 1.536311
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .8235185{col 26}{space 2} 1.016251{col 37}{space 1}    0.81{col 46}{space 3}0.421{col 54}{space 4}-1.207909{col 67}{space 3} 2.854946
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0740639{col 26}{space 2} .0496334{col 37}{space 1}    1.49{col 46}{space 3}0.141{col 54}{space 4}-.0251496{col 67}{space 3} .1732774
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.0601447{col 26}{space 2} .9122892{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4}-1.883734{col 67}{space 3} 1.763444
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0010018{col 26}{space 2} .0007229{col 37}{space 1}   -1.39{col 46}{space 3}0.171{col 54}{space 4}-.0024469{col 67}{space 3} .0004433
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0263103{col 26}{space 2} .0613905{col 37}{space 1}    0.43{col 46}{space 3}0.670{col 54}{space 4}-.0964043{col 67}{space 3}  .149025
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-.3600017{col 26}{space 2} .7204704{col 37}{space 1}   -0.50{col 46}{space 3}0.619{col 54}{space 4}-1.800282{col 67}{space 3} 1.080279
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-.0026559{col 26}{space 2} .0214826{col 37}{space 1}   -0.12{col 46}{space 3}0.902{col 54}{space 4}-.0455988{col 67}{space 3}  .040287
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.57e-06{col 26}{space 2} 4.15e-06{col 37}{space 1}    0.62{col 46}{space 3}0.539{col 54}{space 4}-5.74e-06{col 67}{space 3} .0000109
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -.496273{col 26}{space 2} 5.420498{col 37}{space 1}   -0.09{col 46}{space 3}0.927{col 54}{space 4}-11.33143{col 67}{space 3} 10.33888
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITE//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     93.06
{txt}{col 49}        avg{col 67}= {res}     93.06
{txt}{col 49}        max{col 67}= {res}     93.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.1{txt}){col 67}= {res}      9.22
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-177.9378{col 26}{space 2} 70.82888{col 37}{space 1}   -2.51{col 46}{space 3}0.014{col 54}{space 4}-318.5887{col 67}{space 3}-37.28693
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  -90.912{col 26}{space 2}  84.0197{col 37}{space 1}   -1.08{col 46}{space 3}0.282{col 54}{space 4} -257.757{col 67}{space 3} 75.93303
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -1.97255{col 26}{space 2} 4.048718{col 37}{space 1}   -0.49{col 46}{space 3}0.627{col 54}{space 4}-10.01243{col 67}{space 3} 6.067331
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-72.13965{col 26}{space 2} 72.50345{col 37}{space 1}   -0.99{col 46}{space 3}0.322{col 54}{space 4}-216.1159{col 67}{space 3} 71.83658
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0516468{col 26}{space 2}   .04943{col 37}{space 1}    1.04{col 46}{space 3}0.299{col 54}{space 4}-.0465105{col 67}{space 3} .1498042
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 6.232632{col 26}{space 2} 4.960293{col 37}{space 1}    1.26{col 46}{space 3}0.212{col 54}{space 4}-3.617442{col 67}{space 3}  16.0827
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 25.00529{col 26}{space 2} 66.41294{col 37}{space 1}    0.38{col 46}{space 3}0.707{col 54}{space 4}-106.8765{col 67}{space 3} 156.8871
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} .6268315{col 26}{space 2} 1.423798{col 37}{space 1}    0.44{col 46}{space 3}0.661{col 54}{space 4}-2.200525{col 67}{space 3} 3.454188
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019918{col 26}{space 2}  .000294{col 37}{space 1}    6.78{col 46}{space 3}0.000{col 54}{space 4}  .001408{col 67}{space 3} .0025756
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1264.038{col 26}{space 2} 485.3673{col 37}{space 1}    2.60{col 46}{space 3}0.011{col 54}{space 4} 300.2032{col 67}{space 3} 2227.873
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     93.06
{txt}{col 49}        avg{col 67}= {res}     93.06
{txt}{col 49}        max{col 67}= {res}     93.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.1{txt}){col 67}= {res}     11.70
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-166.1073{col 26}{space 2} 73.14011{col 37}{space 1}   -2.27{col 46}{space 3}0.025{col 54}{space 4}-311.3478{col 67}{space 3}-20.86684
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} -212.313{col 26}{space 2} 86.76137{col 37}{space 1}   -2.45{col 46}{space 3}0.016{col 54}{space 4}-384.6024{col 67}{space 3}-40.02359
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.543762{col 26}{space 2} 4.180832{col 37}{space 1}    0.37{col 46}{space 3}0.713{col 54}{space 4} -6.75847{col 67}{space 3} 9.845993
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-36.29912{col 26}{space 2} 74.86932{col 37}{space 1}   -0.48{col 46}{space 3}0.629{col 54}{space 4}-184.9735{col 67}{space 3} 112.3752
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0957578{col 26}{space 2}  .051043{col 37}{space 1}    1.88{col 46}{space 3}0.064{col 54}{space 4}-.0056025{col 67}{space 3} .1971181
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 9.475766{col 26}{space 2} 5.122153{col 37}{space 1}    1.85{col 46}{space 3}0.067{col 54}{space 4}-.6957266{col 67}{space 3} 19.64726
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 2.890782{col 26}{space 2} 68.58007{col 37}{space 1}    0.04{col 46}{space 3}0.966{col 54}{space 4}-133.2945{col 67}{space 3}  139.076
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 1.007495{col 26}{space 2} 1.470258{col 37}{space 1}    0.69{col 46}{space 3}0.495{col 54}{space 4}-1.912122{col 67}{space 3} 3.927111
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0026103{col 26}{space 2} .0003036{col 37}{space 1}    8.60{col 46}{space 3}0.000{col 54}{space 4} .0020075{col 67}{space 3} .0032132
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 439.6294{col 26}{space 2} 501.2054{col 37}{space 1}    0.88{col 46}{space 3}0.383{col 54}{space 4}-555.6566{col 67}{space 3} 1434.915
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     93.06
{txt}{col 49}        avg{col 67}= {res}     93.06
{txt}{col 49}        max{col 67}= {res}     93.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.1{txt}){col 67}= {res}      0.58
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.8072

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .8885111{col 26}{space 2} 1.009881{col 37}{space 1}    0.88{col 46}{space 3}0.381{col 54}{space 4}-1.116895{col 67}{space 3} 2.893917
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} -.041536{col 26}{space 2} 1.197956{col 37}{space 1}   -0.03{col 46}{space 3}0.972{col 54}{space 4}-2.420419{col 67}{space 3} 2.337347
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0550474{col 26}{space 2} .0577268{col 37}{space 1}    0.95{col 46}{space 3}0.343{col 54}{space 4}-.0595855{col 67}{space 3} .1696804
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.585358{col 26}{space 2} 1.033757{col 37}{space 1}    1.53{col 46}{space 3}0.129{col 54}{space 4}-.4674616{col 67}{space 3} 3.638177
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0004467{col 26}{space 2} .0007048{col 37}{space 1}   -0.63{col 46}{space 3}0.528{col 54}{space 4}-.0018463{col 67}{space 3} .0009528
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0317438{col 26}{space 2} .0707241{col 37}{space 1}    0.45{col 46}{space 3}0.655{col 54}{space 4} -.108699{col 67}{space 3} .1721865
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-.3246053{col 26}{space 2} .9469185{col 37}{space 1}   -0.34{col 46}{space 3}0.733{col 54}{space 4}-2.204981{col 67}{space 3} 1.555771
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} .0020617{col 26}{space 2} .0203006{col 37}{space 1}    0.10{col 46}{space 3}0.919{col 54}{space 4}-.0382509{col 67}{space 3} .0423742
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.87e-06{col 26}{space 2} 4.19e-06{col 37}{space 1}    0.69{col 46}{space 3}0.495{col 54}{space 4}-5.45e-06{col 67}{space 3} .0000112
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-5.356224{col 26}{space 2} 6.920387{col 37}{space 1}   -0.77{col 46}{space 3}0.441{col 54}{space 4}-19.09862{col 67}{space 3} 8.386175
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //INTERACTION by Race//
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0047
{txt}{col 49}Largest FMI{col 67}= {res}    0.0508
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    143.47
{txt}{col 49}        avg{col 67}= {res}    162.63
{txt}{col 49}        max{col 67}= {res}    165.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  165.0{txt}){col 67}= {res}     14.44
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-189.3137{col 28}{space 2} 62.26003{col 39}{space 1}   -3.04{col 48}{space 3}0.003{col 56}{space 4}-312.2428{col 69}{space 3}-66.38451
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} -289.745{col 28}{space 2} 176.6008{col 39}{space 1}   -1.64{col 48}{space 3}0.103{col 56}{space 4}-638.4346{col 69}{space 3} 58.94455
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 87.43318{col 28}{space 2} 78.16098{col 39}{space 1}    1.12{col 48}{space 3}0.265{col 56}{space 4}-66.89166{col 69}{space 3}  241.758
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-25.47457{col 28}{space 2} 59.55569{col 39}{space 1}   -0.43{col 48}{space 3}0.669{col 56}{space 4}-143.0644{col 69}{space 3} 92.11528
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -3.27839{col 28}{space 2} 2.802109{col 39}{space 1}   -1.17{col 48}{space 3}0.244{col 56}{space 4}-8.811097{col 69}{space 3} 2.254318
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-137.0769{col 28}{space 2} 51.15739{col 39}{space 1}   -2.68{col 48}{space 3}0.008{col 56}{space 4}-238.0842{col 69}{space 3}-36.06954
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0304169{col 28}{space 2} .0371562{col 39}{space 1}    0.82{col 48}{space 3}0.414{col 56}{space 4}-.0429462{col 69}{space 3} .1037799
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .5831693{col 28}{space 2} 3.486226{col 39}{space 1}    0.17{col 48}{space 3}0.867{col 56}{space 4} -6.30022{col 69}{space 3} 7.466558
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-18.31765{col 28}{space 2} 45.16571{col 39}{space 1}   -0.41{col 48}{space 3}0.686{col 56}{space 4}-107.5939{col 69}{space 3} 70.95857
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 1.852894{col 28}{space 2} 1.082548{col 39}{space 1}    1.71{col 48}{space 3}0.089{col 56}{space 4}-.2851155{col 69}{space 3} 3.990904
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0016737{col 28}{space 2} .0002171{col 39}{space 1}    7.71{col 48}{space 3}0.000{col 56}{space 4}  .001245{col 69}{space 3} .0021023
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1877.693{col 28}{space 2} 339.1008{col 39}{space 1}    5.54{col 48}{space 3}0.000{col 56}{space 4} 1208.145{col 69}{space 3} 2547.241
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0004
{txt}{col 49}Largest FMI{col 67}= {res}    0.0044
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    164.22
{txt}{col 49}        avg{col 67}= {res}    164.93
{txt}{col 49}        max{col 67}= {res}    165.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  165.0{txt}){col 67}= {res}     16.60
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} -171.212{col 28}{space 2} 64.49289{col 39}{space 1}   -2.65{col 48}{space 3}0.009{col 56}{space 4}-298.5495{col 69}{space 3}-43.87445
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-298.1564{col 28}{space 2} 182.9173{col 39}{space 1}   -1.63{col 48}{space 3}0.105{col 56}{space 4}-659.3163{col 69}{space 3}  63.0034
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 93.63387{col 28}{space 2} 80.96184{col 39}{space 1}    1.16{col 48}{space 3}0.249{col 56}{space 4}-66.22068{col 69}{space 3} 253.4884
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-108.9474{col 28}{space 2} 61.68393{col 39}{space 1}   -1.77{col 48}{space 3}0.079{col 56}{space 4}-230.7388{col 69}{space 3} 12.84406
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2.133402{col 28}{space 2} 2.899994{col 39}{space 1}   -0.74{col 48}{space 3}0.463{col 56}{space 4}-7.859283{col 69}{space 3} 3.592479
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-113.9296{col 28}{space 2} 53.00012{col 39}{space 1}   -2.15{col 48}{space 3}0.033{col 56}{space 4}-218.5753{col 69}{space 3}-9.283936
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0658217{col 28}{space 2}  .038485{col 39}{space 1}    1.71{col 48}{space 3}0.089{col 56}{space 4}-.0101647{col 69}{space 3} .1418082
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .4886608{col 28}{space 2} 3.610711{col 39}{space 1}    0.14{col 48}{space 3}0.893{col 56}{space 4}-6.640483{col 69}{space 3} 7.617805
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-8.110189{col 28}{space 2} 45.72895{col 39}{space 1}   -0.18{col 48}{space 3}0.859{col 56}{space 4}-98.40267{col 69}{space 3} 82.18229
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 2.212498{col 28}{space 2} 1.111204{col 39}{space 1}    1.99{col 48}{space 3}0.048{col 56}{space 4} .0184604{col 69}{space 3} 4.406535
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021008{col 28}{space 2} .0002249{col 39}{space 1}    9.34{col 48}{space 3}0.000{col 56}{space 4} .0016567{col 69}{space 3} .0025449
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1483.006{col 28}{space 2} 350.9266{col 39}{space 1}    4.23{col 48}{space 3}0.000{col 56}{space 4} 790.1203{col 69}{space 3} 2175.891
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0010
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    164.89
{txt}{col 49}        avg{col 67}= {res}    165.01
{txt}{col 49}        max{col 67}= {res}    165.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  165.0{txt}){col 67}= {res}      1.02
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.4323

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} .7637657{col 28}{space 2}   .83932{col 39}{space 1}    0.91{col 48}{space 3}0.364{col 56}{space 4}-.8934234{col 69}{space 3} 2.420955
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 2.134036{col 28}{space 2}  2.38055{col 39}{space 1}    0.90{col 48}{space 3}0.371{col 56}{space 4}-2.566226{col 69}{space 3} 6.834298
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.5039657{col 28}{space 2} 1.053669{col 39}{space 1}   -0.48{col 48}{space 3}0.633{col 56}{space 4}-2.584375{col 69}{space 3} 1.576444
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .4350274{col 28}{space 2} .8028018{col 39}{space 1}    0.54{col 48}{space 3}0.589{col 56}{space 4} -1.15006{col 69}{space 3} 2.020115
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0671681{col 28}{space 2} .0377376{col 39}{space 1}    1.78{col 48}{space 3}0.077{col 56}{space 4}-.0073425{col 69}{space 3} .1416788
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .7693619{col 28}{space 2}  .689766{col 39}{space 1}    1.12{col 48}{space 3}0.266{col 56}{space 4}-.5925417{col 69}{space 3} 2.131265
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0006762{col 28}{space 2} .0005009{col 39}{space 1}   -1.35{col 48}{space 3}0.179{col 56}{space 4}-.0016651{col 69}{space 3} .0003127
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0284649{col 28}{space 2} .0469898{col 39}{space 1}    0.61{col 48}{space 3}0.546{col 56}{space 4}-.0643138{col 69}{space 3} .1212436
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-.3416657{col 28}{space 2} .5941409{col 39}{space 1}   -0.58{col 48}{space 3}0.566{col 56}{space 4}-1.514771{col 69}{space 3} .8314393
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} .0005224{col 28}{space 2} .0144524{col 39}{space 1}    0.04{col 48}{space 3}0.971{col 56}{space 4}-.0280131{col 69}{space 3}  .029058
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.11e-06{col 28}{space 2} 2.93e-06{col 39}{space 1}    0.72{col 48}{space 3}0.472{col 56}{space 4}-3.67e-06{col 69}{space 3} 7.89e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-3.581983{col 28}{space 2} 4.566893{col 39}{space 1}   -0.78{col 48}{space 3}0.434{col 56}{space 4}-12.59906{col 69}{space 3} 5.435092
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 4: MODEL 2+liver/kidney disease******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.1505
{txt}{col 49}Largest FMI{col 67}= {res}    0.6858
{txt}{col 49}Complete DF{col 67}= {res}        61
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      7.10
{txt}{col 49}        avg{col 67}= {res}     50.05
{txt}{col 49}        max{col 67}= {res}     58.55
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   56.4{txt}){col 67}= {res}      4.03
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0002

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-115.9693{col 26}{space 2} 58.59667{col 37}{space 1}   -1.98{col 46}{space 3}0.053{col 54}{space 4}  -233.24{col 67}{space 3} 1.301397
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 53.77598{col 26}{space 2} 117.9691{col 37}{space 1}    0.46{col 46}{space 3}0.651{col 54}{space 4}-185.2645{col 67}{space 3} 292.8165
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-5.040265{col 26}{space 2} 4.648016{col 37}{space 1}   -1.08{col 46}{space 3}0.283{col 54}{space 4}-14.35779{col 67}{space 3} 4.277259
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-184.9634{col 26}{space 2} 78.43855{col 37}{space 1}   -2.36{col 46}{space 3}0.022{col 54}{space 4}-342.0656{col 67}{space 3} -27.8612
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0143906{col 26}{space 2} .0634794{col 37}{space 1}    0.23{col 46}{space 3}0.822{col 54}{space 4}-.1129629{col 67}{space 3} .1417441
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-3.568123{col 26}{space 2} 6.024075{col 37}{space 1}   -0.59{col 46}{space 3}0.556{col 54}{space 4}-15.63836{col 67}{space 3} 8.502114
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 95.88111{col 26}{space 2} 244.3581{col 37}{space 1}    0.39{col 46}{space 3}0.706{col 54}{space 4}-480.2942{col 67}{space 3} 672.0564
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-5010.174{col 26}{space 2} 5116.935{col 37}{space 1}   -0.98{col 46}{space 3}0.332{col 54}{space 4}-15256.55{col 67}{space 3} 5236.204
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 3.433965{col 26}{space 2} 10.96329{col 37}{space 1}    0.31{col 46}{space 3}0.755{col 54}{space 4}-18.58168{col 67}{space 3}  25.4496
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} .6320617{col 26}{space 2}  1.68966{col 37}{space 1}    0.37{col 46}{space 3}0.710{col 54}{space 4}-2.751639{col 67}{space 3} 4.015763
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}  -9.8262{col 26}{space 2} 29.04461{col 37}{space 1}   -0.34{col 46}{space 3}0.737{col 54}{space 4}-68.12239{col 67}{space 3} 48.46999
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0012943{col 26}{space 2} .0003662{col 37}{space 1}    3.53{col 46}{space 3}0.001{col 54}{space 4} .0005607{col 67}{space 3} .0020278
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7450.365{col 26}{space 2} 5204.535{col 37}{space 1}    1.43{col 46}{space 3}0.158{col 54}{space 4}-2969.428{col 67}{space 3} 17870.16
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0585
{txt}{col 49}Largest FMI{col 67}= {res}    0.4271
{txt}{col 49}Complete DF{col 67}= {res}        61
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     15.83
{txt}{col 49}        avg{col 67}= {res}     53.97
{txt}{col 49}        max{col 67}= {res}     58.92
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   58.5{txt}){col 67}= {res}      4.76
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-99.33911{col 26}{space 2} 57.19733{col 37}{space 1}   -1.74{col 46}{space 3}0.088{col 54}{space 4} -213.794{col 67}{space 3}  15.1158
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-5.649608{col 26}{space 2}  108.961{col 37}{space 1}   -0.05{col 46}{space 3}0.959{col 54}{space 4}-224.2471{col 67}{space 3} 212.9479
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.088827{col 26}{space 2} 4.475284{col 37}{space 1}   -1.36{col 46}{space 3}0.179{col 54}{space 4} -15.0478{col 67}{space 3} 2.870146
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-178.9088{col 26}{space 2} 75.84853{col 37}{space 1}   -2.36{col 46}{space 3}0.022{col 54}{space 4}-330.7015{col 67}{space 3}-27.11608
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0525275{col 26}{space 2} .0611601{col 37}{space 1}    0.86{col 46}{space 3}0.394{col 54}{space 4}-.0699775{col 67}{space 3} .1750324
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-8.326425{col 26}{space 2} 5.836258{col 37}{space 1}   -1.43{col 46}{space 3}0.159{col 54}{space 4}-20.01099{col 67}{space 3} 3.358141
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 90.42891{col 26}{space 2} 187.0555{col 37}{space 1}    0.48{col 46}{space 3}0.635{col 54}{space 4}-306.4622{col 67}{space 3}   487.32
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-52.51731{col 26}{space 2} 4997.798{col 37}{space 1}   -0.01{col 46}{space 3}0.992{col 54}{space 4}-10058.78{col 67}{space 3} 9953.744
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 13.68965{col 26}{space 2} 10.46063{col 37}{space 1}    1.31{col 46}{space 3}0.196{col 54}{space 4}-7.259683{col 67}{space 3} 34.63898
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} .4309292{col 26}{space 2} 1.641804{col 37}{space 1}    0.26{col 46}{space 3}0.794{col 54}{space 4}-2.855333{col 67}{space 3} 3.717192
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-5.917094{col 26}{space 2} 27.89799{col 37}{space 1}   -0.21{col 46}{space 3}0.833{col 54}{space 4}-61.80027{col 67}{space 3} 49.96608
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0015714{col 26}{space 2} .0003547{col 37}{space 1}    4.43{col 46}{space 3}0.000{col 54}{space 4} .0008614{col 67}{space 3} .0022814
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2332.396{col 26}{space 2} 5088.056{col 37}{space 1}    0.46{col 46}{space 3}0.648{col 54}{space 4}-7853.373{col 67}{space 3} 12518.17
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0147
{txt}{col 49}Largest FMI{col 67}= {res}    0.1031
{txt}{col 49}Complete DF{col 67}= {res}        61
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     47.65
{txt}{col 49}        avg{col 67}= {res}     57.63
{txt}{col 49}        max{col 67}= {res}     58.84
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   59.0{txt}){col 67}= {res}      1.29
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.2503

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .2593107{col 26}{space 2}  .701819{col 37}{space 1}    0.37{col 46}{space 3}0.713{col 54}{space 4}-1.145247{col 67}{space 3} 1.663868
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .9462628{col 26}{space 2} 1.300039{col 37}{space 1}    0.73{col 46}{space 3}0.470{col 54}{space 4}-1.656034{col 67}{space 3}  3.54856
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0804206{col 26}{space 2} .0545217{col 37}{space 1}    1.48{col 46}{space 3}0.146{col 54}{space 4}-.0286967{col 67}{space 3} .1895379
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} .1292784{col 26}{space 2} .9307684{col 37}{space 1}    0.14{col 46}{space 3}0.890{col 54}{space 4}-1.733713{col 67}{space 3}  1.99227
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0011728{col 26}{space 2} .0007404{col 37}{space 1}   -1.58{col 46}{space 3}0.119{col 54}{space 4}-.0026548{col 67}{space 3} .0003092
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}   .04936{col 26}{space 2} .0713297{col 37}{space 1}    0.69{col 46}{space 3}0.492{col 54}{space 4} -.093435{col 67}{space 3}  .192155
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 1.295571{col 26}{space 2} 1.894791{col 37}{space 1}    0.68{col 46}{space 3}0.497{col 54}{space 4}-2.514882{col 67}{space 3} 5.106025
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-80.31081{col 26}{space 2} 60.66289{col 37}{space 1}   -1.32{col 46}{space 3}0.191{col 54}{space 4}-201.7065{col 67}{space 3} 41.08485
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} .0775405{col 26}{space 2} .1264851{col 37}{space 1}    0.61{col 46}{space 3}0.542{col 54}{space 4}-.1755764{col 67}{space 3} .3306574
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0076717{col 26}{space 2}  .019997{col 37}{space 1}   -0.38{col 46}{space 3}0.703{col 54}{space 4} -.047688{col 67}{space 3} .0323446
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-.4888664{col 26}{space 2} .3368877{col 37}{space 1}   -1.45{col 46}{space 3}0.152{col 54}{space 4}-1.163077{col 67}{space 3} .1853441
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.76e-06{col 26}{space 2} 4.33e-06{col 37}{space 1}    0.64{col 46}{space 3}0.526{col 54}{space 4}-5.90e-06{col 67}{space 3} .0000114
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 80.65796{col 26}{space 2} 61.88089{col 37}{space 1}    1.30{col 46}{space 3}0.198{col 54}{space 4}-43.17658{col 67}{space 3} 204.4925
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0248
{txt}{col 49}Largest FMI{col 67}= {res}    0.1887
{txt}{col 49}Complete DF{col 67}= {res}        92
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     47.78
{txt}{col 49}        avg{col 67}= {res}     81.36
{txt}{col 49}        max{col 67}= {res}     90.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   89.8{txt}){col 67}= {res}      7.64
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-183.2738{col 26}{space 2} 71.01167{col 37}{space 1}   -2.58{col 46}{space 3}0.011{col 54}{space 4}-324.3545{col 67}{space 3}-42.19314
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-121.8029{col 26}{space 2} 105.0013{col 37}{space 1}   -1.16{col 46}{space 3}0.249{col 54}{space 4}-330.4942{col 67}{space 3} 86.88844
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -1.44628{col 26}{space 2} 4.084327{col 37}{space 1}   -0.35{col 46}{space 3}0.724{col 54}{space 4}-9.560469{col 67}{space 3} 6.667909
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-61.35343{col 26}{space 2} 72.90001{col 37}{space 1}   -0.84{col 46}{space 3}0.402{col 54}{space 4}-206.1865{col 67}{space 3} 83.47959
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0423898{col 26}{space 2} .0504247{col 37}{space 1}    0.84{col 46}{space 3}0.403{col 54}{space 4}-.0578083{col 67}{space 3} .1425878
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 5.831192{col 26}{space 2} 5.293382{col 37}{space 1}    1.10{col 46}{space 3}0.274{col 54}{space 4}-4.685119{col 67}{space 3}  16.3475
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-49.49741{col 26}{space 2} 210.2842{col 37}{space 1}   -0.24{col 46}{space 3}0.815{col 54}{space 4}-472.3515{col 67}{space 3} 373.3567
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-1043.626{col 26}{space 2} 6152.148{col 37}{space 1}   -0.17{col 46}{space 3}0.866{col 54}{space 4}-13335.18{col 67}{space 3} 11247.92
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 14.25207{col 26}{space 2} 9.177836{col 37}{space 1}    1.55{col 46}{space 3}0.125{col 54}{space 4}-4.021577{col 67}{space 3} 32.52572
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-1.360897{col 26}{space 2} 1.509782{col 37}{space 1}   -0.90{col 46}{space 3}0.370{col 54}{space 4} -4.36038{col 67}{space 3} 1.638587
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} 7.766023{col 26}{space 2} 26.84689{col 37}{space 1}    0.29{col 46}{space 3}0.773{col 54}{space 4}-45.57057{col 67}{space 3} 61.10261
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0021001{col 26}{space 2} .0003074{col 37}{space 1}    6.83{col 46}{space 3}0.000{col 54}{space 4} .0014893{col 67}{space 3} .0027109
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2193.267{col 26}{space 2}  6153.67{col 37}{space 1}    0.36{col 46}{space 3}0.723{col 54}{space 4}-10100.68{col 67}{space 3} 14487.22
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0293
{txt}{col 49}Largest FMI{col 67}= {res}    0.2245
{txt}{col 49}Complete DF{col 67}= {res}        92
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     40.94
{txt}{col 49}        avg{col 67}= {res}     80.45
{txt}{col 49}        max{col 67}= {res}     89.95
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   89.7{txt}){col 67}= {res}      9.53
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} -179.926{col 26}{space 2}  73.6486{col 37}{space 1}   -2.44{col 46}{space 3}0.017{col 54}{space 4}-326.2607{col 67}{space 3} -33.5913
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-225.5421{col 26}{space 2} 108.9791{col 37}{space 1}   -2.07{col 46}{space 3}0.041{col 54}{space 4}-442.1859{col 67}{space 3}-8.898241
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.402984{col 26}{space 2} 4.225132{col 37}{space 1}    0.33{col 46}{space 3}0.741{col 54}{space 4}-6.991039{col 67}{space 3} 9.797007
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-27.41966{col 26}{space 2} 75.38608{col 37}{space 1}   -0.36{col 46}{space 3}0.717{col 54}{space 4}-177.1921{col 67}{space 3} 122.3528
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0832346{col 26}{space 2} .0522383{col 37}{space 1}    1.59{col 46}{space 3}0.115{col 54}{space 4}-.0205759{col 67}{space 3} .1870451
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 9.700234{col 26}{space 2} 5.481409{col 37}{space 1}    1.77{col 46}{space 3}0.080{col 54}{space 4}-1.190108{col 67}{space 3} 20.59058
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 25.11687{col 26}{space 2} 221.6906{col 37}{space 1}    0.11{col 46}{space 3}0.910{col 54}{space 4}-422.6179{col 67}{space 3} 472.8516
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} -505.014{col 26}{space 2} 6387.059{col 37}{space 1}   -0.08{col 46}{space 3}0.937{col 54}{space 4}-13274.04{col 67}{space 3} 12264.01
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 15.54302{col 26}{space 2} 9.439463{col 37}{space 1}    1.65{col 46}{space 3}0.104{col 54}{space 4}-3.241617{col 67}{space 3} 34.32766
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0568524{col 26}{space 2} 1.564446{col 37}{space 1}   -0.04{col 46}{space 3}0.971{col 54}{space 4} -3.16515{col 67}{space 3} 3.051445
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-7.670829{col 26}{space 2} 27.77624{col 37}{space 1}   -0.28{col 46}{space 3}0.783{col 54}{space 4}-62.85468{col 67}{space 3} 47.51302
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0026533{col 26}{space 2} .0003178{col 37}{space 1}    8.35{col 46}{space 3}0.000{col 54}{space 4} .0020219{col 67}{space 3} .0032846
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 857.4879{col 26}{space 2} 6391.134{col 37}{space 1}    0.13{col 46}{space 3}0.894{col 54}{space 4}-11919.81{col 67}{space 3} 13634.78
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0055
{txt}{col 49}Largest FMI{col 67}= {res}    0.0552
{txt}{col 49}Complete DF{col 67}= {res}        92
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     80.61
{txt}{col 49}        avg{col 67}= {res}     88.96
{txt}{col 49}        max{col 67}= {res}     90.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   90.0{txt}){col 67}= {res}      0.77
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.6691

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .6220908{col 26}{space 2} 1.011489{col 37}{space 1}    0.62{col 46}{space 3}0.540{col 54}{space 4}-1.387421{col 67}{space 3} 2.631602
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-1.033748{col 26}{space 2} 1.483736{col 37}{space 1}   -0.70{col 46}{space 3}0.488{col 54}{space 4}-3.981593{col 67}{space 3} 1.914098
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0542895{col 26}{space 2} .0582348{col 37}{space 1}    0.93{col 46}{space 3}0.354{col 54}{space 4}-.0614044{col 67}{space 3} .1699833
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}  1.32337{col 26}{space 2} 1.038125{col 37}{space 1}    1.27{col 46}{space 3}0.206{col 54}{space 4}-.7390484{col 67}{space 3} 3.385789
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0005576{col 26}{space 2} .0007155{col 37}{space 1}   -0.78{col 46}{space 3}0.438{col 54}{space 4}-.0019792{col 67}{space 3}  .000864
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-.0144721{col 26}{space 2} .0754273{col 37}{space 1}   -0.19{col 46}{space 3}0.848{col 54}{space 4}-.1643212{col 67}{space 3} .1353771
{txt}w1Creatinine {c |}{col 14}{res}{space 2} .2803667{col 26}{space 2} 2.800264{col 37}{space 1}    0.10{col 46}{space 3}0.920{col 54}{space 4}-5.291687{col 67}{space 3}  5.85242
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 118.6752{col 26}{space 2} 83.06201{col 37}{space 1}    1.43{col 46}{space 3}0.157{col 54}{space 4}-46.37251{col 67}{space 3} 283.7229
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}   .02638{col 26}{space 2} .1270688{col 37}{space 1}    0.21{col 46}{space 3}0.836{col 54}{space 4}-.2260957{col 67}{space 3} .2788556
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0072628{col 26}{space 2} .0215174{col 37}{space 1}   -0.34{col 46}{space 3}0.737{col 54}{space 4}-.0500114{col 67}{space 3} .0354857
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} .2308601{col 26}{space 2} .3828253{col 37}{space 1}    0.60{col 46}{space 3}0.548{col 54}{space 4}-.5297049{col 67}{space 3} .9914251
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.30e-06{col 26}{space 2} 4.37e-06{col 37}{space 1}    0.75{col 46}{space 3}0.452{col 54}{space 4}-5.38e-06{col 67}{space 3}  .000012
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-124.1783{col 26}{space 2} 83.13286{col 37}{space 1}   -1.49{col 46}{space 3}0.139{col 54}{space 4}-289.3687{col 67}{space 3} 41.01201
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. **INTERACTION by Race**
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0614
{txt}{col 49}Largest FMI{col 67}= {res}    0.4950
{txt}{col 49}Complete DF{col 67}= {res}       164
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     16.55
{txt}{col 49}        avg{col 67}= {res}    143.95
{txt}{col 49}        max{col 67}= {res}    161.96
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  159.4{txt}){col 67}= {res}     11.24
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-174.3705{col 28}{space 2} 62.95387{col 39}{space 1}   -2.77{col 48}{space 3}0.006{col 56}{space 4}-298.7203{col 69}{space 3}-50.02068
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-226.9593{col 28}{space 2} 179.0605{col 39}{space 1}   -1.27{col 48}{space 3}0.207{col 56}{space 4}-580.6338{col 69}{space 3} 126.7152
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}  66.3719{col 28}{space 2} 78.20796{col 39}{space 1}    0.85{col 48}{space 3}0.397{col 56}{space 4}-88.07877{col 69}{space 3} 220.8226
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-36.61633{col 28}{space 2} 76.75469{col 39}{space 1}   -0.48{col 48}{space 3}0.634{col 56}{space 4}-188.5625{col 69}{space 3} 115.3299
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-4.175338{col 28}{space 2} 2.900759{col 39}{space 1}   -1.44{col 48}{space 3}0.152{col 56}{space 4} -9.90362{col 69}{space 3} 1.552943
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-127.1003{col 28}{space 2} 51.99055{col 39}{space 1}   -2.44{col 48}{space 3}0.016{col 56}{space 4}-229.7685{col 69}{space 3}-24.43217
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0229277{col 28}{space 2}  .037625{col 39}{space 1}    0.61{col 48}{space 3}0.543{col 56}{space 4}-.0513801{col 69}{space 3} .0972354
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .9251415{col 28}{space 2} 3.865173{col 39}{space 1}    0.24{col 48}{space 3}0.811{col 56}{space 4}-6.707556{col 69}{space 3} 8.557838
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} 38.35774{col 28}{space 2} 154.2377{col 39}{space 1}    0.25{col 48}{space 3}0.807{col 56}{space 4}-287.7333{col 69}{space 3} 364.4488
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-2080.257{col 28}{space 2} 3887.671{col 39}{space 1}   -0.54{col 48}{space 3}0.593{col 56}{space 4}-9765.295{col 69}{space 3} 5604.781
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 9.900945{col 28}{space 2} 6.795449{col 39}{space 1}    1.46{col 48}{space 3}0.147{col 56}{space 4}-3.537771{col 69}{space 3} 23.33966
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.3066271{col 28}{space 2} 1.103187{col 39}{space 1}   -0.28{col 48}{space 3}0.781{col 56}{space 4}-2.485339{col 69}{space 3} 1.872085
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-1.066364{col 28}{space 2} 19.20419{col 39}{space 1}   -0.06{col 48}{space 3}0.956{col 56}{space 4} -38.9907{col 69}{space 3} 36.85797
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0017241{col 28}{space 2} .0002266{col 39}{space 1}    7.61{col 48}{space 3}0.000{col 56}{space 4} .0012765{col 69}{space 3} .0021716
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 3977.295{col 28}{space 2} 3916.594{col 39}{space 1}    1.02{col 48}{space 3}0.312{col 56}{space 4}-3765.211{col 69}{space 3}  11719.8
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0237
{txt}{col 49}Largest FMI{col 67}= {res}    0.2323
{txt}{col 49}Complete DF{col 67}= {res}       164
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     52.13
{txt}{col 49}        avg{col 67}= {res}    151.29
{txt}{col 49}        max{col 67}= {res}    161.89
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  161.6{txt}){col 67}= {res}     13.40
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-161.1073{col 28}{space 2} 64.85378{col 39}{space 1}   -2.48{col 48}{space 3}0.014{col 56}{space 4}-289.1861{col 69}{space 3}-33.02841
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-225.4071{col 28}{space 2} 184.3274{col 39}{space 1}   -1.22{col 48}{space 3}0.223{col 56}{space 4}-589.4167{col 69}{space 3} 138.6026
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 69.60653{col 28}{space 2} 80.79618{col 39}{space 1}    0.86{col 48}{space 3}0.390{col 56}{space 4}-89.94563{col 69}{space 3} 229.1587
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-111.0909{col 28}{space 2}  77.3961{col 39}{space 1}   -1.44{col 48}{space 3}0.153{col 56}{space 4}-263.9899{col 69}{space 3} 41.80809
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -2.85325{col 28}{space 2} 3.008672{col 39}{space 1}   -0.95{col 48}{space 3}0.344{col 56}{space 4}-8.794756{col 69}{space 3} 3.088256
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-102.4905{col 28}{space 2} 53.85006{col 39}{space 1}   -1.90{col 48}{space 3}0.059{col 56}{space 4}-208.8301{col 69}{space 3} 3.849146
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0523913{col 28}{space 2} .0389314{col 39}{space 1}    1.35{col 48}{space 3}0.180{col 56}{space 4}-.0244938{col 69}{space 3} .1292764
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1.372177{col 28}{space 2} 4.010081{col 39}{space 1}    0.34{col 48}{space 3}0.733{col 56}{space 4}-6.546872{col 69}{space 3} 9.291226
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} 78.62751{col 28}{space 2} 134.2696{col 39}{space 1}    0.59{col 48}{space 3}0.561{col 56}{space 4}-190.7881{col 69}{space 3} 348.0432
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} 327.6576{col 28}{space 2} 4008.267{col 39}{space 1}    0.08{col 48}{space 3}0.935{col 56}{space 4}-7593.231{col 69}{space 3} 8248.546
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 12.99593{col 28}{space 2} 6.897575{col 39}{space 1}    1.88{col 48}{space 3}0.061{col 56}{space 4}-.6279784{col 69}{space 3} 26.61984
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} .3282369{col 28}{space 2} 1.142131{col 39}{space 1}    0.29{col 48}{space 3}0.774{col 56}{space 4}-1.927339{col 69}{space 3} 2.583813
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-12.07779{col 28}{space 2} 19.87475{col 39}{space 1}   -0.61{col 48}{space 3}0.544{col 56}{space 4}-51.32548{col 69}{space 3} 27.16991
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2}  .002135{col 28}{space 2} .0002349{col 39}{space 1}    9.09{col 48}{space 3}0.000{col 56}{space 4} .0016713{col 69}{space 3} .0025988
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1105.547{col 28}{space 2} 4036.323{col 39}{space 1}    0.27{col 48}{space 3}0.785{col 56}{space 4} -6870.83{col 69}{space 3} 9081.924
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0044
{txt}{col 49}Largest FMI{col 67}= {res}    0.0522
{txt}{col 49}Complete DF{col 67}= {res}       164
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    140.24
{txt}{col 49}        avg{col 67}= {res}    160.32
{txt}{col 49}        max{col 67}= {res}    161.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  162.0{txt}){col 67}= {res}      0.95
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.5031

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} .4927124{col 28}{space 2} .8374696{col 39}{space 1}    0.59{col 48}{space 3}0.557{col 56}{space 4} -1.16108{col 69}{space 3} 2.146505
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.618041{col 28}{space 2} 2.383049{col 39}{space 1}    0.68{col 48}{space 3}0.498{col 56}{space 4}-3.087826{col 69}{space 3} 6.323908
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.1966237{col 28}{space 2} 1.045773{col 39}{space 1}   -0.19{col 48}{space 3}0.851{col 56}{space 4}-2.261732{col 69}{space 3} 1.868485
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .0403035{col 28}{space 2} .9916896{col 39}{space 1}    0.04{col 48}{space 3}0.968{col 56}{space 4}-1.918085{col 69}{space 3} 1.998692
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0631243{col 28}{space 2} .0389275{col 39}{space 1}    1.62{col 48}{space 3}0.107{col 56}{space 4}-.0137476{col 69}{space 3} .1399962
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .7185193{col 28}{space 2}  .697291{col 39}{space 1}    1.03{col 48}{space 3}0.304{col 56}{space 4}-.6584361{col 69}{space 3} 2.095475
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0006685{col 28}{space 2} .0005026{col 39}{space 1}   -1.33{col 48}{space 3}0.185{col 56}{space 4} -.001661{col 69}{space 3} .0003241
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}   .00764{col 28}{space 2} .0518691{col 39}{space 1}    0.15{col 48}{space 3}0.883{col 56}{space 4}-.0947874{col 69}{space 3} .1100674
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} .5285514{col 28}{space 2} 1.583521{col 39}{space 1}    0.33{col 48}{space 3}0.739{col 56}{space 4}-2.602108{col 69}{space 3} 3.659211
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} 29.90748{col 28}{space 2} 50.98007{col 39}{space 1}    0.59{col 48}{space 3}0.558{col 56}{space 4}-70.76467{col 69}{space 3} 130.5796
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2}   .06956{col 28}{space 2} .0886605{col 39}{space 1}    0.78{col 48}{space 3}0.434{col 56}{space 4}-.1055225{col 69}{space 3} .2446425
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.0062523{col 28}{space 2} .0147461{col 39}{space 1}   -0.42{col 48}{space 3}0.672{col 56}{space 4}-.0353721{col 69}{space 3} .0228675
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-.0308046{col 28}{space 2} .2572787{col 39}{space 1}   -0.12{col 48}{space 3}0.905{col 56}{space 4}-.5388596{col 69}{space 3} .4772504
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.44e-06{col 28}{space 2} 3.04e-06{col 39}{space 1}    0.80{col 48}{space 3}0.424{col 56}{space 4}-3.57e-06{col 69}{space 3} 8.44e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-33.39449{col 28}{space 2} 51.33492{col 39}{space 1}   -0.65{col 48}{space 3}0.516{col 56}{space 4}-134.7675{col 69}{space 3} 67.97849
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 5: MODEL2+OXIDATIVE STRESS******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0662
{txt}{col 49}Largest FMI{col 67}= {res}    0.4399
{txt}{col 49}Complete DF{col 67}= {res}        63
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     15.39
{txt}{col 49}        avg{col 67}= {res}     56.07
{txt}{col 49}        max{col 67}= {res}     60.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   60.3{txt}){col 67}= {res}      5.37
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-115.6229{col 26}{space 2} 54.58097{col 37}{space 1}   -2.12{col 46}{space 3}0.038{col 54}{space 4}-224.8011{col 67}{space 3}-6.444672
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 38.86292{col 26}{space 2} 83.33794{col 37}{space 1}    0.47{col 46}{space 3}0.643{col 54}{space 4}-127.7868{col 67}{space 3} 205.5126
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -3.77613{col 26}{space 2} 4.008641{col 37}{space 1}   -0.94{col 46}{space 3}0.350{col 54}{space 4}-11.79469{col 67}{space 3} 4.242432
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -196.898{col 26}{space 2} 74.71508{col 37}{space 1}   -2.64{col 46}{space 3}0.011{col 54}{space 4}-346.3317{col 67}{space 3} -47.4643
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0415256{col 26}{space 2} .0623039{col 37}{space 1}    0.67{col 46}{space 3}0.508{col 54}{space 4} -.083204{col 67}{space 3} .1662552
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-2.562019{col 26}{space 2}  5.17898{col 37}{space 1}   -0.49{col 46}{space 3}0.623{col 54}{space 4} -12.9222{col 67}{space 3} 7.798165
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 1.079754{col 26}{space 2} 5.830173{col 37}{space 1}    0.19{col 46}{space 3}0.855{col 54}{space 4}-11.31977{col 67}{space 3} 13.47928
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 218.5903{col 26}{space 2} 117.4847{col 37}{space 1}    1.86{col 46}{space 3}0.068{col 54}{space 4}-16.34263{col 67}{space 3} 453.5233
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} .7925562{col 26}{space 2} 17.55167{col 37}{space 1}    0.05{col 46}{space 3}0.964{col 54}{space 4}-34.30441{col 67}{space 3} 35.88952
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0012853{col 26}{space 2} .0003383{col 37}{space 1}    3.80{col 46}{space 3}0.000{col 54}{space 4} .0006085{col 67}{space 3}  .001962
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1404.209{col 26}{space 2} 708.8406{col 37}{space 1}    1.98{col 46}{space 3}0.052{col 54}{space 4}-13.35392{col 67}{space 3} 2821.773
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0467
{txt}{col 49}Largest FMI{col 67}= {res}    0.3499
{txt}{col 49}Complete DF{col 67}= {res}        63
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     20.80
{txt}{col 49}        avg{col 67}= {res}     56.61
{txt}{col 49}        max{col 67}= {res}     60.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   60.6{txt}){col 67}= {res}      5.49
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-83.96033{col 26}{space 2} 53.95406{col 37}{space 1}   -1.56{col 46}{space 3}0.125{col 54}{space 4}-191.8611{col 67}{space 3} 23.94045
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}   8.4185{col 26}{space 2}  82.9323{col 37}{space 1}    0.10{col 46}{space 3}0.919{col 54}{space 4}-157.4415{col 67}{space 3} 174.2785
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-3.665944{col 26}{space 2}  3.98502{col 37}{space 1}   -0.92{col 46}{space 3}0.361{col 54}{space 4}-11.63812{col 67}{space 3} 4.306236
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -181.664{col 26}{space 2} 74.01332{col 37}{space 1}   -2.45{col 46}{space 3}0.017{col 54}{space 4}-329.6799{col 67}{space 3} -33.6481
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0484762{col 26}{space 2} .0614295{col 37}{space 1}    0.79{col 46}{space 3}0.433{col 54}{space 4}-.0744398{col 67}{space 3} .1713921
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-5.185816{col 26}{space 2} 5.157262{col 37}{space 1}   -1.01{col 46}{space 3}0.319{col 54}{space 4}-15.50492{col 67}{space 3} 5.133287
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-2.287269{col 26}{space 2} 5.441936{col 37}{space 1}   -0.42{col 46}{space 3}0.679{col 54}{space 4}-13.61106{col 67}{space 3} 9.036519
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 178.2903{col 26}{space 2} 116.7074{col 37}{space 1}    1.53{col 46}{space 3}0.132{col 54}{space 4}-55.09867{col 67}{space 3} 411.6792
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}  .581556{col 26}{space 2} 17.41982{col 37}{space 1}    0.03{col 46}{space 3}0.973{col 54}{space 4}-34.25178{col 67}{space 3} 35.41489
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0015007{col 26}{space 2} .0003366{col 37}{space 1}    4.46{col 46}{space 3}0.000{col 54}{space 4} .0008274{col 67}{space 3}  .002174
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1639.635{col 26}{space 2} 703.0979{col 37}{space 1}    2.33{col 46}{space 3}0.023{col 54}{space 4} 233.5942{col 67}{space 3} 3045.676
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0125
{txt}{col 49}Largest FMI{col 67}= {res}    0.1005
{txt}{col 49}Complete DF{col 67}= {res}        63
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     49.45
{txt}{col 49}        avg{col 67}= {res}     59.82
{txt}{col 49}        max{col 67}= {res}     61.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   61.0{txt}){col 67}= {res}      1.12
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.3644

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .2318003{col 26}{space 2} .6725017{col 37}{space 1}    0.34{col 46}{space 3}0.732{col 54}{space 4} -1.11294{col 67}{space 3} 1.576541
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .8826603{col 26}{space 2} 1.033998{col 37}{space 1}    0.85{col 46}{space 3}0.397{col 54}{space 4}-1.185029{col 67}{space 3} 2.950349
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0586685{col 26}{space 2} .0495052{col 37}{space 1}    1.19{col 46}{space 3}0.241{col 54}{space 4}-.0403341{col 67}{space 3} .1576711
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} .0106672{col 26}{space 2} .9243334{col 37}{space 1}    0.01{col 46}{space 3}0.991{col 54}{space 4}-1.837793{col 67}{space 3} 1.859128
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0009395{col 26}{space 2} .0007594{col 37}{space 1}   -1.24{col 46}{space 3}0.221{col 54}{space 4}-.0024581{col 67}{space 3} .0005791
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0218817{col 26}{space 2} .0638792{col 37}{space 1}    0.34{col 46}{space 3}0.733{col 54}{space 4}-.1058646{col 67}{space 3}  .149628
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} .0383518{col 26}{space 2} .0592803{col 37}{space 1}    0.65{col 46}{space 3}0.521{col 54}{space 4}-.0807489{col 67}{space 3} .1574526
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}  -.95409{col 26}{space 2} 1.459153{col 37}{space 1}   -0.65{col 46}{space 3}0.516{col 54}{space 4}-3.872105{col 67}{space 3} 1.963925
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-.0003477{col 26}{space 2} .2177091{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-.4356849{col 67}{space 3} .4349894
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.16e-06{col 26}{space 2} 4.18e-06{col 37}{space 1}    0.52{col 46}{space 3}0.607{col 54}{space 4}-6.19e-06{col 67}{space 3} .0000105
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 3.544946{col 26}{space 2}  8.77054{col 37}{space 1}    0.40{col 46}{space 3}0.687{col 54}{space 4}-13.99263{col 67}{space 3} 21.08252
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0089
{txt}{col 49}Largest FMI{col 67}= {res}    0.0613
{txt}{col 49}Complete DF{col 67}= {res}        94
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     80.77
{txt}{col 49}        avg{col 67}= {res}     90.70
{txt}{col 49}        max{col 67}= {res}     92.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   92.0{txt}){col 67}= {res}      8.17
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-158.2224{col 26}{space 2}  67.3464{col 37}{space 1}   -2.35{col 46}{space 3}0.021{col 54}{space 4}-291.9776{col 67}{space 3}-24.46731
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-102.0385{col 26}{space 2} 86.77435{col 37}{space 1}   -1.18{col 46}{space 3}0.243{col 54}{space 4}-274.3791{col 67}{space 3} 70.30214
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.229334{col 26}{space 2}  4.05135{col 37}{space 1}   -0.30{col 46}{space 3}0.762{col 54}{space 4}-9.275598{col 67}{space 3} 6.816929
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-66.21706{col 26}{space 2}  72.7621{col 37}{space 1}   -0.91{col 46}{space 3}0.365{col 54}{space 4}-210.7289{col 67}{space 3}  78.2948
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0548885{col 26}{space 2} .0502059{col 37}{space 1}    1.09{col 46}{space 3}0.277{col 54}{space 4}-.0448251{col 67}{space 3}  .154602
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 9.281601{col 26}{space 2} 5.092812{col 37}{space 1}    1.82{col 46}{space 3}0.072{col 54}{space 4}-.8332463{col 67}{space 3} 19.39645
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} .3906547{col 26}{space 2} 3.109355{col 37}{space 1}    0.13{col 46}{space 3}0.900{col 54}{space 4}-5.796249{col 67}{space 3} 6.577559
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 132.9192{col 26}{space 2} 127.2712{col 37}{space 1}    1.04{col 46}{space 3}0.299{col 54}{space 4}-119.8522{col 67}{space 3} 385.6905
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-.1122544{col 26}{space 2}  14.9252{col 37}{space 1}   -0.01{col 46}{space 3}0.994{col 54}{space 4}-29.76895{col 67}{space 3} 29.54444
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0020189{col 26}{space 2} .0002941{col 37}{space 1}    6.87{col 46}{space 3}0.000{col 54}{space 4} .0014349{col 67}{space 3}  .002603
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 543.0906{col 26}{space 2} 786.4413{col 37}{space 1}    0.69{col 46}{space 3}0.492{col 54}{space 4}-1018.845{col 67}{space 3} 2105.026
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0049
{txt}{col 49}Largest FMI{col 67}= {res}    0.0338
{txt}{col 49}Complete DF{col 67}= {res}        94
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     87.08
{txt}{col 49}        avg{col 67}= {res}     91.44
{txt}{col 49}        max{col 67}= {res}     92.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   92.0{txt}){col 67}= {res}     10.33
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-141.1878{col 26}{space 2} 69.66594{col 37}{space 1}   -2.03{col 46}{space 3}0.046{col 54}{space 4}-279.5493{col 67}{space 3} -2.82631
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-217.3228{col 26}{space 2} 89.76258{col 37}{space 1}   -2.42{col 46}{space 3}0.017{col 54}{space 4}-395.5977{col 67}{space 3}-39.04781
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.980728{col 26}{space 2}  4.19143{col 37}{space 1}    0.47{col 46}{space 3}0.638{col 54}{space 4}-6.343751{col 67}{space 3} 10.30521
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-36.27053{col 26}{space 2} 75.26017{col 37}{space 1}   -0.48{col 46}{space 3}0.631{col 54}{space 4}-185.7429{col 67}{space 3} 113.2019
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0921837{col 26}{space 2}  .051927{col 37}{space 1}    1.78{col 46}{space 3}0.079{col 54}{space 4}-.0109474{col 67}{space 3} .1953147
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 11.47704{col 26}{space 2} 5.267643{col 37}{space 1}    2.18{col 46}{space 3}0.032{col 54}{space 4} 1.015021{col 67}{space 3} 21.93906
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-1.149429{col 26}{space 2} 3.143011{col 37}{space 1}   -0.37{col 46}{space 3}0.715{col 54}{space 4}-7.393159{col 67}{space 3} 5.094301
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 71.98856{col 26}{space 2} 131.6586{col 37}{space 1}    0.55{col 46}{space 3}0.586{col 54}{space 4}-189.4959{col 67}{space 3}  333.473
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 8.169717{col 26}{space 2} 15.51305{col 37}{space 1}    0.53{col 46}{space 3}0.600{col 54}{space 4}-22.66374{col 67}{space 3} 39.00318
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0026248{col 26}{space 2} .0003042{col 37}{space 1}    8.63{col 46}{space 3}0.000{col 54}{space 4} .0020206{col 67}{space 3}  .003229
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 93.26609{col 26}{space 2} 813.5894{col 37}{space 1}    0.11{col 46}{space 3}0.909{col 54}{space 4}-1522.587{col 67}{space 3} 1709.119
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0023
{txt}{col 49}Largest FMI{col 67}= {res}    0.0235
{txt}{col 49}Complete DF{col 67}= {res}        94
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     89.01
{txt}{col 49}        avg{col 67}= {res}     91.77
{txt}{col 49}        max{col 67}= {res}     92.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   92.1{txt}){col 67}= {res}      0.66
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.7606

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .8706028{col 26}{space 2} .9544397{col 37}{space 1}    0.91{col 46}{space 3}0.364{col 54}{space 4}-1.024981{col 67}{space 3} 2.766187
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.4805308{col 26}{space 2} 1.229733{col 37}{space 1}   -0.39{col 46}{space 3}0.697{col 54}{space 4}-2.922866{col 67}{space 3} 1.961805
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0596163{col 26}{space 2} .0574236{col 37}{space 1}    1.04{col 46}{space 3}0.302{col 54}{space 4} -.054431{col 67}{space 3} .1736636
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.469983{col 26}{space 2} 1.031033{col 37}{space 1}    1.43{col 46}{space 3}0.157{col 54}{space 4}-.5777229{col 67}{space 3} 3.517689
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0002384{col 26}{space 2} .0007114{col 37}{space 1}   -0.34{col 46}{space 3}0.738{col 54}{space 4}-.0016514{col 67}{space 3} .0011745
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0518579{col 26}{space 2} .0721581{col 37}{space 1}    0.72{col 46}{space 3}0.474{col 54}{space 4} -.091454{col 67}{space 3} .1951698
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-.0013069{col 26}{space 2} .0432555{col 37}{space 1}   -0.03{col 46}{space 3}0.976{col 54}{space 4}-.0872545{col 67}{space 3} .0846408
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 1.926225{col 26}{space 2} 1.803581{col 37}{space 1}    1.07{col 46}{space 3}0.288{col 54}{space 4}-1.655819{col 67}{space 3} 5.508269
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} .1096627{col 26}{space 2} .2091176{col 37}{space 1}    0.52{col 46}{space 3}0.601{col 54}{space 4}-.3056608{col 67}{space 3} .5249862
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.17e-06{col 26}{space 2} 4.17e-06{col 37}{space 1}    0.76{col 46}{space 3}0.449{col 54}{space 4}-5.11e-06{col 67}{space 3} .0000114
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-14.77016{col 26}{space 2} 11.14552{col 37}{space 1}   -1.33{col 46}{space 3}0.188{col 54}{space 4}-36.90598{col 67}{space 3}  7.36565
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. **********INTERACTION by Race***************
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0231
{txt}{col 49}Largest FMI{col 67}= {res}    0.2181
{txt}{col 49}Complete DF{col 67}= {res}       166
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     56.57
{txt}{col 49}        avg{col 67}= {res}    154.88
{txt}{col 49}        max{col 67}= {res}    163.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  163.6{txt}){col 67}= {res}     12.86
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-153.7294{col 28}{space 2} 59.76309{col 39}{space 1}   -2.57{col 48}{space 3}0.011{col 56}{space 4}-271.7338{col 69}{space 3}-35.72499
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-214.1365{col 28}{space 2} 177.3229{col 39}{space 1}   -1.21{col 48}{space 3}0.229{col 56}{space 4}-564.2883{col 69}{space 3} 136.0153
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 52.52135{col 28}{space 2} 76.67012{col 39}{space 1}    0.69{col 48}{space 3}0.494{col 56}{space 4} -98.8668{col 69}{space 3} 203.9095
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-32.35467{col 28}{space 2} 60.66143{col 39}{space 1}   -0.53{col 48}{space 3}0.595{col 56}{space 4}-152.1331{col 69}{space 3} 87.42372
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-3.033032{col 28}{space 2} 2.781404{col 39}{space 1}   -1.09{col 48}{space 3}0.277{col 56}{space 4}-8.525046{col 69}{space 3} 2.458981
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-133.7299{col 28}{space 2} 51.61973{col 39}{space 1}   -2.59{col 48}{space 3}0.010{col 56}{space 4}-235.6573{col 69}{space 3} -31.8025
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0374342{col 28}{space 2} .0380844{col 39}{space 1}    0.98{col 48}{space 3}0.327{col 56}{space 4}-.0377689{col 69}{space 3} .1126372
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 3.416133{col 28}{space 2} 3.589891{col 39}{space 1}    0.95{col 48}{space 3}0.343{col 56}{space 4}-3.672438{col 69}{space 3}  10.5047
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} .1028411{col 28}{space 2} 2.728381{col 39}{space 1}    0.04{col 48}{space 3}0.970{col 56}{space 4}-5.361557{col 69}{space 3} 5.567239
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 155.5064{col 28}{space 2} 87.28549{col 39}{space 1}    1.78{col 48}{space 3}0.077{col 56}{space 4}-16.84238{col 69}{space 3} 327.8551
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-.6846338{col 28}{space 2} 11.31774{col 39}{space 1}   -0.06{col 48}{space 3}0.952{col 56}{space 4}-23.03888{col 69}{space 3} 21.66961
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0016852{col 28}{space 2} .0002187{col 39}{space 1}    7.70{col 48}{space 3}0.000{col 56}{space 4} .0012533{col 69}{space 3} .0021172
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1181.218{col 28}{space 2} 545.2828{col 39}{space 1}    2.17{col 48}{space 3}0.032{col 56}{space 4} 104.5226{col 69}{space 3} 2257.914
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0096
{txt}{col 49}Largest FMI{col 67}= {res}    0.0730
{txt}{col 49}Complete DF{col 67}= {res}       166
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    128.67
{txt}{col 49}        avg{col 67}= {res}    160.29
{txt}{col 49}        max{col 67}= {res}    164.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  163.9{txt}){col 67}= {res}     14.31
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-123.2444{col 28}{space 2} 62.57566{col 39}{space 1}   -1.97{col 48}{space 3}0.051{col 56}{space 4} -246.803{col 69}{space 3} .3141101
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-224.6643{col 28}{space 2} 185.2776{col 39}{space 1}   -1.21{col 48}{space 3}0.227{col 56}{space 4}-590.5103{col 69}{space 3} 141.1817
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 50.00832{col 28}{space 2} 80.26276{col 39}{space 1}    0.62{col 48}{space 3}0.534{col 56}{space 4} -108.474{col 69}{space 3} 208.4906
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} -108.693{col 28}{space 2} 63.50036{col 39}{space 1}   -1.71{col 48}{space 3}0.089{col 56}{space 4}-234.0771{col 69}{space 3}  16.6911
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1.716025{col 28}{space 2} 2.913163{col 39}{space 1}   -0.59{col 48}{space 3}0.557{col 56}{space 4}-7.468262{col 69}{space 3} 4.036212
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-112.4272{col 28}{space 2} 54.00084{col 39}{space 1}   -2.08{col 48}{space 3}0.039{col 56}{space 4}-219.0552{col 69}{space 3}-5.799204
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0604448{col 28}{space 2} .0397866{col 39}{space 1}    1.52{col 48}{space 3}0.131{col 56}{space 4}-.0181165{col 69}{space 3}  .139006
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2.925458{col 28}{space 2} 3.752418{col 39}{space 1}    0.78{col 48}{space 3}0.437{col 56}{space 4}-4.483856{col 69}{space 3} 10.33477
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2}-2.181215{col 28}{space 2} 2.647481{col 39}{space 1}   -0.82{col 48}{space 3}0.412{col 56}{space 4}-7.419448{col 69}{space 3} 3.057019
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 101.7301{col 28}{space 2} 91.33737{col 39}{space 1}    1.11{col 48}{space 3}0.267{col 56}{space 4}-78.61844{col 69}{space 3} 282.0787
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} 4.095341{col 28}{space 2} 11.90118{col 39}{space 1}    0.34{col 48}{space 3}0.731{col 56}{space 4}-19.41631{col 69}{space 3}   27.607
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021233{col 28}{space 2} .0002289{col 39}{space 1}    9.27{col 48}{space 3}0.000{col 56}{space 4} .0016712{col 69}{space 3} .0025753
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1084.153{col 28}{space 2} 570.3178{col 39}{space 1}    1.90{col 48}{space 3}0.059{col 56}{space 4}-41.96118{col 69}{space 3} 2210.268
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0040
{txt}{col 49}Largest FMI{col 67}= {res}    0.0448
{txt}{col 49}Complete DF{col 67}= {res}       166
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    146.18
{txt}{col 49}        avg{col 67}= {res}    162.58
{txt}{col 49}        max{col 67}= {res}    164.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  164.0{txt}){col 67}= {res}      0.96
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.4874

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} .7040864{col 28}{space 2}  .803774{col 39}{space 1}    0.88{col 48}{space 3}0.382{col 56}{space 4}-.8829942{col 69}{space 3} 2.291167
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}  2.18942{col 28}{space 2} 2.378809{col 39}{space 1}    0.92{col 48}{space 3}0.359{col 56}{space 4}-2.507671{col 69}{space 3}  6.88651
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.4276578{col 28}{space 2} 1.031023{col 39}{space 1}   -0.41{col 48}{space 3}0.679{col 56}{space 4}-2.463448{col 69}{space 3} 1.608132
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .2531934{col 28}{space 2} .8157277{col 39}{space 1}    0.31{col 48}{space 3}0.757{col 56}{space 4}-1.357489{col 69}{space 3} 1.863876
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0645088{col 28}{space 2}  .037399{col 39}{space 1}    1.72{col 48}{space 3}0.086{col 56}{space 4}-.0093369{col 69}{space 3} .1383546
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .7398965{col 28}{space 2} .6933544{col 39}{space 1}    1.07{col 48}{space 3}0.287{col 56}{space 4}-.6291584{col 69}{space 3} 2.108951
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0005419{col 28}{space 2} .0005108{col 39}{space 1}   -1.06{col 48}{space 3}0.290{col 56}{space 4}-.0015506{col 69}{space 3} .0004667
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0336212{col 28}{space 2} .0482297{col 39}{space 1}    0.70{col 48}{space 3}0.487{col 56}{space 4}-.0616109{col 69}{space 3} .1288534
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} .0127873{col 28}{space 2} .0335449{col 39}{space 1}    0.38{col 48}{space 3}0.704{col 56}{space 4}-.0535084{col 69}{space 3} .0790831
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} .5315905{col 28}{space 2} 1.173692{col 39}{space 1}    0.45{col 48}{space 3}0.651{col 56}{space 4}-1.785904{col 69}{space 3} 2.849085
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} .1168167{col 28}{space 2} .1505849{col 39}{space 1}    0.78{col 48}{space 3}0.439{col 56}{space 4}-.1805194{col 69}{space 3} .4141527
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.11e-06{col 28}{space 2} 2.94e-06{col 39}{space 1}    0.72{col 48}{space 3}0.475{col 56}{space 4}-3.70e-06{col 69}{space 3} 7.91e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-6.516711{col 28}{space 2} 7.327796{col 39}{space 1}   -0.89{col 48}{space 3}0.375{col 56}{space 4}-20.98572{col 69}{space 3} 7.952299
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. ***********MODEL 6: MODEL 2+lifestyle/health-related factors*******  
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0104
{txt}{col 49}Largest FMI{col 67}= {res}    0.0494
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     57.40
{txt}{col 49}        avg{col 67}= {res}     61.31
{txt}{col 49}        max{col 67}= {res}     62.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   62.0{txt}){col 67}= {res}      6.56
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-104.2676{col 26}{space 2}  52.7806{col 37}{space 1}   -1.98{col 46}{space 3}0.053{col 54}{space 4}-209.7775{col 67}{space 3} 1.242393
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 66.18522{col 26}{space 2} 81.10168{col 37}{space 1}    0.82{col 46}{space 3}0.418{col 54}{space 4}-95.93255{col 67}{space 3}  228.303
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-4.799761{col 26}{space 2} 3.829827{col 37}{space 1}   -1.25{col 46}{space 3}0.215{col 54}{space 4}-12.45607{col 67}{space 3} 2.856551
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-212.6881{col 26}{space 2} 73.30654{col 37}{space 1}   -2.90{col 46}{space 3}0.005{col 54}{space 4}-359.2371{col 67}{space 3} -66.1391
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0275259{col 26}{space 2} .0580426{col 37}{space 1}    0.47{col 46}{space 3}0.637{col 54}{space 4}-.0885352{col 67}{space 3}  .143587
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-5.524984{col 26}{space 2} 5.002617{col 37}{space 1}   -1.10{col 46}{space 3}0.274{col 54}{space 4}-15.52624{col 67}{space 3} 4.476273
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-142.6411{col 26}{space 2} 69.15877{col 37}{space 1}   -2.06{col 46}{space 3}0.044{col 54}{space 4}-281.1081{col 67}{space 3}-4.174109
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-40.31973{col 26}{space 2} 39.27379{col 37}{space 1}   -1.03{col 46}{space 3}0.309{col 54}{space 4}-118.8376{col 67}{space 3} 38.19819
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0013644{col 26}{space 2} .0003305{col 37}{space 1}    4.13{col 46}{space 3}0.000{col 54}{space 4} .0007037{col 67}{space 3} .0020251
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  2515.74{col 26}{space 2} 427.7788{col 37}{space 1}    5.88{col 46}{space 3}0.000{col 54}{space 4} 1660.636{col 67}{space 3} 3370.845
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0092
{txt}{col 49}Largest FMI{col 67}= {res}    0.0392
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     58.64
{txt}{col 49}        avg{col 67}= {res}     61.45
{txt}{col 49}        max{col 67}= {res}     62.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   62.0{txt}){col 67}= {res}      6.65
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-78.47796{col 26}{space 2} 52.29916{col 37}{space 1}   -1.50{col 46}{space 3}0.139{col 54}{space 4}-183.0252{col 67}{space 3} 26.06929
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 36.75969{col 26}{space 2} 80.36799{col 37}{space 1}    0.46{col 46}{space 3}0.649{col 54}{space 4}-123.8915{col 67}{space 3} 197.4109
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-5.052937{col 26}{space 2} 3.794515{col 37}{space 1}   -1.33{col 46}{space 3}0.188{col 54}{space 4} -12.6386{col 67}{space 3} 2.532723
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-191.1671{col 26}{space 2} 72.61059{col 37}{space 1}   -2.63{col 46}{space 3}0.011{col 54}{space 4}-336.3219{col 67}{space 3} -46.0124
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0494085{col 26}{space 2} .0575316{col 37}{space 1}    0.86{col 46}{space 3}0.394{col 54}{space 4}-.0656325{col 67}{space 3} .1644496
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-7.487438{col 26}{space 2} 4.953155{col 37}{space 1}   -1.51{col 46}{space 3}0.136{col 54}{space 4}-17.38941{col 67}{space 3} 2.414539
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-136.5243{col 26}{space 2} 68.19015{col 37}{space 1}   -2.00{col 46}{space 3}0.050{col 54}{space 4}-272.9898{col 67}{space 3}-.0588054
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-21.28619{col 26}{space 2} 38.91926{col 37}{space 1}   -0.55{col 46}{space 3}0.586{col 54}{space 4}-99.09543{col 67}{space 3} 56.52305
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0015128{col 26}{space 2} .0003275{col 37}{space 1}    4.62{col 46}{space 3}0.000{col 54}{space 4} .0008582{col 67}{space 3} .0021674
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2533.941{col 26}{space 2} 423.8626{col 37}{space 1}    5.98{col 46}{space 3}0.000{col 54}{space 4} 1686.668{col 67}{space 3} 3381.213
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0025
{txt}{col 49}Largest FMI{col 67}= {res}    0.0119
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     61.33
{txt}{col 49}        avg{col 67}= {res}     61.95
{txt}{col 49}        max{col 67}= {res}     62.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   62.1{txt}){col 67}= {res}      1.73
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1004

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .1736594{col 26}{space 2}  .641344{col 37}{space 1}    0.27{col 46}{space 3}0.787{col 54}{space 4}-1.108352{col 67}{space 3}  1.45567
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .8314792{col 26}{space 2} .9861788{col 37}{space 1}    0.84{col 46}{space 3}0.402{col 54}{space 4}-1.139814{col 67}{space 3} 2.802772
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0716963{col 26}{space 2} .0464945{col 37}{space 1}    1.54{col 46}{space 3}0.128{col 54}{space 4}-.0212444{col 67}{space 3} .1646371
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.0463916{col 26}{space 2} .8897053{col 37}{space 1}   -0.05{col 46}{space 3}0.959{col 54}{space 4}-1.824855{col 67}{space 3} 1.732072
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0010606{col 26}{space 2} .0007025{col 37}{space 1}   -1.51{col 46}{space 3}0.136{col 54}{space 4} -.002465{col 67}{space 3} .0003437
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0500645{col 26}{space 2} .0606797{col 37}{space 1}    0.83{col 46}{space 3}0.412{col 54}{space 4}-.0712316{col 67}{space 3} .1713605
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} .8599327{col 26}{space 2} .8259846{col 37}{space 1}    1.04{col 46}{space 3}0.302{col 54}{space 4}-.7915481{col 67}{space 3} 2.511413
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-.8061611{col 26}{space 2} .4762904{col 37}{space 1}   -1.69{col 46}{space 3}0.096{col 54}{space 4}-1.758253{col 67}{space 3}  .145931
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.58e-06{col 26}{space 2} 4.01e-06{col 37}{space 1}    0.89{col 46}{space 3}0.376{col 54}{space 4}-4.45e-06{col 67}{space 3} .0000116
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -1.17858{col 26}{space 2} 5.201916{col 37}{space 1}   -0.23{col 46}{space 3}0.822{col 54}{space 4}-11.57679{col 67}{space 3} 9.219633
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0039
{txt}{col 49}Largest FMI{col 67}= {res}    0.0229
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     90.05
{txt}{col 49}        avg{col 67}= {res}     92.59
{txt}{col 49}        max{col 67}= {res}     93.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.0{txt}){col 67}= {res}      9.12
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-157.5429{col 26}{space 2} 67.13519{col 37}{space 1}   -2.35{col 46}{space 3}0.021{col 54}{space 4}-290.8614{col 67}{space 3}-24.22443
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-66.21608{col 26}{space 2} 85.00258{col 37}{space 1}   -0.78{col 46}{space 3}0.438{col 54}{space 4}-235.0193{col 67}{space 3} 102.5872
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.338338{col 26}{space 2} 4.040472{col 37}{space 1}   -0.33{col 46}{space 3}0.741{col 54}{space 4}-9.361884{col 67}{space 3} 6.685209
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-56.75501{col 26}{space 2} 74.85348{col 37}{space 1}   -0.76{col 46}{space 3}0.450{col 54}{space 4}-205.4028{col 67}{space 3} 91.89277
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}  .038831{col 26}{space 2} .0504353{col 37}{space 1}    0.77{col 46}{space 3}0.443{col 54}{space 4}-.0613351{col 67}{space 3} .1389971
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 8.292882{col 26}{space 2}  4.87312{col 37}{space 1}    1.70{col 46}{space 3}0.092{col 54}{space 4}-1.384201{col 67}{space 3} 17.96997
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 73.31905{col 26}{space 2} 91.07356{col 37}{space 1}    0.81{col 46}{space 3}0.423{col 54}{space 4}-107.6132{col 67}{space 3} 254.2513
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}  .023143{col 26}{space 2} 41.78233{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-82.94806{col 67}{space 3} 82.99434
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019989{col 26}{space 2} .0002928{col 37}{space 1}    6.83{col 46}{space 3}0.000{col 54}{space 4} .0014174{col 67}{space 3} .0025803
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1148.881{col 26}{space 2} 473.9316{col 37}{space 1}    2.42{col 46}{space 3}0.017{col 54}{space 4} 207.7511{col 67}{space 3} 2090.011
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0030
{txt}{col 49}Largest FMI{col 67}= {res}    0.0244
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     89.79
{txt}{col 49}        avg{col 67}= {res}     92.66
{txt}{col 49}        max{col 67}= {res}     93.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.0{txt}){col 67}= {res}     11.54
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-143.9577{col 26}{space 2} 69.35341{col 37}{space 1}   -2.08{col 46}{space 3}0.041{col 54}{space 4}-281.6792{col 67}{space 3} -6.23607
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-197.2471{col 26}{space 2} 87.77397{col 37}{space 1}   -2.25{col 46}{space 3}0.027{col 54}{space 4}-371.5493{col 67}{space 3} -22.9449
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.907259{col 26}{space 2} 4.175725{col 37}{space 1}    0.46{col 46}{space 3}0.649{col 54}{space 4}-6.384856{col 67}{space 3} 10.19937
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-35.66244{col 26}{space 2} 77.32696{col 37}{space 1}   -0.46{col 46}{space 3}0.646{col 54}{space 4}  -189.22{col 67}{space 3} 117.8951
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0926752{col 26}{space 2} .0519999{col 37}{space 1}    1.78{col 46}{space 3}0.078{col 54}{space 4}  -.01059{col 67}{space 3} .1959404
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 10.73205{col 26}{space 2} 5.036857{col 37}{space 1}    2.13{col 46}{space 3}0.036{col 54}{space 4} .7298119{col 67}{space 3}  20.7343
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 35.30985{col 26}{space 2} 94.19606{col 37}{space 1}    0.37{col 46}{space 3}0.709{col 54}{space 4} -151.833{col 67}{space 3} 222.4527
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-22.63068{col 26}{space 2} 43.17695{col 37}{space 1}   -0.52{col 46}{space 3}0.601{col 54}{space 4}-108.3709{col 67}{space 3} 63.10955
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0026135{col 26}{space 2} .0003026{col 37}{space 1}    8.64{col 46}{space 3}0.000{col 54}{space 4} .0020126{col 67}{space 3} .0032143
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 462.2879{col 26}{space 2} 489.9661{col 37}{space 1}    0.94{col 46}{space 3}0.348{col 54}{space 4}-510.6901{col 67}{space 3} 1435.266
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0119
{txt}{col 49}Largest FMI{col 67}= {res}    0.0947
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     72.57
{txt}{col 49}        avg{col 67}= {res}     90.85
{txt}{col 49}        max{col 67}= {res}     93.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.0{txt}){col 67}= {res}      0.66
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.7384

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .8384743{col 26}{space 2} .9513989{col 37}{space 1}    0.88{col 46}{space 3}0.380{col 54}{space 4}-1.050818{col 67}{space 3} 2.727767
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} -.293337{col 26}{space 2} 1.206075{col 37}{space 1}   -0.24{col 46}{space 3}0.808{col 54}{space 4}-2.688501{col 67}{space 3} 2.101827
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0483808{col 26}{space 2} .0573173{col 37}{space 1}    0.84{col 46}{space 3}0.401{col 54}{space 4}-.0654418{col 67}{space 3} .1622034
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.333167{col 26}{space 2} 1.059901{col 37}{space 1}    1.26{col 46}{space 3}0.212{col 54}{space 4}-.7715696{col 67}{space 3} 3.437904
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0002847{col 26}{space 2} .0007129{col 37}{space 1}   -0.40{col 46}{space 3}0.691{col 54}{space 4}-.0017005{col 67}{space 3} .0011311
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0125266{col 26}{space 2} .0691227{col 37}{space 1}    0.18{col 46}{space 3}0.857{col 54}{space 4}-.1247403{col 67}{space 3} .1497935
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-1.011189{col 26}{space 2} 1.337649{col 37}{space 1}   -0.76{col 46}{space 3}0.452{col 54}{space 4}-3.677385{col 67}{space 3} 1.655006
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-.2763866{col 26}{space 2} .5924467{col 37}{space 1}   -0.47{col 46}{space 3}0.642{col 54}{space 4}-1.452874{col 67}{space 3} .9001003
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.80e-06{col 26}{space 2} 4.15e-06{col 37}{space 1}    0.68{col 46}{space 3}0.501{col 54}{space 4}-5.44e-06{col 67}{space 3}  .000011
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -3.04855{col 26}{space 2} 6.729484{col 37}{space 1}   -0.45{col 46}{space 3}0.652{col 54}{space 4}-16.41255{col 67}{space 3} 10.31545
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. ******************INTERACTION by Race***********************
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0024
{txt}{col 49}Largest FMI{col 67}= {res}    0.0229
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    158.20
{txt}{col 49}        avg{col 67}= {res}    164.40
{txt}{col 49}        max{col 67}= {res}    165.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  165.0{txt}){col 67}= {res}     13.98
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-154.4432{col 28}{space 2} 59.96591{col 39}{space 1}   -2.58{col 48}{space 3}0.011{col 56}{space 4}-272.8425{col 69}{space 3}-36.04383
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-227.3718{col 28}{space 2} 174.4517{col 39}{space 1}   -1.30{col 48}{space 3}0.194{col 56}{space 4}-571.8171{col 69}{space 3} 117.0735
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 57.98736{col 28}{space 2} 76.97151{col 39}{space 1}    0.75{col 48}{space 3}0.452{col 56}{space 4}-93.98862{col 69}{space 3} 209.9633
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-16.23263{col 28}{space 2} 59.66032{col 39}{space 1}   -0.27{col 48}{space 3}0.786{col 56}{space 4}-134.0287{col 69}{space 3} 101.5634
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -3.60028{col 28}{space 2} 2.777788{col 39}{space 1}   -1.30{col 48}{space 3}0.197{col 56}{space 4}-9.084877{col 69}{space 3} 1.884317
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-140.6944{col 28}{space 2}  52.3753{col 39}{space 1}   -2.69{col 48}{space 3}0.008{col 56}{space 4}-244.1065{col 69}{space 3} -37.2822
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}  .030428{col 28}{space 2} .0375742{col 39}{space 1}    0.81{col 48}{space 3}0.419{col 56}{space 4}-.0437607{col 69}{space 3} .1046166
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1.432006{col 28}{space 2}   3.4821{col 39}{space 1}    0.41{col 48}{space 3}0.681{col 56}{space 4} -5.44325{col 69}{space 3} 8.307263
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-35.52133{col 28}{space 2} 56.62998{col 39}{space 1}   -0.63{col 48}{space 3}0.531{col 56}{space 4}-147.3696{col 69}{space 3} 76.32698
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-22.48158{col 28}{space 2} 28.71336{col 39}{space 1}   -0.78{col 48}{space 3}0.435{col 56}{space 4}-79.17465{col 69}{space 3} 34.21148
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0016895{col 28}{space 2} .0002201{col 39}{space 1}    7.68{col 48}{space 3}0.000{col 56}{space 4} .0012549{col 69}{space 3} .0021242
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1994.892{col 28}{space 2} 336.8131{col 39}{space 1}    5.92{col 48}{space 3}0.000{col 56}{space 4} 1329.869{col 69}{space 3} 2659.915
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0038
{txt}{col 49}Largest FMI{col 67}= {res}    0.0355
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    152.16
{txt}{col 49}        avg{col 67}= {res}    163.87
{txt}{col 49}        max{col 67}= {res}    165.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  165.0{txt}){col 67}= {res}     15.74
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-126.6761{col 28}{space 2} 62.39146{col 39}{space 1}   -2.03{col 48}{space 3}0.044{col 56}{space 4}-249.8647{col 69}{space 3}-3.487593
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-210.2101{col 28}{space 2} 181.5183{col 39}{space 1}   -1.16{col 48}{space 3}0.249{col 56}{space 4}-568.6087{col 69}{space 3} 148.1885
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 52.83383{col 28}{space 2} 80.08301{col 39}{space 1}    0.66{col 48}{space 3}0.510{col 56}{space 4}-105.2857{col 69}{space 3} 210.9533
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-95.50187{col 28}{space 2} 62.08348{col 39}{space 1}   -1.54{col 48}{space 3}0.126{col 56}{space 4}-218.0827{col 69}{space 3} 27.07893
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2.362485{col 28}{space 2} 2.890044{col 39}{space 1}   -0.82{col 48}{space 3}0.415{col 56}{space 4}-8.068725{col 69}{space 3} 3.343755
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-118.4607{col 28}{space 2} 54.48985{col 39}{space 1}   -2.17{col 48}{space 3}0.031{col 56}{space 4}-226.0478{col 69}{space 3}-10.87349
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0645637{col 28}{space 2} .0391103{col 39}{space 1}    1.65{col 48}{space 3}0.101{col 56}{space 4}-.0126583{col 69}{space 3} .1417858
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1.718411{col 28}{space 2} 3.622652{col 39}{space 1}    0.47{col 48}{space 3}0.636{col 56}{space 4}-5.434355{col 69}{space 3} 8.871177
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2} -49.5227{col 28}{space 2} 59.28927{col 39}{space 1}   -0.84{col 48}{space 3}0.405{col 56}{space 4}-166.6592{col 69}{space 3} 67.61379
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-29.96362{col 28}{space 2} 29.88442{col 39}{space 1}   -1.00{col 48}{space 3}0.317{col 56}{space 4}-88.96923{col 69}{space 3} 29.04199
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021225{col 28}{space 2}  .000229{col 39}{space 1}    9.27{col 48}{space 3}0.000{col 56}{space 4} .0016703{col 69}{space 3} .0025746
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1611.421{col 28}{space 2} 350.4185{col 39}{space 1}    4.60{col 48}{space 3}0.000{col 56}{space 4} 919.5351{col 69}{space 3} 2303.307
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0052
{txt}{col 49}Largest FMI{col 67}= {res}    0.0553
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    140.71
{txt}{col 49}        avg{col 67}= {res}    162.89
{txt}{col 49}        max{col 67}= {res}    165.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  165.0{txt}){col 67}= {res}      1.13
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.3392

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} .7040204{col 28}{space 2} .7988592{col 39}{space 1}    0.88{col 48}{space 3}0.379{col 56}{space 4}-.8732829{col 69}{space 3} 2.281324
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.957529{col 28}{space 2}  2.32393{col 39}{space 1}    0.84{col 48}{space 3}0.401{col 56}{space 4}-2.630942{col 69}{space 3} 6.545999
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.4288393{col 28}{space 2} 1.025505{col 39}{space 1}   -0.42{col 48}{space 3}0.676{col 56}{space 4}-2.453645{col 69}{space 3} 1.595966
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .3843013{col 28}{space 2} .7947526{col 39}{space 1}    0.48{col 48}{space 3}0.629{col 56}{space 4}-1.184893{col 69}{space 3} 1.953496
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0649802{col 28}{space 2} .0370095{col 39}{space 1}    1.76{col 48}{space 3}0.081{col 56}{space 4}-.0080932{col 69}{space 3} .1380537
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .6312987{col 28}{space 2}  .698168{col 39}{space 1}    0.90{col 48}{space 3}0.367{col 56}{space 4}-.7472096{col 69}{space 3} 2.009807
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0005501{col 28}{space 2} .0005007{col 39}{space 1}   -1.10{col 48}{space 3}0.273{col 56}{space 4}-.0015387{col 69}{space 3} .0004385
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}  .024784{col 28}{space 2} .0464148{col 39}{space 1}    0.53{col 48}{space 3}0.594{col 56}{space 4} -.066861{col 69}{space 3}  .116429
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2} .1919263{col 28}{space 2} .7666495{col 39}{space 1}    0.25{col 48}{space 3}0.803{col 56}{space 4}-1.323715{col 69}{space 3} 1.707567
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-.4907266{col 28}{space 2} .3824306{col 39}{space 1}   -1.28{col 48}{space 3}0.201{col 56}{space 4}-1.245814{col 69}{space 3} .2643606
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.49e-06{col 28}{space 2} 2.93e-06{col 39}{space 1}    0.85{col 48}{space 3}0.397{col 56}{space 4}-3.30e-06{col 69}{space 3} 8.28e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-2.779208{col 28}{space 2} 4.488362{col 39}{space 1}   -0.62{col 48}{space 3}0.537{col 56}{space 4}-11.64133{col 69}{space 3} 6.082914
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
.   
. 
. capture log close
{smcl}
{com}{sf}{ul off}