{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. /////////////////////////////////////////////////TABLE S6: TOTAL AND GM/WM VOLUMES VS. NFL exposures by Race***********************
> ////////////////////////////////////////LnNFLw1 EXPOSURE/////////////////////////////////////////////
> 
. 
. ***********************LnNFLw1, MODELS 1 AND 2*********************
. 
. *********************AFRICAN-AMERICAN*******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        81
{txt}{hline 13}{c +}{hline 34}   F(5, 75)        = {res}     9.67
{txt}       Model {c |} {res} 3.8757e+11         5  7.7514e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 6.0115e+11        75  8.0153e+09   {txt}R-squared       ={res}    0.3920
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3515
{txt}       Total {c |} {res} 9.8872e+11        80  1.2359e+10   {txt}Root MSE        =   {res}  89528

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-39141.13{col 26}{space 2} 22333.57{col 37}{space 1}   -1.75{col 46}{space 3}0.084{col 67}{space 3}-.1867362
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}   122553{col 26}{space 2} 20175.82{col 37}{space 1}    6.07{col 46}{space 3}0.000{col 67}{space 3} .5535672
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1292.744{col 26}{space 2} 1325.605{col 37}{space 1}   -0.98{col 46}{space 3}0.333{col 67}{space 3}-.1134078
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 27663.09{col 26}{space 2} 24606.42{col 37}{space 1}    1.12{col 46}{space 3}0.265{col 67}{space 3} .1230265
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -34.6463{col 26}{space 2} 18.67149{col 37}{space 1}   -1.86{col 46}{space 3}0.067{col 67}{space 3}-.1842449
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1093615{col 26}{space 2} 80417.88{col 37}{space 1}   13.60{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        81
{txt}{hline 13}{c +}{hline 34}   F(5, 75)        = {res}     9.81
{txt}       Model {c |} {res} 1.2807e+11         5  2.5615e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.9587e+11        75  2.6115e+09   {txt}R-squared       ={res}    0.3954
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3551
{txt}       Total {c |} {res} 3.2394e+11        80  4.0492e+09   {txt}Root MSE        =   {res}  51103

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-23036.52{col 26}{space 2} 12748.11{col 37}{space 1}   -1.81{col 46}{space 3}0.075{col 67}{space 3}-.1920073
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 61484.77{col 26}{space 2} 11516.45{col 37}{space 1}    5.34{col 46}{space 3}0.000{col 67}{space 3} .4851989
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1453.311{col 26}{space 2} 756.6615{col 37}{space 1}   -1.92{col 46}{space 3}0.059{col 67}{space 3}-.2227382
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 15430.21{col 26}{space 2} 14045.46{col 37}{space 1}    1.10{col 46}{space 3}0.275{col 67}{space 3}  .119888
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-20.51024{col 26}{space 2} 10.65778{col 37}{space 1}   -1.92{col 46}{space 3}0.058{col 67}{space 3}-.1905528
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 658615.8{col 26}{space 2} 45902.91{col 37}{space 1}   14.35{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        81
{txt}{hline 13}{c +}{hline 34}   F(5, 75)        = {res}     6.79
{txt}       Model {c |} {res} 5.8520e+10         5  1.1704e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.2927e+11        75  1.7236e+09   {txt}R-squared       ={res}    0.3116
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2657
{txt}       Total {c |} {res} 1.8779e+11        80  2.3473e+09   {txt}Root MSE        =   {res}  41516

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-14877.81{col 26}{space 2} 10356.46{col 37}{space 1}   -1.44{col 46}{space 3}0.155{col 67}{space 3}-.1628688
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  49266.2{col 26}{space 2} 9355.872{col 37}{space 1}    5.27{col 46}{space 3}0.000{col 67}{space 3} .5106215
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-367.6784{col 26}{space 2} 614.7055{col 37}{space 1}   -0.60{col 46}{space 3}0.552{col 67}{space 3} -.074012
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 6267.034{col 26}{space 2} 11410.42{col 37}{space 1}    0.55{col 46}{space 3}0.584{col 67}{space 3} .0639534
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-12.84856{col 26}{space 2}  8.65829{col 37}{space 1}   -1.48{col 46}{space 3}0.142{col 67}{space 3}-.1567822
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 438369.4{col 26}{space 2} 37291.14{col 37}{space 1}   11.76{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        74
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     72.08
{txt}{col 49}        avg{col 67}= {res}     72.08
{txt}{col 49}        max{col 67}= {res}     72.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   72.1{txt}){col 67}= {res}      7.96
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-36856.98{col 26}{space 2} 25207.42{col 37}{space 1}   -1.46{col 46}{space 3}0.148{col 54}{space 4}-87106.13{col 67}{space 3} 13392.17
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 123301.6{col 26}{space 2} 20647.51{col 37}{space 1}    5.97{col 46}{space 3}0.000{col 54}{space 4} 82142.27{col 67}{space 3} 164460.9
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1419.221{col 26}{space 2} 1476.171{col 37}{space 1}   -0.96{col 46}{space 3}0.340{col 54}{space 4}-4361.859{col 67}{space 3} 1523.417
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}  26817.8{col 26}{space 2} 25122.72{col 37}{space 1}    1.07{col 46}{space 3}0.289{col 54}{space 4}-23262.51{col 67}{space 3}  76898.1
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-34.24583{col 26}{space 2} 18.89829{col 37}{space 1}   -1.81{col 46}{space 3}0.074{col 54}{space 4}-71.91819{col 67}{space 3}  3.42653
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 370.7865{col 26}{space 2} 1851.981{col 37}{space 1}    0.20{col 46}{space 3}0.842{col 54}{space 4}-3321.002{col 67}{space 3} 4062.575
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1083543{col 26}{space 2} 95296.62{col 37}{space 1}   11.37{col 46}{space 3}0.000{col 54}{space 4} 893576.5{col 67}{space 3}  1273510
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        74
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     72.08
{txt}{col 49}        avg{col 67}= {res}     72.08
{txt}{col 49}        max{col 67}= {res}     72.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   72.1{txt}){col 67}= {res}      8.10
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-20571.72{col 26}{space 2} 14378.48{col 37}{space 1}   -1.43{col 46}{space 3}0.157{col 54}{space 4}-49234.17{col 67}{space 3} 8090.737
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 62292.52{col 26}{space 2} 11777.48{col 37}{space 1}    5.29{col 46}{space 3}0.000{col 54}{space 4} 38814.98{col 67}{space 3} 85770.05
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1589.791{col 26}{space 2} 842.0177{col 37}{space 1}   -1.89{col 46}{space 3}0.063{col 54}{space 4}-3268.292{col 67}{space 3} 88.70947
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 14518.06{col 26}{space 2} 14330.17{col 37}{space 1}    1.01{col 46}{space 3}0.314{col 54}{space 4}-14048.08{col 67}{space 3} 43084.21
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -20.0781{col 26}{space 2} 10.77971{col 37}{space 1}   -1.86{col 46}{space 3}0.067{col 54}{space 4}-41.56667{col 67}{space 3} 1.410466
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 400.1116{col 26}{space 2} 1056.382{col 37}{space 1}    0.38{col 46}{space 3}0.706{col 54}{space 4}-1705.709{col 67}{space 3} 2505.932
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 647747.7{col 26}{space 2} 54357.83{col 37}{space 1}   11.92{col 46}{space 3}0.000{col 54}{space 4} 539389.4{col 67}{space 3} 756106.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        74
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     72.08
{txt}{col 49}        avg{col 67}= {res}     72.08
{txt}{col 49}        max{col 67}= {res}     72.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   72.1{txt}){col 67}= {res}      5.59
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-15362.94{col 26}{space 2} 11691.61{col 37}{space 1}   -1.31{col 46}{space 3}0.193{col 54}{space 4}-38669.32{col 67}{space 3} 7943.432
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 49107.21{col 26}{space 2} 9576.651{col 37}{space 1}    5.13{col 46}{space 3}0.000{col 54}{space 4} 30016.86{col 67}{space 3} 68197.57
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-340.8157{col 26}{space 2} 684.6721{col 37}{space 1}   -0.50{col 46}{space 3}0.620{col 54}{space 4}-1705.659{col 67}{space 3} 1024.028
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 6446.566{col 26}{space 2} 11652.33{col 37}{space 1}    0.55{col 46}{space 3}0.582{col 54}{space 4} -16781.5{col 67}{space 3} 29674.63
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-12.93361{col 26}{space 2} 8.765336{col 37}{space 1}   -1.48{col 46}{space 3}0.144{col 54}{space 4}-30.40667{col 67}{space 3} 4.539441
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-78.75185{col 26}{space 2} 858.9789{col 37}{space 1}   -0.09{col 46}{space 3}0.927{col 54}{space 4}-1791.063{col 67}{space 3}  1633.56
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 440508.5{col 26}{space 2} 44200.12{col 37}{space 1}    9.97{col 46}{space 3}0.000{col 54}{space 4} 352398.8{col 67}{space 3} 528618.2
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. *********************WHITES******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       119
{txt}{hline 13}{c +}{hline 34}   F(5, 113)       = {res}    20.85
{txt}       Model {c |} {res} 7.9246e+11         5  1.5849e+11   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 8.5905e+11       113  7.6022e+09   {txt}R-squared       ={res}    0.4798
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4568
{txt}       Total {c |} {res} 1.6515e+12       118  1.3996e+10   {txt}Root MSE        =   {res}  87191

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 27518.28{col 26}{space 2} 19194.41{col 37}{space 1}    1.43{col 46}{space 3}0.154{col 67}{space 3} .1167783
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 146890.3{col 26}{space 2} 16376.03{col 37}{space 1}    8.97{col 46}{space 3}0.000{col 67}{space 3} .6197101
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2625.562{col 26}{space 2} 1105.888{col 37}{space 1}   -2.37{col 46}{space 3}0.019{col 67}{space 3}-.1916081
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-18573.54{col 26}{space 2} 18800.95{col 37}{space 1}   -0.99{col 46}{space 3}0.325{col 67}{space 3}-.0705808
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-30.22576{col 26}{space 2} 12.71312{col 37}{space 1}   -2.38{col 46}{space 3}0.019{col 67}{space 3} -.168501
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1107771{col 26}{space 2} 64398.96{col 37}{space 1}   17.20{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       119
{txt}{hline 13}{c +}{hline 34}   F(5, 113)       = {res}    22.23
{txt}       Model {c |} {res} 2.3320e+11         5  4.6640e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.3712e+11       113  2.0984e+09   {txt}R-squared       ={res}    0.4958
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4735
{txt}       Total {c |} {res} 4.7032e+11       118  3.9858e+09   {txt}Root MSE        =   {res}  45809

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 7405.259{col 26}{space 2} 10084.47{col 37}{space 1}    0.73{col 46}{space 3}0.464{col 67}{space 3} .0588876
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 77679.74{col 26}{space 2} 8603.732{col 37}{space 1}    9.03{col 46}{space 3}0.000{col 67}{space 3} .6141104
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1982.058{col 26}{space 2} 581.0178{col 37}{space 1}   -3.41{col 46}{space 3}0.001{col 67}{space 3}-.2710511
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-12224.03{col 26}{space 2} 9877.745{col 37}{space 1}   -1.24{col 46}{space 3}0.218{col 67}{space 3}-.0870461
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-12.97177{col 26}{space 2}  6.67929{col 37}{space 1}   -1.94{col 46}{space 3}0.055{col 67}{space 3}-.1355088
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 668896.6{col 26}{space 2} 33834.28{col 37}{space 1}   19.77{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       119
{txt}{hline 13}{c +}{hline 34}   F(5, 113)       = {res}    14.39
{txt}       Model {c |} {res} 1.3894e+11         5  2.7788e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.1826e+11       113  1.9315e+09   {txt}R-squared       ={res}    0.3890
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3619
{txt}       Total {c |} {res} 3.5720e+11       118  3.0271e+09   {txt}Root MSE        =   {res}  43949

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 15367.19{col 26}{space 2} 9674.962{col 37}{space 1}    1.59{col 46}{space 3}0.115{col 67}{space 3} .1402241
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 59893.45{col 26}{space 2} 8254.355{col 37}{space 1}    7.26{col 46}{space 3}0.000{col 67}{space 3} .5433284
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-964.2825{col 26}{space 2} 557.4241{col 37}{space 1}   -1.73{col 46}{space 3}0.086{col 67}{space 3}-.1513155
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-8148.199{col 26}{space 2} 9476.634{col 37}{space 1}   -0.86{col 46}{space 3}0.392{col 67}{space 3}-.0665796
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.95473{col 26}{space 2}  6.40806{col 37}{space 1}   -2.49{col 46}{space 3}0.014{col 67}{space 3}-.1912503
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 433643.4{col 26}{space 2} 32460.36{col 37}{space 1}   13.36{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       112
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    110.05
{txt}{col 49}        avg{col 67}= {res}    110.05
{txt}{col 49}        max{col 67}= {res}    110.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}  110.1{txt}){col 67}= {res}     17.34
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 28715.38{col 26}{space 2} 19349.47{col 37}{space 1}    1.48{col 46}{space 3}0.141{col 54}{space 4}-9630.519{col 67}{space 3} 67061.28
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 148502.4{col 26}{space 2} 16636.13{col 37}{space 1}    8.93{col 46}{space 3}0.000{col 54}{space 4} 115533.7{col 67}{space 3} 181471.1
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2616.414{col 26}{space 2}   1109.1{col 37}{space 1}   -2.36{col 46}{space 3}0.020{col 54}{space 4}-4814.379{col 67}{space 3}-418.4496
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-18353.59{col 26}{space 2}  18857.3{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-55724.13{col 67}{space 3} 19016.95
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-29.24299{col 26}{space 2} 12.85158{col 37}{space 1}   -2.28{col 46}{space 3}0.025{col 54}{space 4}-54.71167{col 67}{space 3}-3.774299
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 720.8249{col 26}{space 2} 1189.409{col 37}{space 1}    0.61{col 46}{space 3}0.546{col 54}{space 4}-1636.293{col 67}{space 3} 3077.943
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1079097{col 26}{space 2} 80057.13{col 37}{space 1}   13.48{col 46}{space 3}0.000{col 54}{space 4} 920443.8{col 67}{space 3}  1237751
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       112
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    110.05
{txt}{col 49}        avg{col 67}= {res}    110.05
{txt}{col 49}        max{col 67}= {res}    110.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}  110.1{txt}){col 67}= {res}     18.57
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 8241.897{col 26}{space 2}  10153.1{col 37}{space 1}    0.81{col 46}{space 3}0.419{col 54}{space 4}-11879.05{col 67}{space 3} 28362.84
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 78806.44{col 26}{space 2} 8729.346{col 37}{space 1}    9.03{col 46}{space 3}0.000{col 54}{space 4} 61507.02{col 67}{space 3} 96105.87
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1975.665{col 26}{space 2} 581.9696{col 37}{space 1}   -3.39{col 46}{space 3}0.001{col 54}{space 4}-3128.986{col 67}{space 3}-822.3436
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -12070.3{col 26}{space 2} 9894.843{col 37}{space 1}   -1.22{col 46}{space 3}0.225{col 54}{space 4}-31679.46{col 67}{space 3} 7538.849
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-12.28492{col 26}{space 2} 6.743511{col 37}{space 1}   -1.82{col 46}{space 3}0.071{col 54}{space 4}-25.64891{col 67}{space 3} 1.079063
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 503.7765{col 26}{space 2} 624.1095{col 37}{space 1}    0.81{col 46}{space 3}0.421{col 54}{space 4}-733.0556{col 67}{space 3} 1740.609
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 648856.9{col 26}{space 2} 42007.76{col 37}{space 1}   15.45{col 46}{space 3}0.000{col 54}{space 4} 565607.8{col 67}{space 3} 732105.9
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       112
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    110.05
{txt}{col 49}        avg{col 67}= {res}    110.05
{txt}{col 49}        max{col 67}= {res}    110.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}  110.1{txt}){col 67}= {res}     11.95
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 15862.33{col 26}{space 2} 9758.339{col 37}{space 1}    1.63{col 46}{space 3}0.107{col 54}{space 4}-3476.307{col 67}{space 3} 35200.96
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 60560.25{col 26}{space 2} 8389.946{col 37}{space 1}    7.22{col 46}{space 3}0.000{col 54}{space 4} 43933.43{col 67}{space 3} 77187.06
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -960.499{col 26}{space 2} 559.3423{col 37}{space 1}   -1.72{col 46}{space 3}0.089{col 54}{space 4}-2068.978{col 67}{space 3} 147.9804
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-8057.223{col 26}{space 2} 9510.127{col 37}{space 1}   -0.85{col 46}{space 3}0.399{col 54}{space 4}-26903.96{col 67}{space 3} 10789.52
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.54824{col 26}{space 2} 6.481321{col 37}{space 1}   -2.40{col 46}{space 3}0.018{col 54}{space 4}-28.39263{col 67}{space 3}-2.703852
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 298.1443{col 26}{space 2} 599.8439{col 37}{space 1}    0.50{col 46}{space 3}0.620{col 54}{space 4}-890.5992{col 67}{space 3} 1486.888
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 421783.5{col 26}{space 2} 40374.48{col 37}{space 1}   10.45{col 46}{space 3}0.000{col 54}{space 4} 341771.2{col 67}{space 3} 501795.8
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //INTERACTION BY Race//
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       191
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    189.03
{txt}{col 49}        avg{col 67}= {res}    189.03
{txt}{col 49}        max{col 67}= {res}    189.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  189.0{txt}){col 67}= {res}     21.83
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 30184.24{col 28}{space 2} 18092.96{col 39}{space 1}    1.67{col 48}{space 3}0.097{col 56}{space 4}-5505.808{col 69}{space 3} 65874.29
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 55512.94{col 28}{space 2} 50813.38{col 39}{space 1}    1.09{col 48}{space 3}0.276{col 56}{space 4}-44721.17{col 69}{space 3} 155747.1
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-61227.39{col 28}{space 2} 24712.15{col 39}{space 1}   -2.48{col 48}{space 3}0.014{col 56}{space 4}-109974.4{col 69}{space 3}-12480.37
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 138680.7{col 28}{space 2} 12877.42{col 39}{space 1}   10.77{col 48}{space 3}0.000{col 56}{space 4} 113278.8{col 69}{space 3} 164082.6
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2438.295{col 28}{space 2} 835.9525{col 39}{space 1}   -2.92{col 48}{space 3}0.004{col 56}{space 4}-4087.289{col 69}{space 3}-789.3009
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -1875.88{col 28}{space 2} 14573.57{col 39}{space 1}   -0.13{col 48}{space 3}0.898{col 56}{space 4} -30623.6{col 69}{space 3} 26871.84
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-29.40827{col 28}{space 2} 10.46079{col 39}{space 1}   -2.81{col 48}{space 3}0.005{col 56}{space 4}-50.04316{col 69}{space 3}-8.773378
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 813.6251{col 28}{space 2} 978.4212{col 39}{space 1}    0.83{col 48}{space 3}0.407{col 56}{space 4}-1116.402{col 69}{space 3} 2743.652
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1058088{col 28}{space 2} 64094.45{col 39}{space 1}   16.51{col 48}{space 3}0.000{col 56}{space 4}   931656{col 69}{space 3}  1184521
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       191
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    189.03
{txt}{col 49}        avg{col 67}= {res}    189.03
{txt}{col 49}        max{col 67}= {res}    189.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  189.0{txt}){col 67}= {res}     24.14
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 10651.54{col 28}{space 2} 9861.946{col 39}{space 1}    1.08{col 48}{space 3}0.281{col 56}{space 4}-8802.064{col 69}{space 3} 30105.15
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 11473.52{col 28}{space 2} 27696.89{col 39}{space 1}    0.41{col 48}{space 3}0.679{col 56}{space 4}-43161.18{col 69}{space 3} 66108.22
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-29797.99{col 28}{space 2} 13469.87{col 39}{space 1}   -2.21{col 48}{space 3}0.028{col 56}{space 4}-56368.57{col 69}{space 3}-3227.409
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 72095.79{col 28}{space 2} 7019.106{col 39}{space 1}   10.27{col 48}{space 3}0.000{col 56}{space 4} 58249.95{col 69}{space 3} 85941.63
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2016.792{col 28}{space 2} 455.6534{col 39}{space 1}   -4.43{col 48}{space 3}0.000{col 56}{space 4}-2915.611{col 69}{space 3}-1117.973
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2153.442{col 28}{space 2} 7943.628{col 39}{space 1}   -0.27{col 48}{space 3}0.787{col 56}{space 4}-17822.99{col 69}{space 3}  13516.1
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} -14.3153{col 28}{space 2} 5.701874{col 39}{space 1}   -2.51{col 48}{space 3}0.013{col 56}{space 4}-25.56278{col 69}{space 3}-3.067824
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 548.9267{col 28}{space 2} 533.3089{col 39}{space 1}    1.03{col 48}{space 3}0.305{col 56}{space 4}-503.0748{col 69}{space 3} 1600.928
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 645322.4{col 28}{space 2} 34936.02{col 39}{space 1}   18.47{col 48}{space 3}0.000{col 56}{space 4} 576407.9{col 69}{space 3}   714237
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       191
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    189.03
{txt}{col 49}        avg{col 67}= {res}    189.03
{txt}{col 49}        max{col 67}= {res}    189.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  189.0{txt}){col 67}= {res}     14.21
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 15430.08{col 28}{space 2} 8804.307{col 39}{space 1}    1.75{col 48}{space 3}0.081{col 56}{space 4}-1937.232{col 69}{space 3}  32797.4
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 36711.36{col 28}{space 2} 24726.56{col 39}{space 1}    1.48{col 48}{space 3}0.139{col 56}{space 4}-12064.07{col 69}{space 3} 85486.79
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-26988.41{col 28}{space 2} 12025.31{col 39}{space 1}   -2.24{col 48}{space 3}0.026{col 56}{space 4}-50709.44{col 69}{space 3}-3267.374
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 56243.41{col 28}{space 2} 6266.346{col 39}{space 1}    8.98{col 48}{space 3}0.000{col 56}{space 4} 43882.45{col 69}{space 3} 68604.36
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-817.7215{col 28}{space 2} 406.7871{col 39}{space 1}   -2.01{col 48}{space 3}0.046{col 56}{space 4}-1620.147{col 69}{space 3}-15.29615
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2933.748{col 28}{space 2} 7091.718{col 39}{space 1}   -0.41{col 48}{space 3}0.680{col 56}{space 4}-16922.82{col 69}{space 3} 11055.33
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-14.02069{col 28}{space 2}  5.09038{col 39}{space 1}   -2.75{col 48}{space 3}0.006{col 56}{space 4}-24.06194{col 69}{space 3} -3.97944
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 275.7076{col 28}{space 2} 476.1145{col 39}{space 1}    0.58{col 48}{space 3}0.563{col 56}{space 4}-663.4726{col 69}{space 3} 1214.888
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 413222.9{col 28}{space 2} 31189.33{col 39}{space 1}   13.25{col 48}{space 3}0.000{col 56}{space 4}   351699{col 69}{space 3} 474746.7
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. *********************LnNFLw1, MODELS 3-6***************************
. 
. ***********MODEL 3: MODEL 2+w1dxDiabetes w1Glucose******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0048
{txt}{col 49}Largest FMI{col 67}= {res}    0.0234
{txt}{col 49}Complete DF{col 67}= {res}        72
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     67.99
{txt}{col 49}        avg{col 67}= {res}     69.53
{txt}{col 49}        max{col 67}= {res}     70.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   70.1{txt}){col 67}= {res}      6.76
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-50022.53{col 26}{space 2}  25764.1{col 37}{space 1}   -1.94{col 46}{space 3}0.056{col 54}{space 4}-101411.1{col 67}{space 3} 1366.075
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 118116.8{col 26}{space 2} 20696.46{col 37}{space 1}    5.71{col 46}{space 3}0.000{col 54}{space 4}  76836.8{col 67}{space 3} 159396.8
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-528.7464{col 26}{space 2}  1515.93{col 37}{space 1}   -0.35{col 46}{space 3}0.728{col 54}{space 4}-3552.473{col 67}{space 3}  2494.98
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 26483.97{col 26}{space 2} 24694.38{col 37}{space 1}    1.07{col 46}{space 3}0.287{col 54}{space 4}-22768.24{col 67}{space 3} 75736.17
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-38.11484{col 26}{space 2} 18.66101{col 37}{space 1}   -2.04{col 46}{space 3}0.045{col 54}{space 4}-75.33288{col 67}{space 3}-.8967875
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-62.30384{col 26}{space 2} 1840.888{col 37}{space 1}   -0.03{col 46}{space 3}0.973{col 54}{space 4}-3734.187{col 67}{space 3} 3609.579
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-42282.32{col 26}{space 2} 20144.59{col 37}{space 1}   -2.10{col 46}{space 3}0.040{col 54}{space 4}-82480.32{col 67}{space 3}-2084.328
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 983.7591{col 26}{space 2} 590.0084{col 37}{space 1}    1.67{col 46}{space 3}0.100{col 54}{space 4}-193.1334{col 67}{space 3} 2160.652
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1016358{col 26}{space 2} 103152.4{col 37}{space 1}    9.85{col 46}{space 3}0.000{col 54}{space 4} 810608.3{col 67}{space 3}  1222107
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0069
{txt}{col 49}Largest FMI{col 67}= {res}    0.0341
{txt}{col 49}Complete DF{col 67}= {res}        72
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     66.67
{txt}{col 49}        avg{col 67}= {res}     69.01
{txt}{col 49}        max{col 67}= {res}     69.97
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   70.0{txt}){col 67}= {res}      7.31
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} -29924.5{col 26}{space 2} 14553.01{col 37}{space 1}   -2.06{col 46}{space 3}0.044{col 54}{space 4} -58957.5{col 67}{space 3}-891.5061
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 59077.35{col 26}{space 2} 11665.03{col 37}{space 1}    5.06{col 46}{space 3}0.000{col 54}{space 4} 35808.86{col 67}{space 3} 82345.84
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -969.225{col 26}{space 2} 856.0743{col 37}{space 1}   -1.13{col 46}{space 3}0.261{col 54}{space 4}-2677.113{col 67}{space 3} 738.6631
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 14404.27{col 26}{space 2} 13895.49{col 37}{space 1}    1.04{col 46}{space 3}0.303{col 54}{space 4}-13310.31{col 67}{space 3} 42118.86
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-22.79991{col 26}{space 2} 10.49971{col 37}{space 1}   -2.17{col 46}{space 3}0.033{col 54}{space 4} -43.7411{col 67}{space 3}-1.858731
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 118.2988{col 26}{space 2} 1037.935{col 37}{space 1}    0.11{col 46}{space 3}0.910{col 54}{space 4}-1952.224{col 67}{space 3} 2188.822
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-29225.35{col 26}{space 2} 11387.19{col 37}{space 1}   -2.57{col 46}{space 3}0.013{col 54}{space 4}-51956.36{col 67}{space 3}-6494.339
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 626.3224{col 26}{space 2} 333.4479{col 37}{space 1}    1.88{col 46}{space 3}0.065{col 54}{space 4} -38.9743{col 67}{space 3} 1291.619
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 605539.4{col 26}{space 2} 58007.44{col 37}{space 1}   10.44{col 46}{space 3}0.000{col 54}{space 4} 489837.9{col 67}{space 3}   721241
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0074
{txt}{col 49}Largest FMI{col 67}= {res}    0.0576
{txt}{col 49}Complete DF{col 67}= {res}        72
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     63.22
{txt}{col 49}        avg{col 67}= {res}     69.02
{txt}{col 49}        max{col 67}= {res}     70.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   70.0{txt}){col 67}= {res}      4.45
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0002

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-19321.68{col 26}{space 2} 12130.75{col 37}{space 1}   -1.59{col 46}{space 3}0.116{col 54}{space 4}-43515.85{col 67}{space 3} 4872.493
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 47271.63{col 26}{space 2} 9746.902{col 37}{space 1}    4.85{col 46}{space 3}0.000{col 54}{space 4} 27832.09{col 67}{space 3} 66711.17
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-65.85341{col 26}{space 2} 713.8963{col 37}{space 1}   -0.09{col 46}{space 3}0.927{col 54}{space 4}-1489.728{col 67}{space 3} 1358.021
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 6267.311{col 26}{space 2} 11640.52{col 37}{space 1}    0.54{col 46}{space 3}0.592{col 54}{space 4}-16948.91{col 67}{space 3} 29483.53
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.11362{col 26}{space 2} 8.799873{col 37}{space 1}   -1.60{col 46}{space 3}0.113{col 54}{space 4}-31.66425{col 67}{space 3} 3.437011
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-223.7692{col 26}{space 2} 866.4017{col 37}{space 1}   -0.26{col 46}{space 3}0.797{col 54}{space 4}-1951.772{col 67}{space 3} 1504.233
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-13227.12{col 26}{space 2} 9662.132{col 37}{space 1}   -1.37{col 46}{space 3}0.176{col 54}{space 4}-32534.06{col 67}{space 3} 6079.823
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 339.3643{col 26}{space 2} 279.5795{col 37}{space 1}    1.21{col 46}{space 3}0.229{col 54}{space 4} -218.446{col 67}{space 3} 897.1746
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 416981.7{col 26}{space 2} 48675.92{col 37}{space 1}    8.57{col 46}{space 3}0.000{col 54}{space 4} 319889.8{col 67}{space 3} 514073.7
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0002
{txt}{col 49}Largest FMI{col 67}= {res}    0.0014
{txt}{col 49}Complete DF{col 67}= {res}       110
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    107.94
{txt}{col 49}        avg{col 67}= {res}    108.03
{txt}{col 49}        max{col 67}= {res}    108.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  108.1{txt}){col 67}= {res}     13.20
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 35281.89{col 26}{space 2}  20842.7{col 37}{space 1}    1.69{col 46}{space 3}0.093{col 54}{space 4}-6032.225{col 67}{space 3}    76596
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 148215.5{col 26}{space 2} 17106.74{col 37}{space 1}    8.66{col 46}{space 3}0.000{col 54}{space 4} 114307.2{col 67}{space 3} 182123.9
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2831.269{col 26}{space 2} 1126.771{col 37}{space 1}   -2.51{col 46}{space 3}0.013{col 54}{space 4}-5064.729{col 67}{space 3}-597.8098
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-19199.71{col 26}{space 2}    19103{col 37}{space 1}   -1.01{col 46}{space 3}0.317{col 54}{space 4}-57064.95{col 67}{space 3} 18665.53
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-27.96737{col 26}{space 2} 13.21524{col 37}{space 1}   -2.12{col 46}{space 3}0.037{col 54}{space 4}-54.16212{col 67}{space 3}-1.772611
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 831.0892{col 26}{space 2} 1277.872{col 37}{space 1}    0.65{col 46}{space 3}0.517{col 54}{space 4}-1701.861{col 67}{space 3} 3364.039
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 18477.51{col 26}{space 2} 18169.77{col 37}{space 1}    1.02{col 46}{space 3}0.311{col 54}{space 4}-17537.94{col 67}{space 3} 54492.97
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-532.2665{col 26}{space 2} 399.1456{col 37}{space 1}   -1.33{col 46}{space 3}0.185{col 54}{space 4}-1323.438{col 67}{space 3} 258.9053
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1118396{col 26}{space 2}  88533.9{col 37}{space 1}   12.63{col 46}{space 3}0.000{col 54}{space 4} 942906.9{col 67}{space 3}  1293884
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0009
{txt}{col 49}Complete DF{col 67}= {res}       110
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    107.99
{txt}{col 49}        avg{col 67}= {res}    108.03
{txt}{col 49}        max{col 67}= {res}    108.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  108.1{txt}){col 67}= {res}     13.91
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 10400.42{col 26}{space 2} 10978.54{col 37}{space 1}    0.95{col 46}{space 3}0.346{col 54}{space 4}-11360.97{col 67}{space 3} 32161.81
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 78509.48{col 26}{space 2} 9012.534{col 37}{space 1}    8.71{col 46}{space 3}0.000{col 54}{space 4} 60645.17{col 67}{space 3} 96373.78
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2060.796{col 26}{space 2} 593.6009{col 37}{space 1}   -3.47{col 46}{space 3}0.001{col 54}{space 4}-3237.416{col 67}{space 3} -884.176
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-12526.04{col 26}{space 2} 10064.57{col 37}{space 1}   -1.24{col 46}{space 3}0.216{col 54}{space 4}-32475.66{col 67}{space 3} 7423.578
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-11.67039{col 26}{space 2} 6.962387{col 37}{space 1}   -1.68{col 46}{space 3}0.097{col 54}{space 4}-25.47097{col 67}{space 3} 2.130193
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 522.4863{col 26}{space 2} 673.2581{col 37}{space 1}    0.78{col 46}{space 3}0.439{col 54}{space 4}-812.0207{col 67}{space 3} 1856.993
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 7454.264{col 26}{space 2} 9573.547{col 37}{space 1}    0.78{col 46}{space 3}0.438{col 54}{space 4} -11522.1{col 67}{space 3} 26430.63
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-195.1251{col 26}{space 2} 210.3193{col 37}{space 1}   -0.93{col 46}{space 3}0.356{col 54}{space 4}-612.0134{col 67}{space 3} 221.7633
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 664639.6{col 26}{space 2} 46647.02{col 37}{space 1}   14.25{col 46}{space 3}0.000{col 54}{space 4} 572177.5{col 67}{space 3} 757101.7
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0003
{txt}{col 49}Largest FMI{col 67}= {res}    0.0020
{txt}{col 49}Complete DF{col 67}= {res}       110
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    107.87
{txt}{col 49}        avg{col 67}= {res}    108.01
{txt}{col 49}        max{col 67}= {res}    108.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  108.1{txt}){col 67}= {res}      9.07
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  19111.9{col 26}{space 2} 10531.82{col 37}{space 1}    1.81{col 46}{space 3}0.072{col 54}{space 4}-1764.041{col 67}{space 3} 39987.83
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 60716.06{col 26}{space 2} 8645.872{col 37}{space 1}    7.02{col 46}{space 3}0.000{col 54}{space 4} 43578.51{col 67}{space 3} 77853.61
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1045.482{col 26}{space 2} 569.3349{col 37}{space 1}   -1.84{col 46}{space 3}0.069{col 54}{space 4}-2173.998{col 67}{space 3}  83.0354
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-8214.901{col 26}{space 2} 9654.496{col 37}{space 1}   -0.85{col 46}{space 3}0.397{col 54}{space 4}-27351.69{col 67}{space 3} 10921.88
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.20369{col 26}{space 2}  6.67916{col 37}{space 1}   -2.28{col 46}{space 3}0.025{col 54}{space 4} -28.4429{col 67}{space 3}-1.964489
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 378.5175{col 26}{space 2} 645.8368{col 37}{space 1}    0.59{col 46}{space 3}0.559{col 54}{space 4}-901.6368{col 67}{space 3} 1658.672
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 7117.368{col 26}{space 2} 9190.168{col 37}{space 1}    0.77{col 46}{space 3}0.440{col 54}{space 4} -11099.4{col 67}{space 3} 25334.13
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-233.8437{col 26}{space 2} 201.7504{col 37}{space 1}   -1.16{col 46}{space 3}0.249{col 54}{space 4}-633.7472{col 67}{space 3} 166.0599
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 437024.3{col 26}{space 2} 44747.09{col 37}{space 1}    9.77{col 46}{space 3}0.000{col 54}{space 4} 348328.2{col 67}{space 3} 525720.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //INTERACTION BY Race//
. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0041
{txt}{col 49}Largest FMI{col 67}= {res}    0.0445
{txt}{col 49}Complete DF{col 67}= {res}       189
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    165.23
{txt}{col 49}        avg{col 67}= {res}    184.31
{txt}{col 49}        max{col 67}= {res}    187.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  187.0{txt}){col 67}= {res}     17.31
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 32731.21{col 28}{space 2}  19207.7{col 39}{space 1}    1.70{col 48}{space 3}0.090{col 56}{space 4} -5160.42{col 69}{space 3} 70622.84
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 63914.97{col 28}{space 2} 52515.47{col 39}{space 1}    1.22{col 48}{space 3}0.225{col 56}{space 4}-39683.97{col 69}{space 3} 167513.9
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-65479.69{col 28}{space 2} 25669.08{col 39}{space 1}   -2.55{col 48}{space 3}0.012{col 56}{space 4}-116117.9{col 69}{space 3}-14841.52
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 140293.7{col 28}{space 2} 13151.78{col 39}{space 1}   10.67{col 48}{space 3}0.000{col 56}{space 4} 114348.7{col 69}{space 3} 166238.6
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2340.526{col 28}{space 2} 860.6592{col 39}{space 1}   -2.72{col 48}{space 3}0.007{col 56}{space 4}-4038.402{col 69}{space 3}-642.6504
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -1010.91{col 28}{space 2}  14676.5{col 39}{space 1}   -0.07{col 48}{space 3}0.945{col 56}{space 4}-29963.68{col 69}{space 3} 27941.86
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-30.80037{col 28}{space 2} 10.66959{col 39}{space 1}   -2.89{col 48}{space 3}0.004{col 56}{space 4} -51.8487{col 69}{space 3}-9.752033
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 994.2938{col 28}{space 2} 1020.682{col 39}{space 1}    0.97{col 48}{space 3}0.331{col 56}{space 4}-1019.245{col 69}{space 3} 3007.832
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} -7589.74{col 28}{space 2} 13561.56{col 39}{space 1}   -0.56{col 48}{space 3}0.576{col 56}{space 4}-34366.02{col 69}{space 3} 19186.54
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2}-8.693695{col 28}{space 2} 330.9706{col 39}{space 1}   -0.03{col 48}{space 3}0.979{col 56}{space 4} -661.741{col 69}{space 3} 644.3537
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1045886{col 28}{space 2} 69098.53{col 39}{space 1}   15.14{col 48}{space 3}0.000{col 56}{space 4} 909565.9{col 69}{space 3}  1182206
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0013
{txt}{col 49}Largest FMI{col 67}= {res}    0.0126
{txt}{col 49}Complete DF{col 67}= {res}       189
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    183.45
{txt}{col 49}        avg{col 67}= {res}    186.51
{txt}{col 49}        max{col 67}= {res}    187.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  187.0{txt}){col 67}= {res}     19.38
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 11032.48{col 28}{space 2} 10445.87{col 39}{space 1}    1.06{col 48}{space 3}0.292{col 56}{space 4} -9574.43{col 69}{space 3}  31639.4
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 16344.91{col 28}{space 2} 28557.77{col 39}{space 1}    0.57{col 48}{space 3}0.568{col 56}{space 4}-39991.92{col 69}{space 3} 72681.74
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-32100.95{col 28}{space 2} 13959.89{col 39}{space 1}   -2.30{col 48}{space 3}0.023{col 56}{space 4}-59640.09{col 69}{space 3}-4561.818
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 72983.37{col 28}{space 2} 7151.821{col 39}{space 1}   10.20{col 48}{space 3}0.000{col 56}{space 4} 58874.73{col 69}{space 3} 87092.02
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1899.393{col 28}{space 2} 467.6714{col 39}{space 1}   -4.06{col 48}{space 3}0.000{col 56}{space 4}-2821.987{col 69}{space 3}-976.7988
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-1569.634{col 28}{space 2} 7981.023{col 39}{space 1}   -0.20{col 48}{space 3}0.844{col 56}{space 4}-17314.03{col 69}{space 3} 14174.77
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-15.49148{col 28}{space 2} 5.799913{col 39}{space 1}   -2.67{col 48}{space 3}0.008{col 56}{space 4}-26.93315{col 69}{space 3}-4.049811
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 644.8763{col 28}{space 2} 554.9978{col 39}{space 1}    1.16{col 48}{space 3}0.247{col 56}{space 4}-449.9881{col 69}{space 3} 1739.741
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} -8551.88{col 28}{space 2} 7258.741{col 39}{space 1}   -1.18{col 48}{space 3}0.240{col 56}{space 4}-22873.23{col 69}{space 3} 5769.465
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 93.57038{col 28}{space 2} 178.8651{col 39}{space 1}    0.52{col 48}{space 3}0.602{col 56}{space 4}-259.2955{col 69}{space 3} 446.4362
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 630151.5{col 28}{space 2} 37499.98{col 39}{space 1}   16.80{col 48}{space 3}0.000{col 56}{space 4}   556173{col 69}{space 3} 704130.1
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0072
{txt}{col 49}Largest FMI{col 67}= {res}    0.0761
{txt}{col 49}Complete DF{col 67}= {res}       189
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    140.94
{txt}{col 49}        avg{col 67}= {res}    181.30
{txt}{col 49}        max{col 67}= {res}    187.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  186.9{txt}){col 67}= {res}     11.20
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 16752.21{col 28}{space 2} 9354.239{col 39}{space 1}    1.79{col 48}{space 3}0.075{col 56}{space 4}-1701.187{col 69}{space 3} 35205.61
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 39679.66{col 28}{space 2} 25579.48{col 39}{space 1}    1.55{col 48}{space 3}0.123{col 56}{space 4}-10781.91{col 69}{space 3} 90141.24
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-28551.38{col 28}{space 2} 12502.61{col 39}{space 1}   -2.28{col 48}{space 3}0.024{col 56}{space 4}-53215.69{col 69}{space 3}-3887.069
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}    56836{col 28}{space 2}  6405.12{col 39}{space 1}    8.87{col 48}{space 3}0.000{col 56}{space 4} 44200.39{col 69}{space 3}  69471.6
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-806.3487{col 28}{space 2} 419.4609{col 39}{space 1}   -1.92{col 48}{space 3}0.056{col 56}{space 4}-1633.855{col 69}{space 3} 21.15813
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2659.247{col 28}{space 2} 7147.831{col 39}{space 1}   -0.37{col 48}{space 3}0.710{col 56}{space 4}-16759.99{col 69}{space 3}  11441.5
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-14.37234{col 28}{space 2} 5.198161{col 39}{space 1}   -2.76{col 48}{space 3}0.006{col 56}{space 4}-24.62702{col 69}{space 3}-4.117655
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 343.4976{col 28}{space 2} 497.0989{col 39}{space 1}    0.69{col 48}{space 3}0.490{col 56}{space 4}-637.1492{col 69}{space 3} 1324.144
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-1093.954{col 28}{space 2}  6709.78{col 39}{space 1}   -0.16{col 48}{space 3}0.871{col 56}{space 4}-14358.78{col 69}{space 3} 12170.87
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2}-41.10125{col 28}{space 2} 162.2264{col 39}{space 1}   -0.25{col 48}{space 3}0.800{col 56}{space 4}-361.2797{col 69}{space 3} 279.0772
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 412007.6{col 28}{space 2} 33718.07{col 39}{space 1}   12.22{col 48}{space 3}0.000{col 56}{space 4} 345484.4{col 69}{space 3} 478530.8
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 4: MODEL 2+liver/kidney disease******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0663
{txt}{col 49}Largest FMI{col 67}= {res}    0.4696
{txt}{col 49}Complete DF{col 67}= {res}        69
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     14.45
{txt}{col 49}        avg{col 67}= {res}     59.38
{txt}{col 49}        max{col 67}= {res}     66.56
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   66.2{txt}){col 67}= {res}      4.48
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} -43489.8{col 26}{space 2} 25878.73{col 37}{space 1}   -1.68{col 46}{space 3}0.098{col 54}{space 4}-95159.99{col 67}{space 3}  8180.39
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 153178.5{col 26}{space 2} 27172.35{col 37}{space 1}    5.64{col 46}{space 3}0.000{col 54}{space 4} 98426.07{col 67}{space 3}   207931
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1052.436{col 26}{space 2} 1682.004{col 37}{space 1}   -0.63{col 46}{space 3}0.534{col 54}{space 4}-4410.903{col 67}{space 3} 2306.032
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 30614.19{col 26}{space 2} 25586.83{col 37}{space 1}    1.20{col 46}{space 3}0.236{col 54}{space 4}-20463.48{col 67}{space 3} 81691.87
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-38.85199{col 26}{space 2} 19.53182{col 37}{space 1}   -1.99{col 46}{space 3}0.051{col 54}{space 4}-77.84889{col 67}{space 3} .1449157
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1792.188{col 26}{space 2}  2009.86{col 37}{space 1}    0.89{col 46}{space 3}0.376{col 54}{space 4}-2223.372{col 67}{space 3} 5807.748
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-60228.15{col 26}{space 2} 65553.12{col 37}{space 1}   -0.92{col 46}{space 3}0.373{col 54}{space 4}-200411.8{col 67}{space 3} 79955.46
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} -1096051{col 26}{space 2}  1591647{col 37}{space 1}   -0.69{col 46}{space 3}0.493{col 54}{space 4} -4273713{col 67}{space 3}  2081610
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-54.07298{col 26}{space 2} 3527.454{col 37}{space 1}   -0.02{col 46}{space 3}0.988{col 54}{space 4}-7106.223{col 67}{space 3} 6998.077
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 638.6171{col 26}{space 2}  528.795{col 37}{space 1}    1.21{col 46}{space 3}0.231{col 54}{space 4}-417.1056{col 67}{space 3}  1694.34
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-7261.901{col 26}{space 2} 8948.756{col 37}{space 1}   -0.81{col 46}{space 3}0.420{col 54}{space 4}-25129.76{col 67}{space 3} 10605.96
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  2165603{col 26}{space 2}  1618943{col 37}{space 1}    1.34{col 46}{space 3}0.186{col 54}{space 4} -1066494{col 67}{space 3}  5397701
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0523
{txt}{col 49}Largest FMI{col 67}= {res}    0.4248
{txt}{col 49}Complete DF{col 67}= {res}        69
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     16.77
{txt}{col 49}        avg{col 67}= {res}     60.73
{txt}{col 49}        max{col 67}= {res}     66.88
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   66.5{txt}){col 67}= {res}      4.28
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-24303.23{col 26}{space 2} 14930.49{col 37}{space 1}   -1.63{col 46}{space 3}0.108{col 54}{space 4}-54105.61{col 67}{space 3} 5499.146
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 72950.87{col 26}{space 2} 15468.01{col 37}{space 1}    4.72{col 46}{space 3}0.000{col 54}{space 4} 41890.29{col 67}{space 3} 104011.5
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1550.413{col 26}{space 2} 973.3564{col 37}{space 1}   -1.59{col 46}{space 3}0.116{col 54}{space 4}-3493.632{col 67}{space 3} 392.8071
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 17240.62{col 26}{space 2}  14843.2{col 37}{space 1}    1.16{col 46}{space 3}0.250{col 54}{space 4}-12389.72{col 67}{space 3} 46870.95
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-22.92398{col 26}{space 2} 11.28283{col 37}{space 1}   -2.03{col 46}{space 3}0.046{col 54}{space 4}-45.44618{col 67}{space 3}-.4017731
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 904.6172{col 26}{space 2} 1155.226{col 37}{space 1}    0.78{col 46}{space 3}0.436{col 54}{space 4}-1401.954{col 67}{space 3} 3211.189
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-12909.69{col 26}{space 2} 36751.85{col 37}{space 1}   -0.35{col 46}{space 3}0.730{col 54}{space 4}-90532.09{col 67}{space 3} 64712.72
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-832445.6{col 26}{space 2} 919810.5{col 37}{space 1}   -0.91{col 46}{space 3}0.369{col 54}{space 4} -2668460{col 67}{space 3}  1003569
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 928.6381{col 26}{space 2} 2034.699{col 37}{space 1}    0.46{col 46}{space 3}0.650{col 54}{space 4}-3137.011{col 67}{space 3} 4994.287
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 292.4341{col 26}{space 2} 306.1191{col 37}{space 1}    0.96{col 46}{space 3}0.343{col 54}{space 4}-318.6517{col 67}{space 3} 903.5199
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-3741.979{col 26}{space 2} 5199.361{col 37}{space 1}   -0.72{col 46}{space 3}0.474{col 54}{space 4}-14124.28{col 67}{space 3}  6640.32
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1473374{col 26}{space 2} 935849.1{col 37}{space 1}    1.57{col 46}{space 3}0.120{col 54}{space 4}-394648.2{col 67}{space 3}  3341396
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0811
{txt}{col 49}Largest FMI{col 67}= {res}    0.5068
{txt}{col 49}Complete DF{col 67}= {res}        69
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     12.82
{txt}{col 49}        avg{col 67}= {res}     58.19
{txt}{col 49}        max{col 67}= {res}     66.27
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   65.8{txt}){col 67}= {res}      3.42
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0009

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-18415.41{col 26}{space 2} 11929.87{col 37}{space 1}   -1.54{col 46}{space 3}0.128{col 54}{space 4}-42243.37{col 67}{space 3} 5412.553
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 64998.67{col 26}{space 2} 12564.09{col 37}{space 1}    5.17{col 46}{space 3}0.000{col 54}{space 4} 39637.27{col 67}{space 3} 90360.06
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-161.9113{col 26}{space 2} 775.6265{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-1711.211{col 67}{space 3} 1387.388
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}  7751.06{col 26}{space 2} 11748.63{col 37}{space 1}    0.66{col 46}{space 3}0.512{col 54}{space 4}-15704.08{col 67}{space 3}  31206.2
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.85478{col 26}{space 2} 9.001631{col 37}{space 1}   -1.65{col 46}{space 3}0.104{col 54}{space 4}-32.83319{col 67}{space 3} 3.123638
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 663.8095{col 26}{space 2} 929.2111{col 37}{space 1}    0.71{col 46}{space 3}0.478{col 54}{space 4}-1194.115{col 67}{space 3} 2521.734
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-37784.87{col 26}{space 2} 30972.52{col 37}{space 1}   -1.22{col 46}{space 3}0.244{col 54}{space 4}-104793.8{col 67}{space 3} 29224.01
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-403759.5{col 26}{space 2} 732607.1{col 37}{space 1}   -0.55{col 46}{space 3}0.583{col 54}{space 4} -1866725{col 67}{space 3}  1059206
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-269.7982{col 26}{space 2} 1621.235{col 37}{space 1}   -0.17{col 46}{space 3}0.868{col 54}{space 4}-3511.857{col 67}{space 3}  2972.26
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 313.3372{col 26}{space 2} 243.6574{col 37}{space 1}    1.29{col 46}{space 3}0.203{col 54}{space 4}-173.2673{col 67}{space 3} 799.9416
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-2981.091{col 26}{space 2} 4105.498{col 37}{space 1}   -0.73{col 46}{space 3}0.470{col 54}{space 4}-11178.89{col 67}{space 3} 5216.707
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 838704.1{col 26}{space 2} 744843.9{col 37}{space 1}    1.13{col 46}{space 3}0.264{col 54}{space 4}-648626.7{col 67}{space 3}  2326035
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0149
{txt}{col 49}Largest FMI{col 67}= {res}    0.1389
{txt}{col 49}Complete DF{col 67}= {res}       107
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     66.13
{txt}{col 49}        avg{col 67}= {res}    100.34
{txt}{col 49}        max{col 67}= {res}    104.92
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  104.9{txt}){col 67}= {res}     10.61
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 24578.92{col 26}{space 2} 20029.88{col 37}{space 1}    1.23{col 46}{space 3}0.223{col 54}{space 4}-15137.32{col 67}{space 3} 64295.15
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 167158.9{col 26}{space 2} 21334.28{col 37}{space 1}    7.84{col 46}{space 3}0.000{col 54}{space 4} 124838.9{col 67}{space 3} 209478.9
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2164.252{col 26}{space 2} 1126.004{col 37}{space 1}   -1.92{col 46}{space 3}0.057{col 54}{space 4}-4396.967{col 67}{space 3} 68.46338
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-13535.84{col 26}{space 2} 18693.15{col 37}{space 1}   -0.72{col 46}{space 3}0.471{col 54}{space 4}-50601.86{col 67}{space 3} 23530.18
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-34.86922{col 26}{space 2} 12.89663{col 37}{space 1}   -2.70{col 46}{space 3}0.008{col 54}{space 4}-60.44186{col 67}{space 3}-9.296588
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 2142.964{col 26}{space 2} 1293.448{col 37}{space 1}    1.66{col 46}{space 3}0.101{col 54}{space 4}-421.8419{col 67}{space 3} 4707.771
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 41198.01{col 26}{space 2} 52452.02{col 37}{space 1}    0.79{col 46}{space 3}0.435{col 54}{space 4} -63521.9{col 67}{space 3} 145917.9
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 748485.5{col 26}{space 2}  1471217{col 37}{space 1}    0.51{col 46}{space 3}0.612{col 54}{space 4} -2169111{col 67}{space 3}  3666082
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-114.9127{col 26}{space 2} 2343.713{col 37}{space 1}   -0.05{col 46}{space 3}0.961{col 54}{space 4}-4766.792{col 67}{space 3} 4536.967
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 191.0089{col 26}{space 2}   392.01{col 37}{space 1}    0.49{col 46}{space 3}0.627{col 54}{space 4}-586.2817{col 67}{space 3} 968.2996
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-20547.99{col 26}{space 2} 7061.224{col 37}{space 1}   -2.91{col 46}{space 3}0.004{col 54}{space 4}-34550.03{col 67}{space 3}-6545.953
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 302630.2{col 26}{space 2}  1485106{col 37}{space 1}    0.20{col 46}{space 3}0.839{col 54}{space 4} -2642555{col 67}{space 3}  3247815
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0270
{txt}{col 49}Largest FMI{col 67}= {res}    0.2416
{txt}{col 49}Complete DF{col 67}= {res}       107
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     41.13
{txt}{col 49}        avg{col 67}= {res}     97.46
{txt}{col 49}        max{col 67}= {res}    104.62
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  104.7{txt}){col 67}= {res}     10.79
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 5070.154{col 26}{space 2} 10624.52{col 37}{space 1}    0.48{col 46}{space 3}0.634{col 54}{space 4}-15997.78{col 67}{space 3} 26138.09
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 86725.05{col 26}{space 2} 11369.11{col 37}{space 1}    7.63{col 46}{space 3}0.000{col 54}{space 4} 64163.97{col 67}{space 3} 109286.1
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1808.412{col 26}{space 2} 596.9346{col 37}{space 1}   -3.03{col 46}{space 3}0.003{col 54}{space 4}-2992.097{col 67}{space 3}-624.7276
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-9975.379{col 26}{space 2} 9909.948{col 37}{space 1}   -1.01{col 46}{space 3}0.316{col 54}{space 4}-29626.21{col 67}{space 3} 9675.455
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.79372{col 26}{space 2} 6.838473{col 37}{space 1}   -2.16{col 46}{space 3}0.033{col 54}{space 4}-28.35429{col 67}{space 3}-1.233151
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1197.724{col 26}{space 2} 686.4137{col 37}{space 1}    1.74{col 46}{space 3}0.084{col 54}{space 4} -163.482{col 67}{space 3}  2558.93
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 24410.95{col 26}{space 2} 29336.18{col 37}{space 1}    0.83{col 46}{space 3}0.410{col 54}{space 4}-34828.83{col 67}{space 3} 83650.72
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 188007.9{col 26}{space 2}   777217{col 37}{space 1}    0.24{col 46}{space 3}0.809{col 54}{space 4} -1353191{col 67}{space 3}  1729206
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 217.3541{col 26}{space 2} 1250.573{col 37}{space 1}    0.17{col 46}{space 3}0.862{col 54}{space 4}-2266.405{col 67}{space 3} 2701.113
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 192.6829{col 26}{space 2} 207.8134{col 37}{space 1}    0.93{col 46}{space 3}0.356{col 54}{space 4}-219.3903{col 67}{space 3} 604.7561
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-9656.446{col 26}{space 2} 3745.994{col 37}{space 1}   -2.58{col 46}{space 3}0.011{col 54}{space 4}-17085.04{col 67}{space 3}-2227.852
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 439629.3{col 26}{space 2} 784562.4{col 37}{space 1}    0.56{col 46}{space 3}0.576{col 54}{space 4} -1116155{col 67}{space 3}  1995414
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0032
{txt}{col 49}Largest FMI{col 67}= {res}    0.0221
{txt}{col 49}Complete DF{col 67}= {res}       107
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    101.66
{txt}{col 49}        avg{col 67}= {res}    104.56
{txt}{col 49}        max{col 67}= {res}    105.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  105.0{txt}){col 67}= {res}      7.44
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 15212.67{col 26}{space 2} 10166.35{col 37}{space 1}    1.50{col 46}{space 3}0.138{col 54}{space 4} -4945.28{col 67}{space 3} 35370.62
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  70580.7{col 26}{space 2} 10729.12{col 37}{space 1}    6.58{col 46}{space 3}0.000{col 54}{space 4} 49306.13{col 67}{space 3} 91855.27
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-762.7681{col 26}{space 2} 571.2976{col 37}{space 1}   -1.34{col 46}{space 3}0.185{col 54}{space 4}-1895.541{col 67}{space 3} 370.0051
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -5831.36{col 26}{space 2} 9487.488{col 37}{space 1}   -0.61{col 46}{space 3}0.540{col 54}{space 4}-24643.37{col 67}{space 3} 12980.65
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-17.91945{col 26}{space 2} 6.541065{col 37}{space 1}   -2.74{col 46}{space 3}0.007{col 54}{space 4}-30.88917{col 67}{space 3}-4.949727
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 932.0168{col 26}{space 2} 656.3088{col 37}{space 1}    1.42{col 46}{space 3}0.159{col 54}{space 4}-369.3526{col 67}{space 3} 2233.386
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 12641.57{col 26}{space 2} 25130.22{col 37}{space 1}    0.50{col 46}{space 3}0.616{col 54}{space 4}-37206.11{col 67}{space 3} 62489.26
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 309469.9{col 26}{space 2} 744687.7{col 37}{space 1}    0.42{col 46}{space 3}0.679{col 54}{space 4} -1167168{col 67}{space 3}  1786108
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} -251.794{col 26}{space 2} 1168.675{col 37}{space 1}   -0.22{col 46}{space 3}0.830{col 54}{space 4}-2569.198{col 67}{space 3}  2065.61
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 64.30603{col 26}{space 2} 199.1414{col 37}{space 1}    0.32{col 46}{space 3}0.747{col 54}{space 4}-330.5596{col 67}{space 3} 459.1716
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-9241.099{col 26}{space 2} 3579.301{col 37}{space 1}   -2.58{col 46}{space 3}0.011{col 54}{space 4}-16338.25{col 67}{space 3}-2143.946
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 105269.3{col 26}{space 2}   751380{col 37}{space 1}    0.14{col 46}{space 3}0.889{col 54}{space 4} -1384637{col 67}{space 3}  1595176
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. **INTERACTION BY Race**
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0215
{txt}{col 49}Largest FMI{col 67}= {res}    0.2490
{txt}{col 49}Complete DF{col 67}= {res}       186
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     49.98
{txt}{col 49}        avg{col 67}= {res}    171.47
{txt}{col 49}        max{col 67}= {res}    183.92
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  183.5{txt}){col 67}= {res}     14.09
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}  28229.4{col 28}{space 2} 18525.42{col 39}{space 1}    1.52{col 48}{space 3}0.129{col 56}{space 4}-8321.486{col 69}{space 3} 64780.29
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 58685.67{col 28}{space 2} 51910.42{col 39}{space 1}    1.13{col 48}{space 3}0.260{col 56}{space 4}-43739.78{col 69}{space 3} 161111.1
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-60354.95{col 28}{space 2} 25088.56{col 39}{space 1}   -2.41{col 48}{space 3}0.017{col 56}{space 4}-109855.5{col 69}{space 3}-10854.38
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 160655.2{col 28}{space 2} 16131.51{col 39}{space 1}    9.96{col 48}{space 3}0.000{col 56}{space 4} 128803.1{col 69}{space 3} 192507.2
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2016.208{col 28}{space 2} 871.8876{col 39}{space 1}   -2.31{col 48}{space 3}0.022{col 56}{space 4}-3736.416{col 69}{space 3}-295.9995
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-358.5714{col 28}{space 2} 14571.27{col 39}{space 1}   -0.02{col 48}{space 3}0.980{col 56}{space 4}-29107.24{col 69}{space 3} 28390.09
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-30.85976{col 28}{space 2} 10.46893{col 39}{space 1}   -2.95{col 48}{space 3}0.004{col 56}{space 4}-51.51492{col 69}{space 3}-10.20459
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1883.611{col 28}{space 2}  1047.54{col 39}{space 1}    1.80{col 48}{space 3}0.074{col 56}{space 4}-183.1292{col 69}{space 3} 3950.351
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-12992.27{col 28}{space 2} 37778.22{col 39}{space 1}   -0.34{col 48}{space 3}0.732{col 56}{space 4}-88872.96{col 69}{space 3} 62888.41
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-291962.4{col 28}{space 2}  1045401{col 39}{space 1}   -0.28{col 48}{space 3}0.780{col 56}{space 4} -2354484{col 69}{space 3}  1770559
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 503.0445{col 28}{space 2} 1865.482{col 39}{space 1}    0.27{col 48}{space 3}0.788{col 56}{space 4}-3179.365{col 69}{space 3} 4185.454
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}   266.81{col 28}{space 2} 305.9661{col 39}{space 1}    0.87{col 48}{space 3}0.384{col 56}{space 4}-336.8483{col 69}{space 3} 870.4682
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-13996.93{col 28}{space 2} 5398.682{col 39}{space 1}   -2.59{col 48}{space 3}0.010{col 56}{space 4}-24648.63{col 69}{space 3}-3345.233
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1337496{col 28}{space 2}  1056755{col 39}{space 1}    1.27{col 48}{space 3}0.207{col 56}{space 4}  -747428{col 69}{space 3}  3422419
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0154
{txt}{col 49}Largest FMI{col 67}= {res}    0.1879
{txt}{col 49}Complete DF{col 67}= {res}       186
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     70.64
{txt}{col 49}        avg{col 67}= {res}    173.79
{txt}{col 49}        max{col 67}= {res}    183.84
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  183.8{txt}){col 67}= {res}     15.23
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 7995.937{col 28}{space 2} 10165.56{col 39}{space 1}    0.79{col 48}{space 3}0.433{col 56}{space 4}-12060.89{col 69}{space 3} 28052.76
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 11443.72{col 28}{space 2}  28450.3{col 39}{space 1}    0.40{col 48}{space 3}0.688{col 56}{space 4}-44690.62{col 69}{space 3} 67578.07
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-28307.27{col 28}{space 2} 13759.41{col 39}{space 1}   -2.06{col 48}{space 3}0.041{col 56}{space 4}-55454.81{col 69}{space 3} -1159.72
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 80824.93{col 28}{space 2} 8813.123{col 39}{space 1}    9.17{col 48}{space 3}0.000{col 56}{space 4}  63427.5{col 69}{space 3} 98222.37
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1874.248{col 28}{space 2} 478.3922{col 39}{space 1}   -3.92{col 48}{space 3}0.000{col 56}{space 4}-2818.102{col 69}{space 3}-930.3942
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-1112.342{col 28}{space 2} 7990.604{col 39}{space 1}   -0.14{col 48}{space 3}0.889{col 56}{space 4}-16877.42{col 69}{space 3} 14652.74
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-15.25207{col 28}{space 2} 5.743796{col 39}{space 1}   -2.66{col 48}{space 3}0.009{col 56}{space 4}-26.58455{col 69}{space 3} -3.91958
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1050.776{col 28}{space 2} 574.8868{col 39}{space 1}    1.83{col 48}{space 3}0.069{col 56}{space 4}-83.44818{col 69}{space 3}     2185
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} 2679.409{col 28}{space 2} 20040.92{col 39}{space 1}    0.13{col 48}{space 3}0.894{col 56}{space 4}-37284.57{col 69}{space 3} 42643.39
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-307400.8{col 28}{space 2} 574432.6{col 39}{space 1}   -0.54{col 48}{space 3}0.593{col 56}{space 4} -1440753{col 69}{space 3} 825951.4
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 647.3477{col 28}{space 2} 1017.755{col 39}{space 1}    0.64{col 48}{space 3}0.526{col 56}{space 4} -1361.16{col 69}{space 3} 2655.856
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 195.4558{col 28}{space 2} 167.9743{col 39}{space 1}    1.16{col 48}{space 3}0.246{col 56}{space 4}-135.9536{col 69}{space 3} 526.8651
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-6653.965{col 28}{space 2} 2959.696{col 39}{space 1}   -2.25{col 48}{space 3}0.026{col 56}{space 4}-12493.41{col 69}{space 3}-814.5196
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 940001.7{col 28}{space 2} 580765.6{col 39}{space 1}    1.62{col 48}{space 3}0.107{col 56}{space 4}  -205850{col 69}{space 3}  2085853
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0390
{txt}{col 49}Largest FMI{col 67}= {res}    0.3813
{txt}{col 49}Complete DF{col 67}= {res}       186
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     26.49
{txt}{col 49}        avg{col 67}= {res}    164.78
{txt}{col 49}        max{col 67}= {res}    183.86
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  182.6{txt}){col 67}= {res}      9.28
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 15838.69{col 28}{space 2} 9020.482{col 39}{space 1}    1.76{col 48}{space 3}0.081{col 56}{space 4}-1959.587{col 69}{space 3} 33636.97
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}  40602.3{col 28}{space 2} 25341.15{col 39}{space 1}    1.60{col 48}{space 3}0.111{col 56}{space 4}-9405.667{col 69}{space 3} 90610.26
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-27922.81{col 28}{space 2}  12229.6{col 39}{space 1}   -2.28{col 48}{space 3}0.024{col 56}{space 4}   -52054{col 69}{space 3}-3791.613
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 68007.78{col 28}{space 2} 7986.102{col 39}{space 1}    8.52{col 48}{space 3}0.000{col 56}{space 4}  52215.2{col 69}{space 3} 83800.36
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-625.5086{col 28}{space 2} 425.3529{col 39}{space 1}   -1.47{col 48}{space 3}0.143{col 56}{space 4}-1464.785{col 69}{space 3} 213.7675
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2458.836{col 28}{space 2} 7085.682{col 39}{space 1}   -0.35{col 48}{space 3}0.729{col 56}{space 4}-16438.82{col 69}{space 3} 11521.15
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-14.43593{col 28}{space 2} 5.092483{col 39}{space 1}   -2.83{col 48}{space 3}0.005{col 56}{space 4}-24.48357{col 69}{space 3}-4.388285
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 779.6572{col 28}{space 2}   509.47{col 39}{space 1}    1.53{col 48}{space 3}0.128{col 56}{space 4}-225.5115{col 69}{space 3} 1784.826
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-13822.33{col 28}{space 2} 19910.25{col 39}{space 1}   -0.69{col 48}{space 3}0.494{col 56}{space 4}-54711.59{col 69}{space 3} 27066.94
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-150721.3{col 28}{space 2}   510380{col 39}{space 1}   -0.30{col 48}{space 3}0.768{col 56}{space 4} -1157766{col 69}{space 3} 856323.7
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 35.16737{col 28}{space 2} 923.1166{col 39}{space 1}    0.04{col 48}{space 3}0.970{col 56}{space 4}-1789.377{col 69}{space 3} 1859.712
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 114.4467{col 28}{space 2} 148.6483{col 39}{space 1}    0.77{col 48}{space 3}0.442{col 56}{space 4}-178.8291{col 69}{space 3} 407.7224
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-6181.187{col 28}{space 2} 2629.327{col 39}{space 1}   -2.35{col 48}{space 3}0.020{col 56}{space 4}-11369.15{col 69}{space 3}-993.2254
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 561976.7{col 28}{space 2} 516078.8{col 39}{space 1}    1.09{col 48}{space 3}0.278{col 56}{space 4}-456322.3{col 69}{space 3}  1580276
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0277
{txt}{col 49}Largest FMI{col 67}= {res}    0.2869
{txt}{col 49}Complete DF{col 67}= {res}       187
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     41.10
{txt}{col 49}        avg{col 67}= {res}    170.29
{txt}{col 49}        max{col 67}= {res}    184.94
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  184.2{txt}){col 67}= {res}     14.32
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2365.602{col 26}{space 2} 15260.25{col 37}{space 1}    0.16{col 46}{space 3}0.877{col 54}{space 4}-27741.22{col 67}{space 3} 32472.43
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 159206.2{col 26}{space 2} 16380.49{col 37}{space 1}    9.72{col 46}{space 3}0.000{col 54}{space 4} 126856.6{col 67}{space 3} 191555.8
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1993.358{col 26}{space 2} 883.0172{col 37}{space 1}   -2.26{col 46}{space 3}0.025{col 54}{space 4}-3735.464{col 67}{space 3}-251.2517
{txt}{space 8}Race {c |}{col 14}{res}{space 2} -61259.5{col 26}{space 2} 14290.93{col 37}{space 1}   -4.29{col 46}{space 3}0.000{col 54}{space 4}-89456.15{col 67}{space 3}-33062.84
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 457.5914{col 26}{space 2} 14755.48{col 37}{space 1}    0.03{col 46}{space 3}0.975{col 54}{space 4}-28653.52{col 67}{space 3}  29568.7
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-30.51276{col 26}{space 2} 10.61191{col 37}{space 1}   -2.88{col 46}{space 3}0.005{col 54}{space 4}-51.44966{col 67}{space 3}-9.575869
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  2051.08{col 26}{space 2} 1058.531{col 37}{space 1}    1.94{col 46}{space 3}0.054{col 54}{space 4}-37.26856{col 67}{space 3} 4139.428
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 932.2128{col 26}{space 2} 38487.91{col 37}{space 1}    0.02{col 46}{space 3}0.981{col 54}{space 4}-76789.75{col 67}{space 3} 78654.18
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-125647.2{col 26}{space 2}  1056948{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4} -2210890{col 67}{space 3}  1959595
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 518.3901{col 26}{space 2} 1891.351{col 37}{space 1}    0.27{col 46}{space 3}0.784{col 54}{space 4}-3215.156{col 67}{space 3} 4251.936
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 245.5551{col 26}{space 2} 310.0559{col 37}{space 1}    0.79{col 46}{space 3}0.429{col 54}{space 4}-366.1602{col 67}{space 3} 857.2704
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} -15134.1{col 26}{space 2} 5447.991{col 37}{space 1}   -2.78{col 46}{space 3}0.006{col 54}{space 4}-25882.76{col 67}{space 3}-4385.452
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1273748{col 26}{space 2}  1068571{col 37}{space 1}    1.19{col 46}{space 3}0.235{col 54}{space 4}-834426.4{col 67}{space 3}  3381923
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0207
{txt}{col 49}Largest FMI{col 67}= {res}    0.2203
{txt}{col 49}Complete DF{col 67}= {res}       187
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     58.67
{txt}{col 49}        avg{col 67}= {res}    172.68
{txt}{col 49}        max{col 67}= {res}    184.75
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  184.5{txt}){col 67}= {res}     15.78
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-4133.553{col 26}{space 2} 8342.878{col 37}{space 1}   -0.50{col 46}{space 3}0.621{col 54}{space 4}-20593.28{col 67}{space 3} 12326.18
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 80145.46{col 26}{space 2}  8904.02{col 37}{space 1}    9.00{col 46}{space 3}0.000{col 54}{space 4} 62566.91{col 67}{space 3} 97724.02
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1863.661{col 26}{space 2} 483.1657{col 37}{space 1}   -3.86{col 46}{space 3}0.000{col 54}{space 4}-2816.923{col 67}{space 3}-910.3998
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-44812.79{col 26}{space 2} 7792.995{col 37}{space 1}   -5.75{col 46}{space 3}0.000{col 54}{space 4}-60188.02{col 67}{space 3}-29437.56
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-730.2637{col 26}{space 2} 8059.111{col 37}{space 1}   -0.09{col 46}{space 3}0.928{col 54}{space 4}-16629.98{col 67}{space 3} 15169.45
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.08895{col 26}{space 2} 5.799801{col 37}{space 1}   -2.60{col 46}{space 3}0.010{col 54}{space 4}-26.53179{col 67}{space 3} -3.64612
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1129.446{col 26}{space 2} 579.0366{col 37}{space 1}    1.95{col 46}{space 3}0.053{col 54}{space 4}-12.93899{col 67}{space 3}  2271.83
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 9203.449{col 26}{space 2} 20246.56{col 37}{space 1}    0.45{col 46}{space 3}0.651{col 54}{space 4}-31314.62{col 67}{space 3} 49721.52
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-229338.6{col 26}{space 2} 578055.9{col 37}{space 1}   -0.40{col 46}{space 3}0.692{col 54}{space 4} -1369796{col 67}{space 3} 911118.8
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 654.5124{col 26}{space 2} 1027.067{col 37}{space 1}    0.64{col 46}{space 3}0.525{col 54}{space 4} -1372.34{col 67}{space 3} 2681.365
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}  185.507{col 26}{space 2} 169.5418{col 37}{space 1}    1.09{col 46}{space 3}0.275{col 54}{space 4}-148.9896{col 67}{space 3} 520.0036
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-7186.731{col 26}{space 2} 2975.839{col 37}{space 1}   -2.42{col 46}{space 3}0.017{col 54}{space 4}-13057.89{col 67}{space 3}-1315.571
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   926128{col 26}{space 2} 584540.1{col 37}{space 1}    1.58{col 46}{space 3}0.115{col 54}{space 4}-227127.6{col 67}{space 3}  2079384
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid   
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0445
{txt}{col 49}Largest FMI{col 67}= {res}    0.4037
{txt}{col 49}Complete DF{col 67}= {res}       187
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     24.14
{txt}{col 49}        avg{col 67}= {res}    164.10
{txt}{col 49}        max{col 67}= {res}    184.92
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  183.0{txt}){col 67}= {res}      9.36
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 3872.549{col 26}{space 2} 7405.028{col 37}{space 1}    0.52{col 46}{space 3}0.602{col 54}{space 4}-10736.76{col 67}{space 3} 18481.86
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 67338.32{col 26}{space 2} 8097.901{col 37}{space 1}    8.32{col 46}{space 3}0.000{col 54}{space 4} 51319.68{col 67}{space 3} 83356.95
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-614.7976{col 26}{space 2} 429.3068{col 37}{space 1}   -1.43{col 46}{space 3}0.154{col 54}{space 4}-1461.807{col 67}{space 3} 232.2116
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-14888.75{col 26}{space 2} 6964.318{col 37}{space 1}   -2.14{col 46}{space 3}0.034{col 54}{space 4}-28631.39{col 67}{space 3}-1146.106
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-2080.677{col 26}{space 2}  7162.85{col 37}{space 1}   -0.29{col 46}{space 3}0.772{col 54}{space 4}-16212.36{col 67}{space 3}    12051
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.27512{col 26}{space 2} 5.153134{col 37}{space 1}   -2.77{col 46}{space 3}0.006{col 54}{space 4} -24.4422{col 67}{space 3}-4.108038
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 856.9631{col 26}{space 2} 513.7077{col 37}{space 1}    1.67{col 46}{space 3}0.097{col 54}{space 4}-156.5184{col 67}{space 3} 1870.445
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-7377.307{col 26}{space 2} 20119.93{col 37}{space 1}   -0.37{col 46}{space 3}0.717{col 54}{space 4} -48890.3{col 67}{space 3} 34135.69
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-73890.43{col 26}{space 2} 514497.2{col 37}{space 1}   -0.14{col 46}{space 3}0.886{col 54}{space 4} -1088997{col 67}{space 3} 941215.9
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 42.32328{col 26}{space 2} 934.6451{col 37}{space 1}    0.05{col 46}{space 3}0.964{col 54}{space 4}-1805.126{col 67}{space 3} 1889.772
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 104.5701{col 26}{space 2} 150.3746{col 37}{space 1}    0.70{col 46}{space 3}0.488{col 54}{space 4} -192.104{col 67}{space 3} 401.2442
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-6707.748{col 26}{space 2} 2645.623{col 37}{space 1}   -2.54{col 46}{space 3}0.012{col 54}{space 4}-11927.52{col 67}{space 3}-1487.972
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   519146{col 26}{space 2} 520385.5{col 37}{space 1}    1.00{col 46}{space 3}0.320{col 54}{space 4}-507589.6{col 67}{space 3}  1545882
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. ***********MODEL 5: MODEL2+OXIDATIVE STRESS******
. 
. //Overall//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0125
{txt}{col 49}Largest FMI{col 67}= {res}    0.1063
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    108.38
{txt}{col 49}        avg{col 67}= {res}    159.25
{txt}{col 49}        max{col 67}= {res}    165.93
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  165.8{txt}){col 67}= {res}     14.02
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-2779.111{col 26}{space 2} 17176.94{col 37}{space 1}   -0.16{col 46}{space 3}0.872{col 54}{space 4}-36694.58{col 67}{space 3} 31136.36
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 139676.5{col 26}{space 2} 14209.93{col 37}{space 1}    9.83{col 46}{space 3}0.000{col 54}{space 4} 111619.9{col 67}{space 3}   167733
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2287.513{col 26}{space 2}  938.798{col 37}{space 1}   -2.44{col 46}{space 3}0.016{col 54}{space 4}-4141.052{col 67}{space 3}-433.9744
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-65204.13{col 26}{space 2} 16574.32{col 37}{space 1}   -3.93{col 46}{space 3}0.000{col 54}{space 4}-97941.41{col 67}{space 3}-32466.85
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-1857.318{col 26}{space 2} 16088.83{col 37}{space 1}   -0.12{col 46}{space 3}0.908{col 54}{space 4}-33622.83{col 67}{space 3}  29908.2
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-19.84112{col 26}{space 2} 11.78951{col 37}{space 1}   -1.68{col 46}{space 3}0.094{col 54}{space 4}-43.11851{col 67}{space 3} 3.436271
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 663.6866{col 26}{space 2} 1158.842{col 37}{space 1}    0.57{col 46}{space 3}0.568{col 54}{space 4}-1624.301{col 67}{space 3} 2951.675
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 785.0093{col 26}{space 2} 816.4853{col 37}{space 1}    0.96{col 46}{space 3}0.338{col 54}{space 4}-833.3427{col 67}{space 3} 2403.361
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-5145.254{col 26}{space 2} 27481.76{col 37}{space 1}   -0.19{col 46}{space 3}0.852{col 54}{space 4}-59404.25{col 67}{space 3} 49113.74
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-2425.682{col 26}{space 2} 3533.221{col 37}{space 1}   -0.69{col 46}{space 3}0.493{col 54}{space 4}-9402.651{col 67}{space 3} 4551.286
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1181464{col 26}{space 2} 153605.8{col 37}{space 1}    7.69{col 46}{space 3}0.000{col 54}{space 4} 878184.3{col 67}{space 3}  1484745
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0072
{txt}{col 49}Largest FMI{col 67}= {res}    0.0643
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    135.64
{txt}{col 49}        avg{col 67}= {res}    162.53
{txt}{col 49}        max{col 67}= {res}    165.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  165.9{txt}){col 67}= {res}     15.85
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-4428.886{col 26}{space 2}  9213.59{col 37}{space 1}   -0.48{col 46}{space 3}0.631{col 54}{space 4}-22620.31{col 67}{space 3} 13762.54
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 71394.66{col 26}{space 2} 7625.658{col 37}{space 1}    9.36{col 46}{space 3}0.000{col 54}{space 4} 56338.64{col 67}{space 3} 86450.68
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1950.052{col 26}{space 2} 504.1572{col 37}{space 1}   -3.87{col 46}{space 3}0.000{col 54}{space 4}-2945.441{col 67}{space 3}-954.6634
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-47412.05{col 26}{space 2} 8853.027{col 37}{space 1}   -5.36{col 46}{space 3}0.000{col 54}{space 4}-64894.32{col 67}{space 3}-29929.77
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-2680.073{col 26}{space 2} 8639.521{col 37}{space 1}   -0.31{col 46}{space 3}0.757{col 54}{space 4}-19737.67{col 67}{space 3} 14377.52
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-7.086875{col 26}{space 2} 6.328869{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-19.58251{col 67}{space 3} 5.408762
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  588.946{col 26}{space 2} 622.3618{col 37}{space 1}    0.95{col 46}{space 3}0.345{col 54}{space 4}-639.8234{col 67}{space 3} 1817.715
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 264.2693{col 26}{space 2} 429.4673{col 37}{space 1}    0.62{col 46}{space 3}0.539{col 54}{space 4}-585.0484{col 67}{space 3} 1113.587
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 3124.707{col 26}{space 2} 14761.92{col 37}{space 1}    0.21{col 46}{space 3}0.833{col 54}{space 4}-26020.63{col 67}{space 3} 32270.05
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 409.8111{col 26}{space 2} 1892.812{col 37}{space 1}    0.22{col 46}{space 3}0.829{col 54}{space 4}-3327.582{col 67}{space 3} 4147.204
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 687814.1{col 26}{space 2} 82464.12{col 37}{space 1}    8.34{col 46}{space 3}0.000{col 54}{space 4} 524998.5{col 67}{space 3} 850629.7
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0143
{txt}{col 49}Largest FMI{col 67}= {res}    0.1145
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    103.40
{txt}{col 49}        avg{col 67}= {res}    158.28
{txt}{col 49}        max{col 67}= {res}    165.88
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  165.8{txt}){col 67}= {res}      9.50
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 43.59935{col 26}{space 2} 8336.053{col 37}{space 1}    0.01{col 46}{space 3}0.996{col 54}{space 4}-16416.11{col 67}{space 3} 16503.31
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 57111.78{col 26}{space 2} 6897.494{col 37}{space 1}    8.28{col 46}{space 3}0.000{col 54}{space 4} 43492.83{col 67}{space 3} 70730.73
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}  -733.86{col 26}{space 2} 455.3875{col 37}{space 1}   -1.61{col 46}{space 3}0.109{col 54}{space 4}-1632.972{col 67}{space 3} 165.2524
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-14939.33{col 26}{space 2} 8058.579{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4}-30858.71{col 67}{space 3}  980.044
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-3870.435{col 26}{space 2} 7802.985{col 37}{space 1}   -0.50{col 46}{space 3}0.621{col 54}{space 4}-19276.59{col 67}{space 3} 11535.72
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-10.59031{col 26}{space 2} 5.717619{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4}-21.87931{col 67}{space 3} .6987009
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  183.462{col 26}{space 2} 562.0921{col 37}{space 1}    0.33{col 46}{space 3}0.745{col 54}{space 4}-926.3261{col 67}{space 3}  1293.25
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}  499.862{col 26}{space 2} 397.5201{col 37}{space 1}    1.26{col 46}{space 3}0.211{col 54}{space 4}-288.4892{col 67}{space 3} 1288.213
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} -243.924{col 26}{space 2} 13326.39{col 37}{space 1}   -0.02{col 46}{space 3}0.985{col 54}{space 4}-26555.13{col 67}{space 3} 26067.28
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-2059.328{col 26}{space 2}  1715.73{col 37}{space 1}   -1.20{col 46}{space 3}0.232{col 54}{space 4}-5447.513{col 67}{space 3} 1328.858
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 446903.5{col 26}{space 2} 74502.92{col 37}{space 1}    6.00{col 46}{space 3}0.000{col 54}{space 4} 299803.6{col 67}{space 3} 594003.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //AFRICAN-AMERICAN//
. 
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0401
{txt}{col 49}Largest FMI{col 67}= {res}    0.2493
{txt}{col 49}Complete DF{col 67}= {res}        71
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     31.89
{txt}{col 49}        avg{col 67}= {res}     63.53
{txt}{col 49}        max{col 67}= {res}     68.51
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   68.6{txt}){col 67}= {res}      5.44
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-38883.17{col 26}{space 2} 25550.38{col 37}{space 1}   -1.52{col 46}{space 3}0.133{col 54}{space 4}-89864.61{col 67}{space 3} 12098.27
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 116809.7{col 26}{space 2} 21775.72{col 37}{space 1}    5.36{col 46}{space 3}0.000{col 54}{space 4} 73339.87{col 67}{space 3} 160279.4
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1794.824{col 26}{space 2} 1528.272{col 37}{space 1}   -1.17{col 46}{space 3}0.245{col 54}{space 4}-4847.118{col 67}{space 3} 1257.469
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}  29692.2{col 26}{space 2} 25328.36{col 37}{space 1}    1.17{col 46}{space 3}0.245{col 54}{space 4}-20848.75{col 67}{space 3} 80233.16
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-22.48568{col 26}{space 2} 20.22707{col 37}{space 1}   -1.11{col 46}{space 3}0.270{col 54}{space 4}-62.86368{col 67}{space 3} 17.89231
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1057.483{col 26}{space 2} 1926.002{col 37}{space 1}    0.55{col 46}{space 3}0.585{col 54}{space 4}-2786.584{col 67}{space 3} 4901.549
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 2445.271{col 26}{space 2} 1749.511{col 37}{space 1}    1.40{col 46}{space 3}0.172{col 54}{space 4}-1118.852{col 67}{space 3} 6009.394
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 31058.65{col 26}{space 2} 39364.95{col 37}{space 1}    0.79{col 46}{space 3}0.433{col 54}{space 4}-47511.18{col 67}{space 3} 109628.5
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 3038.338{col 26}{space 2} 6027.052{col 37}{space 1}    0.50{col 46}{space 3}0.616{col 54}{space 4}-8986.838{col 67}{space 3} 15063.51
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   885382{col 26}{space 2} 213695.1{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} 458753.3{col 67}{space 3}  1312011
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0308
{txt}{col 49}Largest FMI{col 67}= {res}    0.2207
{txt}{col 49}Complete DF{col 67}= {res}        71
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     35.55
{txt}{col 49}        avg{col 67}= {res}     64.68
{txt}{col 49}        max{col 67}= {res}     68.75
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   68.7{txt}){col 67}= {res}      5.46
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-20658.03{col 26}{space 2} 14618.16{col 37}{space 1}   -1.41{col 46}{space 3}0.162{col 54}{space 4} -49823.4{col 67}{space 3} 8507.339
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 57827.55{col 26}{space 2}  12418.1{col 37}{space 1}    4.66{col 46}{space 3}0.000{col 54}{space 4} 33045.95{col 67}{space 3} 82609.15
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1757.307{col 26}{space 2} 869.7334{col 37}{space 1}   -2.02{col 46}{space 3}0.047{col 54}{space 4}-3493.411{col 67}{space 3}-21.20291
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 15483.32{col 26}{space 2} 14491.22{col 37}{space 1}    1.07{col 46}{space 3}0.289{col 54}{space 4}-13430.05{col 67}{space 3}  44396.7
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.44713{col 26}{space 2}  11.5624{col 37}{space 1}   -1.25{col 46}{space 3}0.216{col 54}{space 4}-37.52412{col 67}{space 3} 8.629865
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 780.3921{col 26}{space 2} 1099.756{col 37}{space 1}    0.71{col 46}{space 3}0.480{col 54}{space 4}-1414.097{col 67}{space 3} 2974.881
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 1001.387{col 26}{space 2} 987.3604{col 37}{space 1}    1.01{col 46}{space 3}0.317{col 54}{space 4}-1001.944{col 67}{space 3} 3004.719
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 17079.28{col 26}{space 2} 22457.73{col 37}{space 1}    0.76{col 46}{space 3}0.450{col 54}{space 4}-27732.63{col 67}{space 3}  61891.2
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 3026.167{col 26}{space 2}  3450.29{col 37}{space 1}    0.88{col 46}{space 3}0.384{col 54}{space 4}-3857.426{col 67}{space 3}  9909.76
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 540912.2{col 26}{space 2} 121894.7{col 37}{space 1}    4.44{col 46}{space 3}0.000{col 54}{space 4} 297636.8{col 67}{space 3} 784187.6
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0344
{txt}{col 49}Largest FMI{col 67}= {res}    0.1857
{txt}{col 49}Complete DF{col 67}= {res}        71
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     40.61
{txt}{col 49}        avg{col 67}= {res}     64.51
{txt}{col 49}        max{col 67}= {res}     68.48
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   68.7{txt}){col 67}= {res}      3.98
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0004

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-17015.66{col 26}{space 2}    11835{col 37}{space 1}   -1.44{col 46}{space 3}0.155{col 54}{space 4}-40631.15{col 67}{space 3} 6599.827
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 47141.13{col 26}{space 2} 10089.31{col 37}{space 1}    4.67{col 46}{space 3}0.000{col 54}{space 4} 26999.09{col 67}{space 3} 67283.16
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -516.874{col 26}{space 2} 705.3349{col 37}{space 1}   -0.73{col 46}{space 3}0.466{col 54}{space 4}-1925.237{col 67}{space 3} 891.4887
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 8077.908{col 26}{space 2} 11722.04{col 37}{space 1}    0.69{col 46}{space 3}0.493{col 54}{space 4}-15312.34{col 67}{space 3} 31468.16
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -7.46661{col 26}{space 2} 9.335898{col 37}{space 1}   -0.80{col 46}{space 3}0.427{col 54}{space 4}-26.09971{col 67}{space 3} 11.16649
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 193.3534{col 26}{space 2} 891.6077{col 37}{space 1}    0.22{col 46}{space 3}0.829{col 54}{space 4}-1586.192{col 67}{space 3} 1972.899
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 1270.667{col 26}{space 2} 782.9381{col 37}{space 1}    1.62{col 46}{space 3}0.112{col 54}{space 4}-310.9699{col 67}{space 3} 2852.305
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 12173.89{col 26}{space 2} 18260.56{col 37}{space 1}    0.67{col 46}{space 3}0.507{col 54}{space 4}-24277.89{col 67}{space 3} 48625.68
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 281.4239{col 26}{space 2} 2790.414{col 37}{space 1}    0.10{col 46}{space 3}0.920{col 54}{space 4}-5286.055{col 67}{space 3} 5848.903
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   359706{col 26}{space 2} 98789.15{col 37}{space 1}    3.64{col 46}{space 3}0.001{col 54}{space 4} 162498.5{col 67}{space 3} 556913.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0113
{txt}{col 49}Largest FMI{col 67}= {res}    0.0894
{txt}{col 49}Complete DF{col 67}= {res}       109
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     83.41
{txt}{col 49}        avg{col 67}= {res}    104.28
{txt}{col 49}        max{col 67}= {res}    107.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  106.9{txt}){col 67}= {res}     11.36
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 22955.02{col 26}{space 2} 20751.76{col 37}{space 1}    1.11{col 46}{space 3}0.271{col 54}{space 4}-18185.72{col 67}{space 3} 64095.77
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 152474.2{col 26}{space 2} 17479.98{col 37}{space 1}    8.72{col 46}{space 3}0.000{col 54}{space 4} 117822.1{col 67}{space 3} 187126.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2510.202{col 26}{space 2} 1125.001{col 37}{space 1}   -2.23{col 46}{space 3}0.028{col 54}{space 4}-4740.397{col 67}{space 3}-280.0075
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}   -16205{col 26}{space 2} 19143.73{col 37}{space 1}   -0.85{col 46}{space 3}0.399{col 54}{space 4}-54155.49{col 67}{space 3}  21745.5
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-30.19302{col 26}{space 2} 13.29947{col 37}{space 1}   -2.27{col 46}{space 3}0.025{col 54}{space 4}-56.55837{col 67}{space 3}-3.827671
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 344.7047{col 26}{space 2} 1308.637{col 37}{space 1}    0.26{col 46}{space 3}0.793{col 54}{space 4}-2249.544{col 67}{space 3} 2938.953
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 226.9509{col 26}{space 2} 899.6593{col 37}{space 1}    0.25{col 46}{space 3}0.801{col 54}{space 4}-1562.305{col 67}{space 3} 2016.206
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-24284.87{col 26}{space 2} 35344.55{col 37}{space 1}   -0.69{col 46}{space 3}0.494{col 54}{space 4}-94353.07{col 67}{space 3} 45783.34
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-3730.776{col 26}{space 2}  4163.59{col 37}{space 1}   -0.90{col 46}{space 3}0.372{col 54}{space 4}-11986.61{col 67}{space 3} 4525.057
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1201027{col 26}{space 2} 188210.7{col 37}{space 1}    6.38{col 46}{space 3}0.000{col 54}{space 4} 827921.4{col 67}{space 3}  1574133
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0094
{txt}{col 49}Largest FMI{col 67}= {res}    0.0794
{txt}{col 49}Complete DF{col 67}= {res}       109
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     86.83
{txt}{col 49}        avg{col 67}= {res}    104.74
{txt}{col 49}        max{col 67}= {res}    107.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  107.0{txt}){col 67}= {res}     11.91
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  6482.82{col 26}{space 2} 10938.71{col 37}{space 1}    0.59{col 46}{space 3}0.555{col 54}{space 4}-15202.95{col 67}{space 3} 28168.59
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 79904.92{col 26}{space 2} 9220.325{col 37}{space 1}    8.67{col 46}{space 3}0.000{col 54}{space 4} 61626.66{col 67}{space 3} 98183.18
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1944.643{col 26}{space 2} 593.3732{col 37}{space 1}   -3.28{col 46}{space 3}0.001{col 54}{space 4}-3120.941{col 67}{space 3}-768.3446
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-11488.95{col 26}{space 2} 10097.16{col 37}{space 1}   -1.14{col 46}{space 3}0.258{col 54}{space 4}-31505.53{col 67}{space 3} 8527.621
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-12.42213{col 26}{space 2} 7.013772{col 37}{space 1}   -1.77{col 46}{space 3}0.079{col 54}{space 4}-26.32643{col 67}{space 3} 1.482165
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 417.9674{col 26}{space 2} 690.4356{col 37}{space 1}    0.61{col 46}{space 3}0.546{col 54}{space 4}-950.7643{col 67}{space 3} 1786.699
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 110.2474{col 26}{space 2} 472.1522{col 37}{space 1}    0.23{col 46}{space 3}0.816{col 54}{space 4} -828.232{col 67}{space 3} 1048.727
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-7578.787{col 26}{space 2} 18639.43{col 37}{space 1}   -0.41{col 46}{space 3}0.685{col 54}{space 4}-44530.02{col 67}{space 3} 29372.45
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-503.5656{col 26}{space 2} 2190.183{col 37}{space 1}   -0.23{col 46}{space 3}0.819{col 54}{space 4} -4845.95{col 67}{space 3} 3838.819
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 683045.6{col 26}{space 2} 99271.99{col 37}{space 1}    6.88{col 46}{space 3}0.000{col 54}{space 4} 486250.7{col 67}{space 3} 879840.6
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0160
{txt}{col 49}Largest FMI{col 67}= {res}    0.1284
{txt}{col 49}Complete DF{col 67}= {res}       109
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     70.37
{txt}{col 49}        avg{col 67}= {res}    102.85
{txt}{col 49}        max{col 67}= {res}    106.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  106.8{txt}){col 67}= {res}      7.91
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 13599.41{col 26}{space 2} 10470.57{col 37}{space 1}    1.30{col 46}{space 3}0.197{col 54}{space 4}-7159.928{col 67}{space 3} 34358.75
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 61641.27{col 26}{space 2} 8806.013{col 37}{space 1}    7.00{col 46}{space 3}0.000{col 54}{space 4} 44184.22{col 67}{space 3} 79098.32
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-905.3641{col 26}{space 2} 566.7213{col 37}{space 1}   -1.60{col 46}{space 3}0.113{col 54}{space 4}-2028.836{col 67}{space 3} 218.1074
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-6941.183{col 26}{space 2} 9642.785{col 37}{space 1}   -0.72{col 46}{space 3}0.473{col 54}{space 4}-26057.09{col 67}{space 3} 12174.73
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.46828{col 26}{space 2} 6.701522{col 37}{space 1}   -2.31{col 46}{space 3}0.023{col 54}{space 4}-28.75381{col 67}{space 3}-2.182745
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 209.6811{col 26}{space 2} 659.3608{col 37}{space 1}    0.32{col 46}{space 3}0.751{col 54}{space 4}-1097.453{col 67}{space 3} 1516.815
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 157.5286{col 26}{space 2} 462.1254{col 37}{space 1}    0.34{col 46}{space 3}0.734{col 54}{space 4}-764.0655{col 67}{space 3} 1079.123
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-4408.769{col 26}{space 2} 17809.02{col 37}{space 1}   -0.25{col 46}{space 3}0.805{col 54}{space 4}-39714.42{col 67}{space 3} 30896.88
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-2486.316{col 26}{space 2} 2097.855{col 37}{space 1}   -1.19{col 46}{space 3}0.239{col 54}{space 4}-6646.158{col 67}{space 3} 1673.527
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   445565{col 26}{space 2} 94800.34{col 37}{space 1}    4.70{col 46}{space 3}0.000{col 54}{space 4} 257633.9{col 67}{space 3} 633496.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. **********INTERACTION BY Race***************
. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0164
{txt}{col 49}Largest FMI{col 67}= {res}    0.1558
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     80.86
{txt}{col 49}        avg{col 67}= {res}    157.18
{txt}{col 49}        max{col 67}= {res}    164.91
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  164.7{txt}){col 67}= {res}     13.64
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 25188.86{col 28}{space 2}  20318.7{col 39}{space 1}    1.24{col 48}{space 3}0.217{col 56}{space 4}-14931.25{col 69}{space 3} 65308.96
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 63569.71{col 28}{space 2} 54368.52{col 39}{space 1}    1.17{col 48}{space 3}0.244{col 56}{space 4}-43785.19{col 69}{space 3} 170924.6
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-65390.83{col 28}{space 2} 26289.04{col 39}{space 1}   -2.49{col 48}{space 3}0.014{col 56}{space 4}-117297.7{col 69}{space 3}-13483.95
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 138602.8{col 28}{space 2} 14004.33{col 39}{space 1}    9.90{col 48}{space 3}0.000{col 56}{space 4} 110950.9{col 69}{space 3} 166254.7
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2154.685{col 28}{space 2} 925.9735{col 39}{space 1}   -2.33{col 48}{space 3}0.021{col 56}{space 4}-3982.979{col 69}{space 3}-326.3911
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -2459.86{col 28}{space 2} 15853.66{col 39}{space 1}   -0.16{col 48}{space 3}0.877{col 56}{space 4}-33762.67{col 69}{space 3} 28842.95
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-21.29882{col 28}{space 2} 11.63585{col 39}{space 1}   -1.83{col 48}{space 3}0.069{col 56}{space 4}-44.27423{col 69}{space 3} 1.676583
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 471.1598{col 28}{space 2} 1143.952{col 39}{space 1}    0.41{col 48}{space 3}0.681{col 56}{space 4}-1787.531{col 69}{space 3}  2729.85
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 700.9735{col 28}{space 2} 826.1941{col 39}{space 1}    0.85{col 48}{space 3}0.399{col 56}{space 4}-942.9379{col 69}{space 3} 2344.885
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2}-602.6388{col 28}{space 2} 27129.12{col 39}{space 1}   -0.02{col 48}{space 3}0.982{col 56}{space 4}-54167.81{col 69}{space 3} 52962.54
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-2534.914{col 28}{space 2} 3480.428{col 39}{space 1}   -0.73{col 48}{space 3}0.467{col 56}{space 4}-9407.965{col 69}{space 3} 4338.137
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1043828{col 28}{space 2} 150335.7{col 39}{space 1}    6.94{col 48}{space 3}0.000{col 56}{space 4}   746992{col 69}{space 3}  1340665
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0104
{txt}{col 49}Largest FMI{col 67}= {res}    0.1050
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    108.71
{txt}{col 49}        avg{col 67}= {res}    159.92
{txt}{col 49}        max{col 67}= {res}    164.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  164.9{txt}){col 67}= {res}     15.21
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 9550.001{col 28}{space 2} 10929.87{col 39}{space 1}    0.87{col 48}{space 3}0.384{col 56}{space 4}-12030.96{col 69}{space 3} 31130.96
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 16947.33{col 28}{space 2} 29231.86{col 39}{space 1}    0.58{col 48}{space 3}0.563{col 56}{space 4}-40771.18{col 69}{space 3} 74665.84
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-32682.11{col 28}{space 2} 14151.39{col 39}{space 1}   -2.31{col 48}{space 3}0.022{col 56}{space 4}-60623.36{col 69}{space 3}-4740.865
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 70858.08{col 28}{space 2} 7533.398{col 39}{space 1}    9.41{col 48}{space 3}0.000{col 56}{space 4} 55983.53{col 69}{space 3} 85732.63
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1883.668{col 28}{space 2} 498.5511{col 39}{space 1}   -3.78{col 48}{space 3}0.000{col 56}{space 4} -2868.03{col 69}{space 3}-899.3048
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2981.499{col 28}{space 2} 8533.561{col 39}{space 1}   -0.35{col 48}{space 3}0.727{col 56}{space 4}-19830.72{col 69}{space 3} 13867.72
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-7.815753{col 28}{space 2} 6.260659{col 39}{space 1}   -1.25{col 48}{space 3}0.214{col 56}{space 4}-20.17741{col 69}{space 3} 4.545901
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 492.7056{col 28}{space 2} 615.9102{col 39}{space 1}    0.80{col 48}{space 3}0.425{col 56}{space 4}-723.3805{col 69}{space 3} 1708.792
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 222.1268{col 28}{space 2} 433.4874{col 39}{space 1}    0.51{col 48}{space 3}0.609{col 56}{space 4}-637.0564{col 69}{space 3}  1081.31
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 5395.427{col 28}{space 2} 14608.88{col 39}{space 1}    0.37{col 48}{space 3}0.712{col 56}{space 4}-23449.06{col 69}{space 3} 34239.91
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} 355.2043{col 28}{space 2} 1869.059{col 39}{space 1}    0.19{col 48}{space 3}0.850{col 56}{space 4}-3335.458{col 69}{space 3} 4045.867
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 604203.4{col 28}{space 2}  80912.9{col 39}{space 1}    7.47{col 48}{space 3}0.000{col 56}{space 4} 444443.6{col 69}{space 3} 763963.3
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0174
{txt}{col 49}Largest FMI{col 67}= {res}    0.1557
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     80.86
{txt}{col 49}        avg{col 67}= {res}    156.89
{txt}{col 49}        max{col 67}= {res}    164.88
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  164.7{txt}){col 67}= {res}      9.24
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 12092.58{col 28}{space 2} 9896.528{col 39}{space 1}    1.22{col 48}{space 3}0.224{col 56}{space 4}-7448.814{col 69}{space 3} 31633.97
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 40543.77{col 28}{space 2} 26494.97{col 39}{space 1}    1.53{col 48}{space 3}0.128{col 56}{space 4}-11774.18{col 69}{space 3} 92861.73
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-28173.19{col 28}{space 2} 12803.73{col 39}{space 1}   -2.20{col 48}{space 3}0.029{col 56}{space 4}-53454.02{col 69}{space 3}-2892.359
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 56649.13{col 28}{space 2} 6824.455{col 39}{space 1}    8.30{col 48}{space 3}0.000{col 56}{space 4} 43173.72{col 69}{space 3} 70124.54
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -676.625{col 28}{space 2} 450.8895{col 39}{space 1}   -1.50{col 48}{space 3}0.135{col 56}{space 4}-1566.893{col 69}{space 3} 213.6425
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4129.678{col 28}{space 2} 7718.637{col 39}{space 1}   -0.54{col 48}{space 3}0.593{col 56}{space 4}-19370.08{col 69}{space 3} 11110.72
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-11.21791{col 28}{space 2}  5.66422{col 39}{space 1}   -1.98{col 48}{space 3}0.049{col 56}{space 4}-22.40214{col 69}{space 3}-.0336846
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 100.5366{col 28}{space 2} 557.0006{col 39}{space 1}    0.18{col 48}{space 3}0.857{col 56}{space 4}-999.2472{col 69}{space 3}  1200.32
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 463.8435{col 28}{space 2} 402.1342{col 39}{space 1}    1.15{col 48}{space 3}0.252{col 56}{space 4} -336.298{col 69}{space 3} 1263.985
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 1712.736{col 28}{space 2} 13206.17{col 39}{space 1}    0.13{col 48}{space 3}0.897{col 56}{space 4}-24362.28{col 69}{space 3} 27787.75
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-2106.361{col 28}{space 2} 1696.585{col 39}{space 1}   -1.24{col 48}{space 3}0.216{col 56}{space 4}-5456.896{col 69}{space 3} 1244.174
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 400753.9{col 28}{space 2} 73198.62{col 39}{space 1}    5.47{col 48}{space 3}0.000{col 56}{space 4}   256223{col 69}{space 3} 545284.7
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***********MODEL 6: MODEL 2+lifestyle/health-related factors*******  
. 
. 
. //Overall//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0017
{txt}{col 49}Largest FMI{col 67}= {res}    0.0173
{txt}{col 49}Complete DF{col 67}= {res}       190
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    182.47
{txt}{col 49}        avg{col 67}= {res}    187.45
{txt}{col 49}        max{col 67}= {res}    188.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  188.0{txt}){col 67}= {res}     18.73
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 10452.07{col 26}{space 2} 15491.43{col 37}{space 1}    0.67{col 46}{space 3}0.501{col 54}{space 4}-20107.31{col 67}{space 3} 41011.45
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 137538.5{col 26}{space 2} 13062.17{col 37}{space 1}   10.53{col 46}{space 3}0.000{col 54}{space 4} 111771.3{col 67}{space 3} 163305.8
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2628.838{col 26}{space 2} 855.7072{col 37}{space 1}   -3.07{col 46}{space 3}0.002{col 54}{space 4} -4316.86{col 67}{space 3}-940.8166
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-64530.84{col 26}{space 2} 13705.46{col 37}{space 1}   -4.71{col 46}{space 3}0.000{col 54}{space 4}-91567.15{col 67}{space 3}-37494.54
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 4538.239{col 26}{space 2} 15066.43{col 37}{space 1}    0.30{col 46}{space 3}0.764{col 54}{space 4}-25182.73{col 67}{space 3}  34259.2
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-31.40891{col 26}{space 2}  10.6726{col 37}{space 1}   -2.94{col 46}{space 3}0.004{col 54}{space 4}-52.46234{col 67}{space 3}-10.35548
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1075.099{col 26}{space 2} 997.4789{col 37}{space 1}    1.08{col 46}{space 3}0.282{col 54}{space 4}-892.5922{col 67}{space 3} 3042.789
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 1629.213{col 26}{space 2} 16442.37{col 37}{space 1}    0.10{col 46}{space 3}0.921{col 54}{space 4}-30812.41{col 67}{space 3} 34070.84
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 16074.69{col 26}{space 2}  8563.91{col 37}{space 1}    1.88{col 46}{space 3}0.062{col 54}{space 4}-819.0029{col 67}{space 3} 32968.38
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1127703{col 26}{space 2} 69159.69{col 37}{space 1}   16.31{col 46}{space 3}0.000{col 54}{space 4} 991273.8{col 67}{space 3}  1264131
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0035
{txt}{col 49}Largest FMI{col 67}= {res}    0.0335
{txt}{col 49}Complete DF{col 67}= {res}       190
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    173.54
{txt}{col 49}        avg{col 67}= {res}    186.47
{txt}{col 49}        max{col 67}= {res}    188.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  188.0{txt}){col 67}= {res}     21.29
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2522.062{col 26}{space 2} 8388.166{col 37}{space 1}    0.30{col 46}{space 3}0.764{col 54}{space 4}-14025.05{col 67}{space 3} 19069.18
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 71014.54{col 26}{space 2} 7069.853{col 37}{space 1}   10.04{col 46}{space 3}0.000{col 54}{space 4} 57068.11{col 67}{space 3} 84960.97
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2166.548{col 26}{space 2} 463.3589{col 37}{space 1}   -4.68{col 46}{space 3}0.000{col 54}{space 4}-3080.604{col 67}{space 3}-1252.491
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-46018.23{col 26}{space 2} 7421.367{col 37}{space 1}   -6.20{col 46}{space 3}0.000{col 54}{space 4}-60658.21{col 67}{space 3}-31378.26
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 1580.896{col 26}{space 2} 8155.375{col 37}{space 1}    0.19{col 46}{space 3}0.847{col 54}{space 4}-14506.91{col 67}{space 3}  17668.7
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.67299{col 26}{space 2} 5.778159{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4}-27.07138{col 67}{space 3}-4.274605
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 648.5945{col 26}{space 2} 540.0495{col 37}{space 1}    1.20{col 46}{space 3}0.231{col 54}{space 4}-416.7459{col 67}{space 3} 1713.935
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-4090.032{col 26}{space 2} 8971.541{col 37}{space 1}   -0.46{col 46}{space 3}0.649{col 54}{space 4}-21797.42{col 67}{space 3} 13617.35
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}  10183.8{col 26}{space 2} 4635.555{col 37}{space 1}    2.20{col 46}{space 3}0.029{col 54}{space 4}  1039.41{col 67}{space 3} 19328.18
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 690544.9{col 26}{space 2} 37440.85{col 37}{space 1}   18.44{col 46}{space 3}0.000{col 54}{space 4} 616686.5{col 67}{space 3} 764403.2
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0017
{txt}{col 49}Largest FMI{col 67}= {res}    0.0098
{txt}{col 49}Complete DF{col 67}= {res}       190
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    185.46
{txt}{col 49}        avg{col 67}= {res}    187.64
{txt}{col 49}        max{col 67}= {res}    187.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  188.0{txt}){col 67}= {res}     12.06
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 4939.814{col 26}{space 2} 7546.122{col 37}{space 1}    0.65{col 46}{space 3}0.514{col 54}{space 4}-9946.233{col 67}{space 3} 19825.86
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 56388.29{col 26}{space 2}  6360.83{col 37}{space 1}    8.86{col 46}{space 3}0.000{col 54}{space 4}  43840.5{col 67}{space 3} 68936.08
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-827.2511{col 26}{space 2} 416.7034{col 37}{space 1}   -1.99{col 46}{space 3}0.049{col 54}{space 4}-1649.268{col 67}{space 3}-5.234118
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-17466.76{col 26}{space 2} 6673.664{col 37}{space 1}   -2.62{col 46}{space 3}0.010{col 54}{space 4}-30631.69{col 67}{space 3}-4301.829
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-639.1881{col 26}{space 2}  7337.05{col 37}{space 1}   -0.09{col 46}{space 3}0.931{col 54}{space 4}-15112.73{col 67}{space 3} 13834.36
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.52493{col 26}{space 2} 5.201716{col 37}{space 1}   -2.79{col 46}{space 3}0.006{col 54}{space 4} -24.7863{col 67}{space 3}-4.263559
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 437.7452{col 26}{space 2} 485.6638{col 37}{space 1}    0.90{col 46}{space 3}0.369{col 54}{space 4}-520.3062{col 67}{space 3} 1395.797
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 7898.218{col 26}{space 2} 7976.059{col 37}{space 1}    0.99{col 46}{space 3}0.323{col 54}{space 4}-7837.251{col 67}{space 3} 23633.69
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 4619.652{col 26}{space 2} 4172.089{col 37}{space 1}    1.11{col 46}{space 3}0.270{col 54}{space 4} -3610.53{col 67}{space 3} 12849.83
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 435077.5{col 26}{space 2} 33678.25{col 37}{space 1}   12.92{col 46}{space 3}0.000{col 54}{space 4} 368641.5{col 67}{space 3} 501513.4
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0018
{txt}{col 49}Largest FMI{col 67}= {res}    0.0167
{txt}{col 49}Complete DF{col 67}= {res}        72
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     68.71
{txt}{col 49}        avg{col 67}= {res}     69.91
{txt}{col 49}        max{col 67}= {res}     70.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   70.1{txt}){col 67}= {res}      6.11
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-32659.45{col 26}{space 2} 26576.48{col 37}{space 1}   -1.23{col 46}{space 3}0.223{col 54}{space 4}-85664.49{col 67}{space 3} 20345.58
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 117085.8{col 26}{space 2} 21309.89{col 37}{space 1}    5.49{col 46}{space 3}0.000{col 54}{space 4} 74585.23{col 67}{space 3} 159586.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1554.024{col 26}{space 2} 1513.703{col 37}{space 1}   -1.03{col 46}{space 3}0.308{col 54}{space 4}-4572.984{col 67}{space 3} 1464.936
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 28238.39{col 26}{space 2} 25331.44{col 37}{space 1}    1.11{col 46}{space 3}0.269{col 54}{space 4} -22282.8{col 67}{space 3} 78759.58
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-32.15693{col 26}{space 2} 19.06074{col 37}{space 1}   -1.69{col 46}{space 3}0.096{col 54}{space 4}-70.17162{col 67}{space 3} 5.857765
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 173.3332{col 26}{space 2} 1865.866{col 37}{space 1}    0.09{col 46}{space 3}0.926{col 54}{space 4}-3547.951{col 67}{space 3} 3894.617
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 6357.423{col 26}{space 2} 23870.34{col 37}{space 1}    0.27{col 46}{space 3}0.791{col 54}{space 4}-41266.18{col 67}{space 3} 53981.02
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 16954.99{col 26}{space 2} 13775.76{col 37}{space 1}    1.23{col 46}{space 3}0.223{col 54}{space 4}-10519.37{col 67}{space 3} 44429.36
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1051746{col 26}{space 2} 98903.93{col 37}{space 1}   10.63{col 46}{space 3}0.000{col 54}{space 4} 854491.5{col 67}{space 3}  1249001
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0014
{txt}{col 49}Largest FMI{col 67}= {res}    0.0102
{txt}{col 49}Complete DF{col 67}= {res}        72
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     69.33
{txt}{col 49}        avg{col 67}= {res}     69.96
{txt}{col 49}        max{col 67}= {res}     70.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   70.1{txt}){col 67}= {res}      6.47
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-14345.49{col 26}{space 2} 15039.08{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 54}{space 4}-44340.14{col 67}{space 3} 15649.16
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 58655.78{col 26}{space 2} 12056.41{col 37}{space 1}    4.87{col 46}{space 3}0.000{col 54}{space 4} 34610.44{col 67}{space 3} 82701.12
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1815.479{col 26}{space 2} 856.4866{col 37}{space 1}   -2.12{col 46}{space 3}0.038{col 54}{space 4}-3523.678{col 67}{space 3}-107.2798
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 14356.66{col 26}{space 2} 14331.54{col 37}{space 1}    1.00{col 46}{space 3}0.320{col 54}{space 4}-14226.23{col 67}{space 3} 42939.56
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-18.30422{col 26}{space 2}  10.7882{col 37}{space 1}   -1.70{col 46}{space 3}0.094{col 54}{space 4}-39.82047{col 67}{space 3} 3.212022
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  238.623{col 26}{space 2} 1055.675{col 37}{space 1}    0.23{col 46}{space 3}0.822{col 54}{space 4}-1866.815{col 67}{space 3} 2344.061
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-6617.126{col 26}{space 2} 13462.53{col 37}{space 1}   -0.49{col 46}{space 3}0.625{col 54}{space 4}-33471.84{col 67}{space 3} 20237.58
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 12285.08{col 26}{space 2} 7795.145{col 37}{space 1}    1.58{col 46}{space 3}0.120{col 54}{space 4}-3261.632{col 67}{space 3} 27831.79
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 628109.3{col 26}{space 2} 55957.08{col 37}{space 1}   11.22{col 46}{space 3}0.000{col 54}{space 4} 516508.2{col 67}{space 3} 739710.4
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0046
{txt}{col 49}Largest FMI{col 67}= {res}    0.0317
{txt}{col 49}Complete DF{col 67}= {res}        72
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     66.98
{txt}{col 49}        avg{col 67}= {res}     69.58
{txt}{col 49}        max{col 67}= {res}     70.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   70.1{txt}){col 67}= {res}      4.33
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0003

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-17190.09{col 26}{space 2} 12351.55{col 37}{space 1}   -1.39{col 46}{space 3}0.168{col 54}{space 4}-41826.66{col 67}{space 3}  7446.48
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 46716.33{col 26}{space 2} 9887.111{col 37}{space 1}    4.72{col 46}{space 3}0.000{col 54}{space 4}    26997{col 67}{space 3} 66435.65
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-259.0766{col 26}{space 2} 703.2345{col 37}{space 1}   -0.37{col 46}{space 3}0.714{col 54}{space 4}-1661.725{col 67}{space 3} 1143.572
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 7898.248{col 26}{space 2} 11754.34{col 37}{space 1}    0.67{col 46}{space 3}0.504{col 54}{space 4} -15545.3{col 67}{space 3} 31341.79
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-12.64985{col 26}{space 2} 8.845899{col 37}{space 1}   -1.43{col 46}{space 3}0.157{col 54}{space 4}-30.29262{col 67}{space 3} 4.992929
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-113.0788{col 26}{space 2} 865.5169{col 37}{space 1}   -0.13{col 46}{space 3}0.896{col 54}{space 4}-1839.288{col 67}{space 3} 1613.131
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 11932.38{col 26}{space 2} 11149.37{col 37}{space 1}    1.07{col 46}{space 3}0.288{col 54}{space 4}-10321.94{col 67}{space 3} 34186.71
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 4376.009{col 26}{space 2} 6390.678{col 37}{space 1}    0.68{col 46}{space 3}0.496{col 54}{space 4}-8369.759{col 67}{space 3} 17121.78
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 429244.1{col 26}{space 2} 45904.68{col 37}{space 1}    9.35{col 46}{space 3}0.000{col 54}{space 4} 337688.3{col 67}{space 3} 520799.9
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0057
{txt}{col 49}Largest FMI{col 67}= {res}    0.0458
{txt}{col 49}Complete DF{col 67}= {res}       110
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     98.43
{txt}{col 49}        avg{col 67}= {res}    106.83
{txt}{col 49}        max{col 67}= {res}    108.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  108.0{txt}){col 67}= {res}     13.21
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  33554.3{col 26}{space 2} 19858.73{col 37}{space 1}    1.69{col 46}{space 3}0.094{col 54}{space 4}-5809.386{col 67}{space 3} 72917.98
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 150452.3{col 26}{space 2} 16888.36{col 37}{space 1}    8.91{col 46}{space 3}0.000{col 54}{space 4} 116975.9{col 67}{space 3} 183928.7
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2631.559{col 26}{space 2} 1126.883{col 37}{space 1}   -2.34{col 46}{space 3}0.021{col 54}{space 4}-4865.242{col 67}{space 3} -397.877
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -9784.57{col 26}{space 2} 19879.29{col 37}{space 1}   -0.49{col 46}{space 3}0.624{col 54}{space 4}-49188.67{col 67}{space 3} 29619.53
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-33.86791{col 26}{space 2} 13.35995{col 37}{space 1}   -2.54{col 46}{space 3}0.013{col 54}{space 4}-60.35008{col 67}{space 3}-7.385734
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1124.929{col 26}{space 2} 1228.353{col 37}{space 1}    0.92{col 46}{space 3}0.362{col 54}{space 4} -1309.92{col 67}{space 3} 3559.777
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 15317.64{col 26}{space 2} 23856.08{col 37}{space 1}    0.64{col 46}{space 3}0.522{col 54}{space 4}-32021.41{col 67}{space 3} 62656.69
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 14773.94{col 26}{space 2}  11424.3{col 37}{space 1}    1.29{col 46}{space 3}0.199{col 54}{space 4}-7870.916{col 67}{space 3}  37418.8
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1018018{col 26}{space 2} 90372.36{col 37}{space 1}   11.26{col 46}{space 3}0.000{col 54}{space 4} 838876.2{col 67}{space 3}  1197160
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0053
{txt}{col 49}Largest FMI{col 67}= {res}    0.0415
{txt}{col 49}Complete DF{col 67}= {res}       110
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     99.66
{txt}{col 49}        avg{col 67}= {res}    106.96
{txt}{col 49}        max{col 67}= {res}    108.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  108.0{txt}){col 67}= {res}     14.15
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 10762.02{col 26}{space 2} 10420.11{col 37}{space 1}    1.03{col 46}{space 3}0.304{col 54}{space 4}-9892.654{col 67}{space 3} 31416.69
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 79846.11{col 26}{space 2} 8859.758{col 37}{space 1}    9.01{col 46}{space 3}0.000{col 54}{space 4} 62284.15{col 67}{space 3} 97408.07
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -1982.41{col 26}{space 2} 591.2507{col 37}{space 1}   -3.35{col 46}{space 3}0.001{col 54}{space 4}-3154.377{col 67}{space 3}-810.4436
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-7521.007{col 26}{space 2} 10429.65{col 37}{space 1}   -0.72{col 46}{space 3}0.472{col 54}{space 4}-28194.35{col 67}{space 3} 13152.33
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.75935{col 26}{space 2} 7.010057{col 37}{space 1}   -2.11{col 46}{space 3}0.038{col 54}{space 4}-28.65478{col 67}{space 3} -.863923
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 718.2054{col 26}{space 2} 644.3826{col 37}{space 1}    1.11{col 46}{space 3}0.268{col 54}{space 4}-559.0919{col 67}{space 3} 1995.503
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 8166.759{col 26}{space 2} 12489.19{col 37}{space 1}    0.65{col 46}{space 3}0.515{col 54}{space 4}-16612.46{col 67}{space 3} 32945.98
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 7808.437{col 26}{space 2} 5993.528{col 37}{space 1}    1.30{col 46}{space 3}0.195{col 54}{space 4}-4071.733{col 67}{space 3} 19688.61
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 616567.1{col 26}{space 2} 47397.65{col 37}{space 1}   13.01{col 46}{space 3}0.000{col 54}{space 4} 522613.2{col 67}{space 3} 710520.9
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0077
{txt}{col 49}Largest FMI{col 67}= {res}    0.0544
{txt}{col 49}Complete DF{col 67}= {res}       110
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     95.81
{txt}{col 49}        avg{col 67}= {res}    106.42
{txt}{col 49}        max{col 67}= {res}    108.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  108.0{txt}){col 67}= {res}      9.14
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 17320.46{col 26}{space 2} 10029.18{col 37}{space 1}    1.73{col 46}{space 3}0.087{col 54}{space 4}-2559.552{col 67}{space 3} 37200.48
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 62101.46{col 26}{space 2} 8525.201{col 37}{space 1}    7.28{col 46}{space 3}0.000{col 54}{space 4} 45202.56{col 67}{space 3} 79000.37
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-915.9004{col 26}{space 2} 568.6588{col 37}{space 1}   -1.61{col 46}{space 3}0.110{col 54}{space 4} -2043.08{col 67}{space 3} 211.2795
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-4806.508{col 26}{space 2}  10034.7{col 37}{space 1}   -0.48{col 46}{space 3}0.633{col 54}{space 4}-24697.06{col 67}{space 3} 15084.04
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-17.21862{col 26}{space 2} 6.753637{col 37}{space 1}   -2.55{col 46}{space 3}0.012{col 54}{space 4}-30.60631{col 67}{space 3}-3.830923
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 515.1626{col 26}{space 2} 620.0113{col 37}{space 1}    0.83{col 46}{space 3}0.408{col 54}{space 4}-713.8323{col 67}{space 3} 1744.158
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 12344.58{col 26}{space 2} 12090.75{col 37}{space 1}    1.02{col 46}{space 3}0.310{col 54}{space 4}-11655.96{col 67}{space 3} 36345.12
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 5271.722{col 26}{space 2} 5766.467{col 37}{space 1}    0.91{col 46}{space 3}0.363{col 54}{space 4}-6158.412{col 67}{space 3} 16701.86
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 393519.5{col 26}{space 2} 45658.63{col 37}{space 1}    8.62{col 46}{space 3}0.000{col 54}{space 4} 303009.2{col 67}{space 3} 484029.8
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. ******************INTERACTION BY Race***********************
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0013
{txt}{col 49}Largest FMI{col 67}= {res}    0.0133
{txt}{col 49}Complete DF{col 67}= {res}       189
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    183.19
{txt}{col 49}        avg{col 67}= {res}    186.64
{txt}{col 49}        max{col 67}= {res}    187.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  187.0{txt}){col 67}= {res}     17.93
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 35151.23{col 28}{space 2} 18273.16{col 39}{space 1}    1.92{col 48}{space 3}0.056{col 56}{space 4}-896.8239{col 69}{space 3} 71199.28
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 56300.59{col 28}{space 2} 50796.04{col 39}{space 1}    1.11{col 48}{space 3}0.269{col 56}{space 4}-43906.36{col 69}{space 3} 156507.5
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-61310.85{col 28}{space 2} 24846.56{col 39}{space 1}   -2.47{col 48}{space 3}0.015{col 56}{space 4}-110326.5{col 69}{space 3} -12295.2
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 137049.6{col 28}{space 2} 12892.58{col 39}{space 1}   10.63{col 48}{space 3}0.000{col 56}{space 4}   111616{col 69}{space 3} 162483.2
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2530.431{col 28}{space 2}  845.355{col 39}{space 1}   -2.99{col 48}{space 3}0.003{col 56}{space 4}-4198.087{col 69}{space 3}-862.7743
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} 4141.716{col 28}{space 2} 14869.46{col 39}{space 1}    0.28{col 48}{space 3}0.781{col 56}{space 4}-25191.71{col 69}{space 3} 33475.14
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-32.26795{col 28}{space 2}  10.5401{col 39}{space 1}   -3.06{col 48}{space 3}0.003{col 56}{space 4}-53.06077{col 69}{space 3}-11.47513
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 971.0294{col 28}{space 2} 985.2524{col 39}{space 1}    0.99{col 48}{space 3}0.326{col 56}{space 4} -972.609{col 69}{space 3} 2914.668
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2} 6830.452{col 28}{space 2} 16338.85{col 39}{space 1}    0.42{col 48}{space 3}0.676{col 56}{space 4}-25406.07{col 69}{space 3} 39066.97
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 15457.63{col 28}{space 2} 8456.011{col 39}{space 1}    1.83{col 48}{space 3}0.069{col 56}{space 4}-1223.809{col 69}{space 3} 32139.08
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1012588{col 28}{space 2} 68676.69{col 39}{space 1}   14.74{col 48}{space 3}0.000{col 56}{space 4} 877107.2{col 69}{space 3}  1148069
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0021
{txt}{col 49}Largest FMI{col 67}= {res}    0.0230
{txt}{col 49}Complete DF{col 67}= {res}       189
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    178.71
{txt}{col 49}        avg{col 67}= {res}    186.22
{txt}{col 49}        max{col 67}= {res}    187.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  187.0{txt}){col 67}= {res}     20.00
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 14059.82{col 28}{space 2}  9930.62{col 39}{space 1}    1.42{col 48}{space 3}0.158{col 56}{space 4}-5530.619{col 69}{space 3} 33650.26
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 10425.45{col 28}{space 2} 27607.23{col 39}{space 1}    0.38{col 48}{space 3}0.706{col 56}{space 4}-44036.21{col 69}{space 3} 64887.11
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-28639.45{col 28}{space 2} 13504.56{col 39}{space 1}   -2.12{col 48}{space 3}0.035{col 56}{space 4}-55280.39{col 69}{space 3} -1998.52
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 70785.96{col 28}{space 2} 7006.437{col 39}{space 1}   10.10{col 48}{space 3}0.000{col 56}{space 4} 56964.15{col 69}{space 3} 84607.76
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2120.617{col 28}{space 2} 459.5489{col 39}{space 1}   -4.61{col 48}{space 3}0.000{col 56}{space 4}-3027.186{col 69}{space 3}-1214.049
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} 1395.751{col 28}{space 2} 8081.432{col 39}{space 1}    0.17{col 48}{space 3}0.863{col 56}{space 4}-14546.73{col 69}{space 3} 17338.24
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-16.07486{col 28}{space 2} 5.727597{col 39}{space 1}   -2.81{col 48}{space 3}0.006{col 56}{space 4}-27.37386{col 69}{space 3}-4.775851
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 599.9256{col 28}{space 2} 535.5192{col 39}{space 1}    1.12{col 48}{space 3}0.264{col 56}{space 4}-456.5115{col 69}{space 3} 1656.363
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2} -1665.69{col 28}{space 2} 8922.865{col 39}{space 1}   -0.19{col 48}{space 3}0.852{col 56}{space 4}-19273.42{col 69}{space 3} 15942.04
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 9895.667{col 28}{space 2} 4595.165{col 39}{space 1}    2.15{col 48}{space 3}0.033{col 56}{space 4} 830.6497{col 69}{space 3} 18960.68
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 620902.6{col 28}{space 2} 37328.37{col 39}{space 1}   16.63{col 48}{space 3}0.000{col 56}{space 4} 547263.4{col 69}{space 3} 694541.7
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0029
{txt}{col 49}Largest FMI{col 67}= {res}    0.0167
{txt}{col 49}Complete DF{col 67}= {res}       189
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    181.77
{txt}{col 49}        avg{col 67}= {res}    186.20
{txt}{col 49}        max{col 67}= {res}    186.93
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  187.0{txt}){col 67}= {res}     11.66
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 16499.52{col 28}{space 2} 8920.919{col 39}{space 1}    1.85{col 48}{space 3}0.066{col 56}{space 4}-1099.444{col 69}{space 3} 34098.49
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}  39085.1{col 28}{space 2} 24781.66{col 39}{space 1}    1.58{col 48}{space 3}0.116{col 56}{space 4}-9802.993{col 69}{space 3} 87973.19
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-28695.54{col 28}{space 2} 12127.27{col 39}{space 1}   -2.37{col 48}{space 3}0.019{col 56}{space 4}-52619.85{col 69}{space 3}-4771.231
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}  56159.7{col 28}{space 2} 6286.236{col 39}{space 1}    8.93{col 48}{space 3}0.000{col 56}{space 4} 43758.62{col 69}{space 3} 68560.79
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-781.1497{col 28}{space 2} 412.3049{col 39}{space 1}   -1.89{col 48}{space 3}0.060{col 56}{space 4}-1594.521{col 69}{space 3} 32.22161
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-824.8997{col 28}{space 2} 7250.598{col 39}{space 1}   -0.11{col 48}{space 3}0.910{col 56}{space 4}-15128.42{col 69}{space 3} 13478.62
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-14.92626{col 28}{space 2} 5.146365{col 39}{space 1}   -2.90{col 48}{space 3}0.004{col 56}{space 4}-25.07892{col 69}{space 3}-4.773604
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 389.1083{col 28}{space 2} 480.4097{col 39}{space 1}    0.81{col 48}{space 3}0.419{col 56}{space 4} -558.614{col 69}{space 3} 1336.831
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2} 10339.28{col 28}{space 2}  7978.46{col 39}{space 1}    1.30{col 48}{space 3}0.197{col 56}{space 4} -5403.02{col 69}{space 3} 26081.59
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 4330.769{col 28}{space 2} 4125.701{col 39}{space 1}    1.05{col 48}{space 3}0.295{col 56}{space 4}-3808.231{col 69}{space 3} 12469.77
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 393930.2{col 28}{space 2} 33516.41{col 39}{space 1}   11.75{col 48}{space 3}0.000{col 56}{space 4} 327810.1{col 69}{space 3} 460050.4
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ////////////////////////////////////////LnNFLw3 exposure/////////////////////////////////////////////
> 
. 
. ***********************LnNFLw3, MODELS 1 AND 2*********************
. 
. *********************AFRICAN-AMERICAN*******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        90
{txt}{hline 13}{c +}{hline 34}   F(5, 84)        = {res}    11.96
{txt}       Model {c |} {res} 4.1954e+11         5  8.3908e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 5.8930e+11        84  7.0155e+09   {txt}R-squared       ={res}    0.4159
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3811
{txt}       Total {c |} {res} 1.0088e+12        89  1.1335e+10   {txt}Root MSE        =   {res}  83759

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-21992.82{col 26}{space 2} 15507.07{col 37}{space 1}   -1.42{col 46}{space 3}0.160{col 67}{space 3}-.1397728
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 123789.7{col 26}{space 2} 18234.79{col 37}{space 1}    6.79{col 46}{space 3}0.000{col 67}{space 3} .5793874
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1358.725{col 26}{space 2} 1143.709{col 37}{space 1}   -1.19{col 46}{space 3}0.238{col 67}{space 3}-.1266819
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 30318.41{col 26}{space 2} 21191.22{col 37}{space 1}    1.43{col 46}{space 3}0.156{col 67}{space 3} .1409005
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -29.5867{col 26}{space 2} 15.39448{col 37}{space 1}   -1.92{col 46}{space 3}0.058{col 67}{space 3}-.1735561
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1054093{col 26}{space 2} 69833.37{col 37}{space 1}   15.09{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        90
{txt}{hline 13}{c +}{hline 34}   F(5, 84)        = {res}    12.40
{txt}       Model {c |} {res} 1.4697e+11         5  2.9393e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.9907e+11        84  2.3699e+09   {txt}R-squared       ={res}    0.4247
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3905
{txt}       Total {c |} {res} 3.4604e+11        89  3.8880e+09   {txt}Root MSE        =   {res}  48681

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} -13544.5{col 26}{space 2} 9012.886{col 37}{space 1}   -1.50{col 46}{space 3}0.137{col 67}{space 3} -.146979
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 63950.02{col 26}{space 2} 10598.27{col 37}{space 1}    6.03{col 46}{space 3}0.000{col 67}{space 3}  .511065
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1485.445{col 26}{space 2} 664.7368{col 37}{space 1}   -2.23{col 46}{space 3}0.028{col 67}{space 3}-.2364777
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 21082.48{col 26}{space 2} 12316.58{col 37}{space 1}    1.71{col 46}{space 3}0.091{col 67}{space 3} .1672932
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-17.80893{col 26}{space 2} 8.947449{col 37}{space 1}   -1.99{col 46}{space 3}0.050{col 67}{space 3}-.1783742
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 629133.9{col 26}{space 2} 40587.95{col 37}{space 1}   15.50{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        90
{txt}{hline 13}{c +}{hline 34}   F(5, 84)        = {res}     8.13
{txt}       Model {c |} {res} 5.9424e+10         5  1.1885e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.2282e+11        84  1.4621e+09   {txt}R-squared       ={res}    0.3261
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2860
{txt}       Total {c |} {res} 1.8224e+11        89  2.0477e+09   {txt}Root MSE        =   {res}  38238

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} -9115.62{col 26}{space 2} 7079.357{col 37}{space 1}   -1.29{col 46}{space 3}0.201{col 67}{space 3}-.1363055
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  49004.1{col 26}{space 2} 8324.628{col 37}{space 1}    5.89{col 46}{space 3}0.000{col 67}{space 3} .5396383
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-278.7181{col 26}{space 2} 522.1313{col 37}{space 1}   -0.53{col 46}{space 3}0.595{col 67}{space 3}-.0611412
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 4328.296{col 26}{space 2} 9674.311{col 37}{space 1}    0.45{col 46}{space 3}0.656{col 67}{space 3}  .047327
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-9.023814{col 26}{space 2} 7.027959{col 37}{space 1}   -1.28{col 46}{space 3}0.203{col 67}{space 3}-.1245429
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 420560.4{col 26}{space 2} 31880.64{col 37}{space 1}   13.19{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.0281
{txt}{col 49}Largest FMI{col 67}= {res}    0.1788
{txt}{col 49}Complete DF{col 67}= {res}        83
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     46.52
{txt}{col 49}        avg{col 67}= {res}     74.98
{txt}{col 49}        max{col 67}= {res}     81.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   80.5{txt}){col 67}= {res}      9.50
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} -21745.7{col 26}{space 2} 15917.31{col 37}{space 1}   -1.37{col 46}{space 3}0.176{col 54}{space 4}-53419.82{col 67}{space 3} 9928.406
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 123693.7{col 26}{space 2} 18451.62{col 37}{space 1}    6.70{col 46}{space 3}0.000{col 54}{space 4} 86980.27{col 67}{space 3} 160407.1
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1373.703{col 26}{space 2} 1174.013{col 37}{space 1}   -1.17{col 46}{space 3}0.245{col 54}{space 4}-3709.868{col 67}{space 3} 962.4615
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 30081.68{col 26}{space 2} 21316.51{col 37}{space 1}    1.41{col 46}{space 3}0.162{col 54}{space 4}-12331.05{col 67}{space 3} 72494.41
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-29.44323{col 26}{space 2} 15.48789{col 37}{space 1}   -1.90{col 46}{space 3}0.061{col 54}{space 4}-60.25893{col 67}{space 3} 1.372461
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  81.1143{col 26}{space 2} 1553.707{col 37}{space 1}    0.05{col 46}{space 3}0.959{col 54}{space 4}-3045.391{col 67}{space 3} 3207.619
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1051928{col 26}{space 2} 82544.34{col 37}{space 1}   12.74{col 46}{space 3}0.000{col 54}{space 4} 887470.6{col 67}{space 3}  1216385
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.0364
{txt}{col 49}Largest FMI{col 67}= {res}    0.2225
{txt}{col 49}Complete DF{col 67}= {res}        83
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     38.88
{txt}{col 49}        avg{col 67}= {res}     73.45
{txt}{col 49}        max{col 67}= {res}     81.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   80.2{txt}){col 67}= {res}      9.77
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-13263.22{col 26}{space 2} 9258.805{col 37}{space 1}   -1.43{col 46}{space 3}0.156{col 54}{space 4}-31688.31{col 67}{space 3} 5161.869
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 63975.66{col 26}{space 2} 10722.54{col 37}{space 1}    5.97{col 46}{space 3}0.000{col 54}{space 4} 42640.78{col 67}{space 3} 85310.54
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1504.283{col 26}{space 2} 682.8266{col 37}{space 1}   -2.20{col 46}{space 3}0.030{col 54}{space 4}-2863.094{col 67}{space 3}-145.4725
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 20908.76{col 26}{space 2} 12386.67{col 37}{space 1}    1.69{col 46}{space 3}0.095{col 54}{space 4}-3736.652{col 67}{space 3} 45554.17
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-17.72965{col 26}{space 2} 8.998746{col 37}{space 1}   -1.97{col 46}{space 3}0.052{col 54}{space 4}-35.63411{col 67}{space 3} .1748195
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 112.7606{col 26}{space 2} 924.1775{col 37}{space 1}    0.12{col 46}{space 3}0.904{col 54}{space 4}-1756.744{col 67}{space 3} 1982.266
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 626046.2{col 26}{space 2} 48269.43{col 37}{space 1}   12.97{col 46}{space 3}0.000{col 54}{space 4}   529820{col 67}{space 3} 722272.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.0159
{txt}{col 49}Largest FMI{col 67}= {res}    0.1054
{txt}{col 49}Complete DF{col 67}= {res}        83
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     62.08
{txt}{col 49}        avg{col 67}= {res}     77.77
{txt}{col 49}        max{col 67}= {res}     81.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   80.9{txt}){col 67}= {res}      6.58
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-9592.424{col 26}{space 2} 7248.302{col 37}{space 1}   -1.32{col 46}{space 3}0.189{col 54}{space 4}-24014.87{col 67}{space 3}  4830.02
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 48605.71{col 26}{space 2} 8422.112{col 37}{space 1}    5.77{col 46}{space 3}0.000{col 54}{space 4} 31847.92{col 67}{space 3}  65363.5
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-241.7881{col 26}{space 2} 534.7768{col 37}{space 1}   -0.45{col 46}{space 3}0.652{col 54}{space 4}-1305.873{col 67}{space 3} 822.2969
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}  4314.79{col 26}{space 2} 9725.965{col 37}{space 1}    0.44{col 46}{space 3}0.658{col 54}{space 4}-15036.61{col 67}{space 3} 23666.19
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.922751{col 26}{space 2} 7.068887{col 37}{space 1}   -1.26{col 46}{space 3}0.210{col 54}{space 4}-22.98758{col 67}{space 3} 5.142082
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-247.6948{col 26}{space 2} 682.6387{col 37}{space 1}   -0.36{col 46}{space 3}0.718{col 54}{space 4}-1612.237{col 67}{space 3} 1116.847
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 427521.3{col 26}{space 2} 37296.41{col 37}{space 1}   11.46{col 46}{space 3}0.000{col 54}{space 4} 353267.7{col 67}{space 3} 501774.9
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. *********************WHITES******************************************************
. 
. **Model 1**
. 
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       123
{txt}{hline 13}{c +}{hline 34}   F(5, 117)       = {res}    16.46
{txt}       Model {c |} {res} 7.2728e+11         5  1.4546e+11   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.0338e+12       117  8.8359e+09   {txt}R-squared       ={res}    0.4130
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3879
{txt}       Total {c |} {res} 1.7611e+12       122  1.4435e+10   {txt}Root MSE        =   {res}  93999

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 14911.79{col 26}{space 2} 18528.86{col 37}{space 1}    0.80{col 46}{space 3}0.423{col 67}{space 3} .0630656
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 141982.2{col 26}{space 2} 17355.59{col 37}{space 1}    8.18{col 46}{space 3}0.000{col 67}{space 3} .5909123
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1779.524{col 26}{space 2} 1138.235{col 37}{space 1}   -1.56{col 46}{space 3}0.121{col 67}{space 3}-.1222293
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-31747.64{col 26}{space 2} 20425.33{col 37}{space 1}   -1.55{col 46}{space 3}0.123{col 67}{space 3}-.1151978
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-22.91017{col 26}{space 2}  12.8904{col 37}{space 1}   -1.78{col 46}{space 3}0.078{col 67}{space 3}-.1297416
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1103231{col 26}{space 2} 70288.15{col 37}{space 1}   15.70{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       123
{txt}{hline 13}{c +}{hline 34}   F(5, 117)       = {res}    15.79
{txt}       Model {c |} {res} 1.9197e+11         5  3.8394e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.8448e+11       117  2.4315e+09   {txt}R-squared       ={res}    0.4029
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3774
{txt}       Total {c |} {res} 4.7646e+11       122  3.9054e+09   {txt}Root MSE        =   {res}  49310

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-88.89219{col 26}{space 2} 9719.847{col 37}{space 1}   -0.01{col 46}{space 3}0.993{col 67}{space 3}-.0007228
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 71348.44{col 26}{space 2} 9104.376{col 37}{space 1}    7.84{col 46}{space 3}0.000{col 67}{space 3} .5708897
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1527.793{col 26}{space 2} 597.0941{col 37}{space 1}   -2.56{col 46}{space 3}0.012{col 67}{space 3}-.2017505
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-19287.42{col 26}{space 2} 10714.69{col 37}{space 1}   -1.80{col 46}{space 3}0.074{col 67}{space 3}-.1345504
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-7.977756{col 26}{space 2} 6.762029{col 37}{space 1}   -1.18{col 46}{space 3}0.240{col 67}{space 3} -.086858
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 671649.7{col 26}{space 2} 36871.68{col 37}{space 1}   18.22{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       123
{txt}{hline 13}{c +}{hline 34}   F(5, 117)       = {res}    12.64
{txt}       Model {c |} {res} 1.3984e+11         5  2.7967e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.5893e+11       117  2.2131e+09   {txt}R-squared       ={res}    0.3507
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3229
{txt}       Total {c |} {res} 3.9877e+11       122  3.2686e+09   {txt}Root MSE        =   {res}  47043

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 9802.402{col 26}{space 2}  9273.03{col 37}{space 1}    1.06{col 46}{space 3}0.293{col 67}{space 3} .0871215
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 60513.49{col 26}{space 2} 8685.852{col 37}{space 1}    6.97{col 46}{space 3}0.000{col 67}{space 3} .5292628
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-601.0607{col 26}{space 2} 569.6459{col 37}{space 1}   -1.06{col 46}{space 3}0.294{col 67}{space 3}  -.08676
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-14936.65{col 26}{space 2} 10222.14{col 37}{space 1}   -1.46{col 46}{space 3}0.147{col 67}{space 3}-.1138979
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-13.41316{col 26}{space 2} 6.451182{col 37}{space 1}   -2.08{col 46}{space 3}0.040{col 67}{space 3} -.159629
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 430822.5{col 26}{space 2}  35176.7{col 37}{space 1}   12.25{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0005
{txt}{col 49}Largest FMI{col 67}= {res}    0.0033
{txt}{col 49}Complete DF{col 67}= {res}       116
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    113.68
{txt}{col 49}        avg{col 67}= {res}    113.97
{txt}{col 49}        max{col 67}= {res}    114.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}  114.0{txt}){col 67}= {res}     13.91
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 18094.57{col 26}{space 2} 18763.82{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}-19076.28{col 67}{space 3} 55265.42
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 145052.1{col 26}{space 2} 17589.82{col 37}{space 1}    8.25{col 46}{space 3}0.000{col 54}{space 4}   110207{col 67}{space 3} 179897.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1743.418{col 26}{space 2} 1138.176{col 37}{space 1}   -1.53{col 46}{space 3}0.128{col 54}{space 4}-3998.125{col 67}{space 3} 511.2892
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-29967.78{col 26}{space 2} 20485.38{col 37}{space 1}   -1.46{col 46}{space 3}0.146{col 54}{space 4}-70549.02{col 67}{space 3} 10613.46
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-21.54769{col 26}{space 2} 12.94988{col 37}{space 1}   -1.66{col 46}{space 3}0.099{col 54}{space 4} -47.2012{col 67}{space 3} 4.105824
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1419.201{col 26}{space 2} 1345.399{col 37}{space 1}    1.05{col 46}{space 3}0.294{col 54}{space 4}-1246.104{col 67}{space 3} 4084.506
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1043553{col 26}{space 2} 90199.47{col 37}{space 1}   11.57{col 46}{space 3}0.000{col 54}{space 4} 864867.2{col 67}{space 3}  1222239
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0002
{txt}{col 49}Largest FMI{col 67}= {res}    0.0012
{txt}{col 49}Complete DF{col 67}= {res}       116
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    113.95
{txt}{col 49}        avg{col 67}= {res}    114.01
{txt}{col 49}        max{col 67}= {res}    114.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}  114.0{txt}){col 67}= {res}     13.74
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 2400.981{col 26}{space 2}  9784.36{col 37}{space 1}    0.25{col 46}{space 3}0.807{col 54}{space 4}-16981.67{col 67}{space 3} 21783.63
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 73756.97{col 26}{space 2} 9174.101{col 37}{space 1}    8.04{col 46}{space 3}0.000{col 54}{space 4} 55583.17{col 67}{space 3} 91930.77
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1499.599{col 26}{space 2}  593.533{col 37}{space 1}   -2.53{col 46}{space 3}0.013{col 54}{space 4}-2675.378{col 67}{space 3}  -323.82
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-17899.03{col 26}{space 2} 10682.41{col 37}{space 1}   -1.68{col 46}{space 3}0.097{col 54}{space 4}-39060.71{col 67}{space 3} 3262.648
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-6.904997{col 26}{space 2} 6.754682{col 37}{space 1}   -1.02{col 46}{space 3}0.309{col 54}{space 4}-20.28598{col 67}{space 3} 6.475988
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1110.968{col 26}{space 2}   700.86{col 37}{space 1}    1.59{col 46}{space 3}0.116{col 54}{space 4}-277.4372{col 67}{space 3} 2499.374
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 624929.8{col 26}{space 2} 47020.64{col 37}{space 1}   13.29{col 46}{space 3}0.000{col 54}{space 4} 531782.3{col 67}{space 3} 718077.3
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0025
{txt}{col 49}Largest FMI{col 67}= {res}    0.0180
{txt}{col 49}Complete DF{col 67}= {res}       116
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    111.15
{txt}{col 49}        avg{col 67}= {res}    113.49
{txt}{col 49}        max{col 67}= {res}    114.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}  114.0{txt}){col 67}= {res}     10.52
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 10806.84{col 26}{space 2} 9419.242{col 37}{space 1}    1.15{col 46}{space 3}0.254{col 54}{space 4}-7852.617{col 67}{space 3}  29466.3
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 61476.46{col 26}{space 2} 8829.597{col 37}{space 1}    6.96{col 46}{space 3}0.000{col 54}{space 4} 43985.12{col 67}{space 3}  78967.8
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-589.6225{col 26}{space 2} 571.2465{col 37}{space 1}   -1.03{col 46}{space 3}0.304{col 54}{space 4}-1721.252{col 67}{space 3} 542.0074
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-14371.55{col 26}{space 2} 10281.93{col 37}{space 1}   -1.40{col 46}{space 3}0.165{col 54}{space 4}-34739.91{col 67}{space 3} 5996.814
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-12.98904{col 26}{space 2} 6.499448{col 37}{space 1}   -2.00{col 46}{space 3}0.048{col 54}{space 4}-25.86434{col 67}{space 3}-.1137379
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 447.2575{col 26}{space 2} 680.1364{col 37}{space 1}    0.66{col 46}{space 3}0.512{col 54}{space 4} -900.458{col 67}{space 3} 1794.973
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 412018.1{col 26}{space 2}  45399.3{col 37}{space 1}    9.08{col 46}{space 3}0.000{col 54}{space 4} 322075.1{col 67}{space 3} 501961.2
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //INTERACTION BY Race//
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0097
{txt}{col 49}Largest FMI{col 67}= {res}    0.0823
{txt}{col 49}Complete DF{col 67}= {res}       204
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    144.55
{txt}{col 49}        avg{col 67}= {res}    194.48
{txt}{col 49}        max{col 67}= {res}    202.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  201.8{txt}){col 67}= {res}     20.86
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 19478.72{col 28}{space 2} 17259.36{col 39}{space 1}    1.13{col 48}{space 3}0.260{col 56}{space 4}-14553.39{col 69}{space 3} 53510.82
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 20213.17{col 28}{space 2} 49732.16{col 39}{space 1}    0.41{col 48}{space 3}0.685{col 56}{space 4}-77847.54{col 69}{space 3} 118273.9
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-40470.64{col 28}{space 2} 21530.16{col 39}{space 1}   -1.88{col 48}{space 3}0.062{col 56}{space 4}-82923.32{col 69}{space 3} 1982.048
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 136285.3{col 28}{space 2} 12827.23{col 39}{space 1}   10.62{col 48}{space 3}0.000{col 56}{space 4} 110992.7{col 69}{space 3} 161577.8
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -1849.31{col 28}{space 2} 808.4223{col 39}{space 1}   -2.29{col 48}{space 3}0.023{col 56}{space 4}-3443.341{col 69}{space 3}-255.2791
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3621.553{col 28}{space 2} 14670.34{col 39}{space 1}   -0.25{col 48}{space 3}0.805{col 56}{space 4}-32548.18{col 69}{space 3} 25305.07
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-23.39263{col 28}{space 2} 9.873953{col 39}{space 1}   -2.37{col 48}{space 3}0.019{col 56}{space 4}-42.86194{col 69}{space 3} -3.92332
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 907.6606{col 28}{space 2} 1015.948{col 39}{space 1}    0.89{col 48}{space 3}0.373{col 56}{space 4}-1100.373{col 69}{space 3} 2915.694
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1043693{col 28}{space 2} 68671.95{col 39}{space 1}   15.20{col 48}{space 3}0.000{col 56}{space 4} 908247.6{col 69}{space 3}  1179139
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0148
{txt}{col 49}Largest FMI{col 67}= {res}    0.1202
{txt}{col 49}Complete DF{col 67}= {res}       204
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    113.61
{txt}{col 49}        avg{col 67}= {res}    190.14
{txt}{col 49}        max{col 67}= {res}    202.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  201.5{txt}){col 67}= {res}     21.69
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 4123.496{col 28}{space 2} 9446.755{col 39}{space 1}    0.44{col 48}{space 3}0.663{col 56}{space 4}-14503.81{col 69}{space 3}  22750.8
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-9641.247{col 28}{space 2} 27208.87{col 39}{space 1}   -0.35{col 48}{space 3}0.723{col 56}{space 4}-63291.11{col 69}{space 3} 44008.62
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-17470.83{col 28}{space 2} 11779.64{col 39}{space 1}   -1.48{col 48}{space 3}0.140{col 56}{space 4}-40697.69{col 69}{space 3} 5756.027
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 69875.31{col 28}{space 2}  7018.99{col 39}{space 1}    9.96{col 48}{space 3}0.000{col 56}{space 4} 56035.32{col 69}{space 3}  83715.3
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1705.772{col 28}{space 2}  442.293{col 39}{space 1}   -3.86{col 48}{space 3}0.000{col 56}{space 4}-2577.878{col 69}{space 3} -833.667
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-1045.557{col 28}{space 2} 8025.721{col 39}{space 1}   -0.13{col 48}{space 3}0.896{col 56}{space 4}-16870.49{col 69}{space 3} 14779.38
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-10.45391{col 28}{space 2} 5.403583{col 39}{space 1}   -1.93{col 48}{space 3}0.054{col 56}{space 4}-21.10866{col 69}{space 3}  .200843
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 691.7381{col 28}{space 2} 566.5933{col 39}{space 1}    1.22{col 48}{space 3}0.225{col 56}{space 4}-430.7199{col 69}{space 3} 1814.196
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 634563.9{col 28}{space 2} 37778.25{col 39}{space 1}   16.80{col 48}{space 3}0.000{col 56}{space 4} 560032.6{col 69}{space 3} 709095.2
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0067
{txt}{col 49}Largest FMI{col 67}= {res}    0.0587
{txt}{col 49}Complete DF{col 67}= {res}       204
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    165.34
{txt}{col 49}        avg{col 67}= {res}    197.20
{txt}{col 49}        max{col 67}= {res}    202.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  201.9{txt}){col 67}= {res}     14.18
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 10151.09{col 28}{space 2}  8347.88{col 39}{space 1}    1.22{col 48}{space 3}0.225{col 56}{space 4}-6309.224{col 69}{space 3} 26611.41
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 22422.29{col 28}{space 2} 24062.21{col 39}{space 1}    0.93{col 48}{space 3}0.353{col 56}{space 4}-25023.02{col 69}{space 3} 69867.61
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-18718.01{col 28}{space 2} 10416.97{col 39}{space 1}   -1.80{col 48}{space 3}0.074{col 56}{space 4}-39257.95{col 69}{space 3} 1821.932
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 55958.34{col 28}{space 2} 6206.188{col 39}{space 1}    9.02{col 48}{space 3}0.000{col 56}{space 4} 43721.06{col 69}{space 3} 68195.61
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-505.7301{col 28}{space 2} 391.1192{col 39}{space 1}   -1.29{col 48}{space 3}0.197{col 56}{space 4}-1276.931{col 69}{space 3} 265.4704
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-6014.917{col 28}{space 2} 7097.973{col 39}{space 1}   -0.85{col 48}{space 3}0.398{col 56}{space 4}-20010.54{col 69}{space 3} 7980.704
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-11.02672{col 28}{space 2} 4.776126{col 39}{space 1}   -2.31{col 48}{space 3}0.022{col 56}{space 4}-20.44419{col 69}{space 3}-1.609261
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 204.3367{col 28}{space 2}  485.774{col 39}{space 1}    0.42{col 48}{space 3}0.675{col 56}{space 4}-754.7833{col 69}{space 3} 1163.457
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}   410292{col 28}{space 2} 33123.38{col 39}{space 1}   12.39{col 48}{space 3}0.000{col 56}{space 4}   344968{col 69}{space 3} 475616.1
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. *********************LnNFLw3, MODELS 3-6***************************
. 
. ***********MODEL 3: MODEL 2+w1dxDiabetes w1Glucose******
. 
. //AFRICAN-AMERICAN//
. 
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.0647
{txt}{col 49}Largest FMI{col 67}= {res}    0.2359
{txt}{col 49}Complete DF{col 67}= {res}        81
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     36.30
{txt}{col 49}        avg{col 67}= {res}     67.79
{txt}{col 49}        max{col 67}= {res}     78.84
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   77.6{txt}){col 67}= {res}      7.66
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-28477.22{col 26}{space 2} 15911.33{col 37}{space 1}   -1.79{col 46}{space 3}0.077{col 54}{space 4}-60148.95{col 67}{space 3} 3194.518
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 124117.2{col 26}{space 2} 18357.69{col 37}{space 1}    6.76{col 46}{space 3}0.000{col 54}{space 4} 87559.53{col 67}{space 3} 160674.9
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-632.6413{col 26}{space 2} 1205.611{col 37}{space 1}   -0.52{col 46}{space 3}0.601{col 54}{space 4}-3032.756{col 67}{space 3} 1767.473
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 33569.09{col 26}{space 2} 21314.74{col 37}{space 1}    1.57{col 46}{space 3}0.119{col 54}{space 4}-8875.081{col 67}{space 3} 76013.25
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-30.23665{col 26}{space 2} 15.29485{col 37}{space 1}   -1.98{col 46}{space 3}0.052{col 54}{space 4}-60.68176{col 67}{space 3}  .208452
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-243.5229{col 26}{space 2}  1595.89{col 37}{space 1}   -0.15{col 46}{space 3}0.880{col 54}{space 4}-3479.209{col 67}{space 3} 2992.163
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-31965.22{col 26}{space 2} 17068.03{col 37}{space 1}   -1.87{col 46}{space 3}0.067{col 54}{space 4}-66187.09{col 67}{space 3} 2256.648
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 726.2721{col 26}{space 2} 384.4313{col 37}{space 1}    1.89{col 46}{space 3}0.063{col 54}{space 4}-41.36339{col 67}{space 3} 1493.908
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 978984.9{col 26}{space 2} 90882.75{col 37}{space 1}   10.77{col 46}{space 3}0.000{col 54}{space 4} 797487.8{col 67}{space 3}  1160482
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.1011
{txt}{col 49}Largest FMI{col 67}= {res}    0.3025
{txt}{col 49}Complete DF{col 67}= {res}        81
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     27.89
{txt}{col 49}        avg{col 67}= {res}     61.79
{txt}{col 49}        max{col 67}= {res}     78.77
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   75.9{txt}){col 67}= {res}      7.93
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-17536.88{col 26}{space 2} 9224.008{col 37}{space 1}   -1.90{col 46}{space 3}0.061{col 54}{space 4}-35902.29{col 67}{space 3} 828.5422
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 64418.12{col 26}{space 2} 10574.21{col 37}{space 1}    6.09{col 46}{space 3}0.000{col 54}{space 4}  43360.6{col 67}{space 3} 85475.64
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1030.178{col 26}{space 2} 699.9156{col 37}{space 1}   -1.47{col 46}{space 3}0.145{col 54}{space 4} -2424.13{col 67}{space 3} 363.7744
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 22768.78{col 26}{space 2} 12268.25{col 37}{space 1}    1.86{col 46}{space 3}0.067{col 54}{space 4}-1659.921{col 67}{space 3} 47197.48
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-18.05552{col 26}{space 2} 8.809624{col 37}{space 1}   -2.05{col 46}{space 3}0.044{col 54}{space 4}-35.59141{col 67}{space 3}-.5196193
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-74.21668{col 26}{space 2}  955.161{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4} -2031.13{col 67}{space 3} 1882.696
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-22149.07{col 26}{space 2}  10574.3{col 37}{space 1}   -2.09{col 46}{space 3}0.044{col 54}{space 4}-43708.43{col 67}{space 3}-589.7099
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}  432.447{col 26}{space 2} 231.0417{col 37}{space 1}    1.87{col 46}{space 3}0.067{col 54}{space 4}-32.06374{col 67}{space 3} 896.9578
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 582398.1{col 26}{space 2} 52658.91{col 37}{space 1}   11.06{col 46}{space 3}0.000{col 54}{space 4}   477157{col 67}{space 3} 687639.2
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.0546
{txt}{col 49}Largest FMI{col 67}= {res}    0.1385
{txt}{col 49}Complete DF{col 67}= {res}        81
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     53.71
{txt}{col 49}        avg{col 67}= {res}     69.88
{txt}{col 49}        max{col 67}= {res}     78.86
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   78.0{txt}){col 67}= {res}      5.15
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-12075.67{col 26}{space 2} 7340.596{col 37}{space 1}   -1.65{col 46}{space 3}0.104{col 54}{space 4}-26687.85{col 67}{space 3} 2536.504
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 48634.51{col 26}{space 2} 8452.965{col 37}{space 1}    5.75{col 46}{space 3}0.000{col 54}{space 4} 31801.92{col 67}{space 3} 65467.11
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 27.84914{col 26}{space 2} 555.5894{col 37}{space 1}    0.05{col 46}{space 3}0.960{col 54}{space 4}-1078.216{col 67}{space 3} 1133.914
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 5836.179{col 26}{space 2} 9812.533{col 37}{space 1}    0.59{col 46}{space 3}0.554{col 54}{space 4}-13702.58{col 67}{space 3} 25374.94
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-9.320885{col 26}{space 2} 7.044114{col 37}{space 1}   -1.32{col 46}{space 3}0.190{col 54}{space 4}-23.34224{col 67}{space 3} 4.700466
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-378.7831{col 26}{space 2} 696.3271{col 37}{space 1}   -0.54{col 46}{space 3}0.589{col 54}{space 4}-1774.346{col 67}{space 3}  1016.78
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-10484.63{col 26}{space 2} 7870.707{col 37}{space 1}   -1.33{col 46}{space 3}0.188{col 54}{space 4}-26266.42{col 67}{space 3} 5297.154
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 286.7483{col 26}{space 2} 178.8407{col 37}{space 1}    1.60{col 46}{space 3}0.114{col 54}{space 4}-70.81673{col 67}{space 3} 644.3133
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 398860.4{col 26}{space 2} 41455.07{col 37}{space 1}    9.62{col 46}{space 3}0.000{col 54}{space 4} 316168.4{col 67}{space 3} 481552.3
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0184
{txt}{col 49}Largest FMI{col 67}= {res}    0.1139
{txt}{col 49}Complete DF{col 67}= {res}       114
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     77.79
{txt}{col 49}        avg{col 67}= {res}    104.23
{txt}{col 49}        max{col 67}= {res}    112.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  111.7{txt}){col 67}= {res}     10.26
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 18973.42{col 26}{space 2}  19692.8{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4} -20048.1{col 67}{space 3} 57994.93
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 143599.4{col 26}{space 2} 17796.63{col 37}{space 1}    8.07{col 46}{space 3}0.000{col 54}{space 4} 108337.7{col 67}{space 3} 178861.2
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1884.142{col 26}{space 2}  1153.96{col 37}{space 1}   -1.63{col 46}{space 3}0.105{col 54}{space 4}-4170.591{col 67}{space 3} 402.3074
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-30831.99{col 26}{space 2} 20672.19{col 37}{space 1}   -1.49{col 46}{space 3}0.139{col 54}{space 4}-71791.39{col 67}{space 3}  10127.4
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-19.86309{col 26}{space 2} 13.20222{col 37}{space 1}   -1.50{col 46}{space 3}0.135{col 54}{space 4}-46.02232{col 67}{space 3} 6.296131
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1172.569{col 26}{space 2} 1402.857{col 37}{space 1}    0.84{col 46}{space 3}0.405{col 54}{space 4}-1607.142{col 67}{space 3}  3952.28
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 17134.52{col 26}{space 2} 18481.14{col 37}{space 1}    0.93{col 46}{space 3}0.357{col 54}{space 4}-19660.15{col 67}{space 3} 53929.18
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-222.5659{col 26}{space 2} 421.8207{col 37}{space 1}   -0.53{col 46}{space 3}0.599{col 54}{space 4}-1062.221{col 67}{space 3} 617.0892
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1070649{col 26}{space 2} 95367.81{col 37}{space 1}   11.23{col 46}{space 3}0.000{col 54}{space 4} 881673.9{col 67}{space 3}  1259625
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0147
{txt}{col 49}Largest FMI{col 67}= {res}    0.0876
{txt}{col 49}Complete DF{col 67}= {res}       114
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     87.33
{txt}{col 49}        avg{col 67}= {res}    106.39
{txt}{col 49}        max{col 67}= {res}    112.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  111.8{txt}){col 67}= {res}     10.09
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 2076.643{col 26}{space 2}  10282.5{col 37}{space 1}    0.20{col 46}{space 3}0.840{col 54}{space 4}-18297.86{col 67}{space 3} 22451.15
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 73021.12{col 26}{space 2} 9297.983{col 37}{space 1}    7.85{col 46}{space 3}0.000{col 54}{space 4} 54598.37{col 67}{space 3} 91443.86
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -1557.42{col 26}{space 2} 602.6802{col 37}{space 1}   -2.58{col 46}{space 3}0.011{col 54}{space 4}-2751.556{col 67}{space 3}-363.2841
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-18453.99{col 26}{space 2} 10800.27{col 37}{space 1}   -1.71{col 46}{space 3}0.090{col 54}{space 4}-39853.36{col 67}{space 3} 2945.376
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -6.08626{col 26}{space 2} 6.897661{col 37}{space 1}   -0.88{col 46}{space 3}0.379{col 54}{space 4}-19.75346{col 67}{space 3} 7.580937
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 986.3325{col 26}{space 2} 731.7823{col 37}{space 1}    1.35{col 46}{space 3}0.180{col 54}{space 4}  -463.61{col 67}{space 3} 2436.275
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 6162.979{col 26}{space 2} 9513.832{col 37}{space 1}    0.65{col 46}{space 3}0.519{col 54}{space 4}-12742.37{col 67}{space 3} 25068.33
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-43.91005{col 26}{space 2} 217.7855{col 37}{space 1}   -0.20{col 46}{space 3}0.841{col 54}{space 4} -476.759{col 67}{space 3} 388.9389
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   634036{col 26}{space 2} 49903.29{col 37}{space 1}   12.71{col 46}{space 3}0.000{col 54}{space 4} 535145.6{col 67}{space 3} 732926.4
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0240
{txt}{col 49}Largest FMI{col 67}= {res}    0.1424
{txt}{col 49}Complete DF{col 67}= {res}       114
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     68.09
{txt}{col 49}        avg{col 67}= {res}    101.77
{txt}{col 49}        max{col 67}= {res}    111.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  111.6{txt}){col 67}= {res}      7.75
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 11143.64{col 26}{space 2}  9892.54{col 37}{space 1}    1.13{col 46}{space 3}0.262{col 54}{space 4}-8458.993{col 67}{space 3} 30746.27
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  60736.6{col 26}{space 2} 8934.063{col 37}{space 1}    6.80{col 46}{space 3}0.000{col 54}{space 4} 43034.87{col 67}{space 3} 78438.34
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-658.0926{col 26}{space 2} 579.2205{col 37}{space 1}   -1.14{col 46}{space 3}0.258{col 54}{space 4}-1805.756{col 67}{space 3} 489.5702
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -14810.3{col 26}{space 2} 10377.56{col 37}{space 1}   -1.43{col 46}{space 3}0.156{col 54}{space 4}-35372.19{col 67}{space 3} 5751.592
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-12.15399{col 26}{space 2} 6.626267{col 37}{space 1}   -1.83{col 46}{space 3}0.069{col 54}{space 4}-25.28342{col 67}{space 3}  .975431
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 322.7447{col 26}{space 2} 708.9331{col 37}{space 1}    0.46{col 46}{space 3}0.650{col 54}{space 4}-1082.313{col 67}{space 3} 1727.803
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 8291.381{col 26}{space 2} 9402.148{col 37}{space 1}    0.88{col 46}{space 3}0.381{col 54}{space 4}-10466.25{col 67}{space 3} 27049.01
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-102.9207{col 26}{space 2} 215.1369{col 37}{space 1}   -0.48{col 46}{space 3}0.634{col 54}{space 4}-532.2096{col 67}{space 3} 326.3681
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 425043.3{col 26}{space 2} 47861.34{col 37}{space 1}    8.88{col 46}{space 3}0.000{col 54}{space 4} 330204.6{col 67}{space 3}   519882
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //INTERACTION BY Race//
. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0293
{txt}{col 49}Largest FMI{col 67}= {res}    0.1828
{txt}{col 49}Complete DF{col 67}= {res}       202
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     75.66
{txt}{col 49}        avg{col 67}= {res}    172.14
{txt}{col 49}        max{col 67}= {res}    200.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  198.7{txt}){col 67}= {res}     16.26
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 16563.88{col 28}{space 2} 17875.99{col 39}{space 1}    0.93{col 48}{space 3}0.355{col 56}{space 4}-18688.02{col 69}{space 3} 51815.78
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 16274.86{col 28}{space 2} 50431.53{col 39}{space 1}    0.32{col 48}{space 3}0.747{col 56}{space 4} -83171.7{col 69}{space 3} 115721.4
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-38491.08{col 28}{space 2} 21883.78{col 39}{space 1}   -1.76{col 48}{space 3}0.080{col 56}{space 4}-81644.15{col 69}{space 3} 4661.989
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 135996.4{col 28}{space 2}  12936.6{col 39}{space 1}   10.51{col 48}{space 3}0.000{col 56}{space 4}   110486{col 69}{space 3} 161506.8
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1775.962{col 28}{space 2} 826.1599{col 39}{space 1}   -2.15{col 48}{space 3}0.033{col 56}{space 4}-3405.103{col 69}{space 3}-146.8214
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -3705.67{col 28}{space 2} 14733.89{col 39}{space 1}   -0.25{col 48}{space 3}0.802{col 56}{space 4}-32759.35{col 69}{space 3} 25348.01
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-23.29781{col 28}{space 2} 9.953948{col 39}{space 1}   -2.34{col 48}{space 3}0.020{col 56}{space 4}-42.92611{col 69}{space 3}-3.669516
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 845.3899{col 28}{space 2} 1041.104{col 39}{space 1}    0.81{col 48}{space 3}0.418{col 56}{space 4} -1212.94{col 69}{space 3}  2903.72
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-5201.239{col 28}{space 2} 12663.94{col 39}{space 1}   -0.41{col 48}{space 3}0.682{col 56}{space 4}-30291.32{col 69}{space 3} 19888.84
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 196.8116{col 28}{space 2} 301.0284{col 39}{space 1}    0.65{col 48}{space 3}0.515{col 56}{space 4}-402.7817{col 69}{space 3} 796.4049
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1031024{col 28}{space 2} 72902.51{col 39}{space 1}   14.14{col 48}{space 3}0.000{col 56}{space 4} 887113.3{col 69}{space 3}  1174935
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0385
{txt}{col 49}Largest FMI{col 67}= {res}    0.2031
{txt}{col 49}Complete DF{col 67}= {res}       202
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     66.88
{txt}{col 49}        avg{col 67}= {res}    167.89
{txt}{col 49}        max{col 67}= {res}    199.96
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  197.8{txt}){col 67}= {res}     17.00
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 2055.082{col 28}{space 2} 9770.016{col 39}{space 1}    0.21{col 48}{space 3}0.834{col 56}{space 4}-17212.17{col 69}{space 3} 21322.34
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-11846.62{col 28}{space 2} 27537.89{col 39}{space 1}   -0.43{col 48}{space 3}0.668{col 56}{space 4}-66149.17{col 69}{space 3} 42455.92
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-16321.42{col 28}{space 2} 11950.33{col 39}{space 1}   -1.37{col 48}{space 3}0.174{col 56}{space 4}-39886.64{col 69}{space 3} 7243.794
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 69906.49{col 28}{space 2} 7063.175{col 39}{space 1}    9.90{col 48}{space 3}0.000{col 56}{space 4} 55978.18{col 69}{space 3} 83834.79
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1618.935{col 28}{space 2} 451.1064{col 39}{space 1}   -3.59{col 48}{space 3}0.000{col 56}{space 4}-2508.496{col 69}{space 3}-729.3744
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-952.7627{col 28}{space 2} 8044.315{col 39}{space 1}   -0.12{col 48}{space 3}0.906{col 56}{space 4}-16815.34{col 69}{space 3} 14909.81
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-10.62932{col 28}{space 2} 5.440157{col 39}{space 1}   -1.95{col 48}{space 3}0.052{col 56}{space 4}-21.35702{col 69}{space 3} .0983739
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 680.7582{col 28}{space 2} 576.7313{col 39}{space 1}    1.18{col 48}{space 3}0.240{col 56}{space 4}-461.4776{col 69}{space 3} 1822.994
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} -6708.83{col 28}{space 2} 6942.041{col 39}{space 1}   -0.97{col 48}{space 3}0.336{col 56}{space 4}-20470.72{col 69}{space 3} 7053.058
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 163.1097{col 28}{space 2} 166.1299{col 39}{space 1}    0.98{col 48}{space 3}0.330{col 56}{space 4}-168.4975{col 69}{space 3}  494.717
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 621803.4{col 28}{space 2}  39950.9{col 39}{space 1}   15.56{col 48}{space 3}0.000{col 56}{space 4} 542916.7{col 69}{space 3} 700690.1
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0339
{txt}{col 49}Largest FMI{col 67}= {res}    0.2185
{txt}{col 49}Complete DF{col 67}= {res}       202
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     61.07
{txt}{col 49}        avg{col 67}= {res}    169.11
{txt}{col 49}        max{col 67}= {res}    199.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  198.3{txt}){col 67}= {res}     10.96
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 8841.693{col 28}{space 2}  8664.58{col 39}{space 1}    1.02{col 48}{space 3}0.309{col 56}{space 4}-8245.844{col 69}{space 3} 25929.23
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 20162.21{col 28}{space 2} 24402.97{col 39}{space 1}    0.83{col 48}{space 3}0.410{col 56}{space 4}-27958.45{col 69}{space 3} 68282.87
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-17616.98{col 28}{space 2} 10590.49{col 39}{space 1}   -1.66{col 48}{space 3}0.098{col 56}{space 4}-38500.67{col 69}{space 3} 3266.721
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 55640.33{col 28}{space 2}  6259.95{col 39}{space 1}    8.89{col 48}{space 3}0.000{col 56}{space 4} 43295.95{col 69}{space 3} 67984.71
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-500.7601{col 28}{space 2} 400.3082{col 39}{space 1}   -1.25{col 48}{space 3}0.212{col 56}{space 4}-1290.168{col 69}{space 3} 288.6475
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-6169.169{col 28}{space 2} 7128.775{col 39}{space 1}   -0.87{col 48}{space 3}0.388{col 56}{space 4}-20226.38{col 69}{space 3} 7888.037
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-10.78952{col 28}{space 2} 4.814125{col 39}{space 1}   -2.24{col 48}{space 3}0.026{col 56}{space 4} -20.2825{col 69}{space 3}-1.296535
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 149.2915{col 28}{space 2} 500.3534{col 39}{space 1}    0.30{col 48}{space 3}0.766{col 56}{space 4}-839.2886{col 69}{space 3} 1137.872
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} 102.2889{col 28}{space 2} 6322.669{col 39}{space 1}    0.02{col 48}{space 3}0.987{col 56}{space 4}-12488.48{col 69}{space 3} 12693.06
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 69.42973{col 28}{space 2} 148.4803{col 39}{space 1}    0.47{col 48}{space 3}0.642{col 56}{space 4}-227.4682{col 69}{space 3} 366.3277
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 407643.2{col 28}{space 2} 35085.77{col 39}{space 1}   11.62{col 48}{space 3}0.000{col 56}{space 4} 338406.8{col 69}{space 3} 476879.6
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 4: MODEL 2+liver/kidney disease******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.1899
{txt}{col 49}Largest FMI{col 67}= {res}    0.6551
{txt}{col 49}Complete DF{col 67}= {res}        78
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      8.35
{txt}{col 49}        avg{col 67}= {res}     59.85
{txt}{col 49}        max{col 67}= {res}     75.35
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   70.6{txt}){col 67}= {res}      4.59
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} -20007.3{col 26}{space 2} 16769.85{col 37}{space 1}   -1.19{col 46}{space 3}0.237{col 54}{space 4}-53412.02{col 67}{space 3} 13397.42
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 141635.4{col 26}{space 2} 23879.85{col 37}{space 1}    5.93{col 46}{space 3}0.000{col 54}{space 4} 93701.59{col 67}{space 3} 189569.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-897.7217{col 26}{space 2} 1299.563{col 37}{space 1}   -0.69{col 46}{space 3}0.492{col 54}{space 4}-3486.787{col 67}{space 3} 1691.344
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 33383.16{col 26}{space 2} 21811.76{col 37}{space 1}    1.53{col 46}{space 3}0.130{col 54}{space 4}-10068.77{col 67}{space 3} 76835.09
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}  -31.911{col 26}{space 2} 15.86814{col 37}{space 1}   -2.01{col 46}{space 3}0.048{col 54}{space 4}-63.52189{col 67}{space 3}-.3001148
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1212.214{col 26}{space 2} 1662.217{col 37}{space 1}    0.73{col 46}{space 3}0.469{col 54}{space 4}-2124.283{col 67}{space 3} 4548.712
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-12939.61{col 26}{space 2} 49642.32{col 37}{space 1}   -0.26{col 46}{space 3}0.801{col 54}{space 4}-126579.2{col 67}{space 3}   100700
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} -1594285{col 26}{space 2}  1530810{col 37}{space 1}   -1.04{col 46}{space 3}0.302{col 54}{space 4} -4653358{col 67}{space 3}  1464788
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-765.3401{col 26}{space 2} 2944.681{col 37}{space 1}   -0.26{col 46}{space 3}0.796{col 54}{space 4}-6634.906{col 67}{space 3} 5104.226
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 232.1416{col 26}{space 2} 490.1138{col 37}{space 1}    0.47{col 46}{space 3}0.638{col 54}{space 4}-759.2911{col 67}{space 3} 1223.574
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-10002.16{col 26}{space 2} 7741.749{col 37}{space 1}   -1.29{col 46}{space 3}0.201{col 54}{space 4}-25450.91{col 67}{space 3} 5446.584
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  2652823{col 26}{space 2}  1548859{col 37}{space 1}    1.71{col 46}{space 3}0.092{col 54}{space 4}-440379.5{col 67}{space 3}  5746025
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.1572
{txt}{col 49}Largest FMI{col 67}= {res}    0.5613
{txt}{col 49}Complete DF{col 67}= {res}        78
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     11.19
{txt}{col 49}        avg{col 67}= {res}     57.03
{txt}{col 49}        max{col 67}= {res}     75.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   72.0{txt}){col 67}= {res}      4.77
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-13496.77{col 26}{space 2} 9867.581{col 37}{space 1}   -1.37{col 46}{space 3}0.176{col 54}{space 4}-33158.11{col 67}{space 3} 6164.561
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 70805.27{col 26}{space 2} 14007.66{col 37}{space 1}    5.05{col 46}{space 3}0.000{col 54}{space 4} 42674.65{col 67}{space 3} 98935.89
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1438.973{col 26}{space 2} 761.1835{col 37}{space 1}   -1.89{col 46}{space 3}0.063{col 54}{space 4}-2955.555{col 67}{space 3} 77.60945
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 21861.63{col 26}{space 2} 12750.54{col 37}{space 1}    1.71{col 46}{space 3}0.091{col 54}{space 4}-3538.307{col 67}{space 3} 47261.56
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-18.46836{col 26}{space 2} 9.297019{col 37}{space 1}   -1.99{col 46}{space 3}0.051{col 54}{space 4}-36.99035{col 67}{space 3} .0536273
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  644.793{col 26}{space 2} 978.5074{col 37}{space 1}    0.66{col 46}{space 3}0.513{col 54}{space 4}-1321.648{col 67}{space 3} 2611.234
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 3020.195{col 26}{space 2} 26306.38{col 37}{space 1}    0.11{col 46}{space 3}0.911{col 54}{space 4}-54760.53{col 67}{space 3} 60800.92
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} -1120755{col 26}{space 2}   906105{col 37}{space 1}   -1.24{col 46}{space 3}0.221{col 54}{space 4} -2934400{col 67}{space 3} 692890.3
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 315.8459{col 26}{space 2} 1771.883{col 37}{space 1}    0.18{col 46}{space 3}0.859{col 54}{space 4}-3225.854{col 67}{space 3} 3857.546
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}  107.505{col 26}{space 2} 293.2661{col 37}{space 1}    0.37{col 46}{space 3}0.716{col 54}{space 4}-489.1018{col 67}{space 3} 704.1118
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-4843.546{col 26}{space 2} 4589.274{col 37}{space 1}   -1.06{col 46}{space 3}0.295{col 54}{space 4}-14015.51{col 67}{space 3} 4328.419
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1753101{col 26}{space 2} 918285.9{col 37}{space 1}    1.91{col 46}{space 3}0.061{col 54}{space 4}-83974.73{col 67}{space 3}  3590177
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.1839
{txt}{col 49}Largest FMI{col 67}= {res}    0.6556
{txt}{col 49}Complete DF{col 67}= {res}        78
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      8.34
{txt}{col 49}        avg{col 67}= {res}     61.27
{txt}{col 49}        max{col 67}= {res}     75.66
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   70.8{txt}){col 67}= {res}      3.30
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0011

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-8481.267{col 26}{space 2}   7624.9{col 37}{space 1}   -1.11{col 46}{space 3}0.270{col 54}{space 4}-23668.66{col 67}{space 3}  6706.13
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 57965.81{col 26}{space 2}  10875.5{col 37}{space 1}    5.33{col 46}{space 3}0.000{col 54}{space 4} 36135.16{col 67}{space 3} 79796.47
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 4.331726{col 26}{space 2} 595.6897{col 37}{space 1}    0.01{col 46}{space 3}0.994{col 54}{space 4}-1182.869{col 67}{space 3} 1191.532
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 6018.797{col 26}{space 2} 9961.461{col 37}{space 1}    0.60{col 46}{space 3}0.548{col 54}{space 4}-13828.73{col 67}{space 3} 25866.32
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-10.23298{col 26}{space 2} 7.219593{col 37}{space 1}   -1.42{col 46}{space 3}0.160{col 54}{space 4} -24.6144{col 67}{space 3} 4.148443
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  251.745{col 26}{space 2} 736.7141{col 37}{space 1}    0.34{col 46}{space 3}0.734{col 54}{space 4}-1220.782{col 67}{space 3} 1724.272
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-12663.18{col 26}{space 2} 22611.49{col 37}{space 1}   -0.56{col 46}{space 3}0.590{col 54}{space 4}-64437.11{col 67}{space 3} 39110.76
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-584287.8{col 26}{space 2} 701801.8{col 37}{space 1}   -0.83{col 46}{space 3}0.408{col 54}{space 4} -1987969{col 67}{space 3} 819393.9
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-485.4296{col 26}{space 2} 1351.321{col 37}{space 1}   -0.36{col 46}{space 3}0.721{col 54}{space 4}-3180.725{col 67}{space 3} 2209.866
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 111.4811{col 26}{space 2}  214.458{col 37}{space 1}    0.52{col 46}{space 3}0.605{col 54}{space 4}-318.7856{col 67}{space 3} 541.7478
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-4201.559{col 26}{space 2} 3506.626{col 37}{space 1}   -1.20{col 46}{space 3}0.235{col 54}{space 4}-11195.61{col 67}{space 3} 2792.492
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1014491{col 26}{space 2} 709184.8{col 37}{space 1}    1.43{col 46}{space 3}0.158{col 54}{space 4}-402743.9{col 67}{space 3}  2431726
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.1024
{txt}{col 49}Largest FMI{col 67}= {res}    0.4839
{txt}{col 49}Complete DF{col 67}= {res}       111
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     15.87
{txt}{col 49}        avg{col 67}= {res}     81.86
{txt}{col 49}        max{col 67}= {res}    108.56
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  105.4{txt}){col 67}= {res}      8.18
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 19825.02{col 26}{space 2} 19692.86{col 37}{space 1}    1.01{col 46}{space 3}0.316{col 54}{space 4}-19214.65{col 67}{space 3} 58864.68
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 168430.9{col 26}{space 2} 23423.12{col 37}{space 1}    7.19{col 46}{space 3}0.000{col 54}{space 4} 121696.7{col 67}{space 3} 215165.2
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1751.632{col 26}{space 2} 1125.839{col 37}{space 1}   -1.56{col 46}{space 3}0.123{col 54}{space 4}-3983.109{col 67}{space 3} 479.8443
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-24809.52{col 26}{space 2} 20274.63{col 37}{space 1}   -1.22{col 46}{space 3}0.224{col 54}{space 4}-64995.08{col 67}{space 3} 15376.03
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-29.56158{col 26}{space 2} 13.31583{col 37}{space 1}   -2.22{col 46}{space 3}0.029{col 54}{space 4}-55.97749{col 67}{space 3}-3.145658
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 2792.322{col 26}{space 2} 1481.943{col 37}{space 1}    1.88{col 46}{space 3}0.063{col 54}{space 4} -152.447{col 67}{space 3} 5737.091
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 28031.78{col 26}{space 2}  49661.8{col 37}{space 1}    0.56{col 46}{space 3}0.580{col 54}{space 4}-77315.13{col 67}{space 3} 133378.7
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}  1016061{col 26}{space 2}  1709912{col 37}{space 1}    0.59{col 46}{space 3}0.554{col 54}{space 4} -2390452{col 67}{space 3}  4422575
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 1533.956{col 26}{space 2} 2512.836{col 37}{space 1}    0.61{col 46}{space 3}0.544{col 54}{space 4}-3515.767{col 67}{space 3} 6583.679
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 252.2044{col 26}{space 2} 411.6114{col 37}{space 1}    0.61{col 46}{space 3}0.541{col 54}{space 4}-564.3957{col 67}{space 3} 1068.804
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-21476.41{col 26}{space 2} 7305.916{col 37}{space 1}   -2.94{col 46}{space 3}0.004{col 54}{space 4}-36002.07{col 67}{space 3}-6950.754
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-10470.24{col 26}{space 2}  1715484{col 37}{space 1}   -0.01{col 46}{space 3}0.995{col 54}{space 4} -3427493{col 67}{space 3}  3406552
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0982
{txt}{col 49}Largest FMI{col 67}= {res}    0.4459
{txt}{col 49}Complete DF{col 67}= {res}       111
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     18.18
{txt}{col 49}        avg{col 67}= {res}     80.38
{txt}{col 49}        max{col 67}= {res}    108.60
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  105.6{txt}){col 67}= {res}      7.83
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 1164.167{col 26}{space 2}  10397.7{col 37}{space 1}    0.11{col 46}{space 3}0.911{col 54}{space 4}-19450.91{col 67}{space 3} 21779.25
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 84524.03{col 26}{space 2} 12241.78{col 37}{space 1}    6.90{col 46}{space 3}0.000{col 54}{space 4} 60127.72{col 67}{space 3} 108920.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1552.208{col 26}{space 2} 594.3304{col 37}{space 1}   -2.61{col 46}{space 3}0.010{col 54}{space 4}-2730.295{col 67}{space 3}-374.1221
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-15122.49{col 26}{space 2} 10675.32{col 37}{space 1}   -1.42{col 46}{space 3}0.159{col 54}{space 4} -36281.5{col 67}{space 3} 6036.531
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-10.48905{col 26}{space 2} 7.007244{col 37}{space 1}   -1.50{col 46}{space 3}0.138{col 54}{space 4}-24.38931{col 67}{space 3} 3.411211
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1707.974{col 26}{space 2} 774.3297{col 37}{space 1}    2.21{col 46}{space 3}0.030{col 54}{space 4} 170.5109{col 67}{space 3} 3245.438
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 13987.63{col 26}{space 2} 25395.87{col 37}{space 1}    0.55{col 46}{space 3}0.588{col 54}{space 4}-39329.72{col 67}{space 3} 67304.99
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}   262833{col 26}{space 2} 897543.1{col 37}{space 1}    0.29{col 46}{space 3}0.770{col 54}{space 4} -1524477{col 67}{space 3}  2050143
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 1204.418{col 26}{space 2} 1312.873{col 37}{space 1}    0.92{col 46}{space 3}0.363{col 54}{space 4}-1429.368{col 67}{space 3} 3838.204
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}  225.904{col 26}{space 2} 229.6191{col 37}{space 1}    0.98{col 46}{space 3}0.329{col 54}{space 4}-233.0571{col 67}{space 3} 684.8651
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-9767.908{col 26}{space 2} 3841.884{col 37}{space 1}   -2.54{col 46}{space 3}0.013{col 54}{space 4} -17405.2{col 67}{space 3}-2130.616
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 338490.2{col 26}{space 2} 899779.1{col 37}{space 1}    0.38{col 46}{space 3}0.708{col 54}{space 4} -1452784{col 67}{space 3}  2129765
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.1144
{txt}{col 49}Largest FMI{col 67}= {res}    0.4897
{txt}{col 49}Complete DF{col 67}= {res}       111
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     15.55
{txt}{col 49}        avg{col 67}= {res}     80.53
{txt}{col 49}        max{col 67}= {res}    108.65
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  104.6{txt}){col 67}= {res}      6.21
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 12419.45{col 26}{space 2} 9899.082{col 37}{space 1}    1.25{col 46}{space 3}0.212{col 54}{space 4}-7203.945{col 67}{space 3} 32042.85
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 72939.35{col 26}{space 2} 11656.51{col 37}{space 1}    6.26{col 46}{space 3}0.000{col 54}{space 4} 49722.01{col 67}{space 3}  96156.7
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-578.0675{col 26}{space 2} 566.3549{col 37}{space 1}   -1.02{col 46}{space 3}0.310{col 54}{space 4}-1700.605{col 67}{space 3} 544.4701
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-11963.56{col 26}{space 2} 10217.13{col 37}{space 1}   -1.17{col 46}{space 3}0.244{col 54}{space 4}-32215.42{col 67}{space 3} 8288.296
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-16.79975{col 26}{space 2} 6.670824{col 37}{space 1}   -2.52{col 46}{space 3}0.013{col 54}{space 4} -30.0295{col 67}{space 3}-3.570009
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1133.493{col 26}{space 2} 755.2967{col 37}{space 1}    1.50{col 46}{space 3}0.137{col 54}{space 4}-369.6698{col 67}{space 3} 2636.657
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 12235.22{col 26}{space 2} 25113.31{col 37}{space 1}    0.49{col 46}{space 3}0.633{col 54}{space 4}-41126.97{col 67}{space 3}  65597.4
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 517813.2{col 26}{space 2} 845432.6{col 37}{space 1}    0.61{col 46}{space 3}0.542{col 54}{space 4} -1162590{col 67}{space 3}  2198217
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 608.2199{col 26}{space 2} 1264.563{col 37}{space 1}    0.48{col 46}{space 3}0.633{col 54}{space 4}-1933.082{col 67}{space 3} 3149.522
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 79.26543{col 26}{space 2} 215.0988{col 37}{space 1}    0.37{col 46}{space 3}0.714{col 54}{space 4}-349.2371{col 67}{space 3}  507.768
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-10425.53{col 26}{space 2} 3765.945{col 37}{space 1}   -2.77{col 46}{space 3}0.007{col 54}{space 4}-17938.31{col 67}{space 3}-2912.748
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-121463.8{col 26}{space 2} 847500.5{col 37}{space 1}   -0.14{col 46}{space 3}0.886{col 54}{space 4} -1805601{col 67}{space 3}  1562674
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. **INTERACTION BY Race**
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.1251
{txt}{col 49}Largest FMI{col 67}= {res}    0.5243
{txt}{col 49}Complete DF{col 67}= {res}       199
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     15.35
{txt}{col 49}        avg{col 67}= {res}    134.58
{txt}{col 49}        max{col 67}= {res}    193.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  184.8{txt}){col 67}= {res}     12.44
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 21170.05{col 28}{space 2} 17934.81{col 39}{space 1}    1.18{col 48}{space 3}0.239{col 56}{space 4}-14213.63{col 69}{space 3} 56553.73
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 26559.36{col 28}{space 2} 50104.71{col 39}{space 1}    0.53{col 48}{space 3}0.597{col 56}{space 4}-72277.17{col 69}{space 3} 125395.9
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-40154.59{col 28}{space 2} 21533.96{col 39}{space 1}   -1.86{col 48}{space 3}0.064{col 56}{space 4}-82628.98{col 69}{space 3} 2319.793
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 158685.6{col 28}{space 2} 16448.04{col 39}{space 1}    9.65{col 48}{space 3}0.000{col 56}{space 4} 126095.4{col 69}{space 3} 191275.8
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1623.497{col 28}{space 2} 824.2588{col 39}{space 1}   -1.97{col 48}{space 3}0.050{col 56}{space 4}-3249.261{col 69}{space 3}   2.2677
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-290.1287{col 28}{space 2} 14646.52{col 39}{space 1}   -0.02{col 48}{space 3}0.984{col 56}{space 4}-29177.93{col 69}{space 3} 28597.67
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} -25.1349{col 28}{space 2} 9.898212{col 39}{space 1}   -2.54{col 48}{space 3}0.012{col 56}{space 4}-44.65971{col 69}{space 3} -5.61009
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2073.797{col 28}{space 2} 1090.534{col 39}{space 1}    1.90{col 48}{space 3}0.059{col 56}{space 4}-82.84478{col 69}{space 3} 4230.438
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-450.0058{col 28}{space 2} 32576.22{col 39}{space 1}   -0.01{col 48}{space 3}0.989{col 56}{space 4} -69747.8{col 69}{space 3} 68847.79
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-562517.5{col 28}{space 2}  1155929{col 39}{space 1}   -0.49{col 48}{space 3}0.628{col 56}{space 4} -2857212{col 69}{space 3}  1732177
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 1571.092{col 28}{space 2} 1813.657{col 39}{space 1}    0.87{col 48}{space 3}0.388{col 56}{space 4}-2015.249{col 69}{space 3} 5157.434
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 246.4877{col 28}{space 2} 327.0218{col 39}{space 1}    0.75{col 48}{space 3}0.454{col 56}{space 4}-408.7525{col 69}{space 3}  901.728
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-15822.13{col 28}{space 2} 5396.798{col 39}{space 1}   -2.93{col 48}{space 3}0.004{col 56}{space 4}-26540.02{col 69}{space 3}-5104.236
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1579150{col 28}{space 2}  1159267{col 39}{space 1}    1.36{col 48}{space 3}0.176{col 56}{space 4}-720401.6{col 69}{space 3}  3878701
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.1772
{txt}{col 49}Largest FMI{col 67}= {res}    0.5887
{txt}{col 49}Complete DF{col 67}= {res}       199
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     12.28
{txt}{col 49}        avg{col 67}= {res}    119.82
{txt}{col 49}        max{col 67}= {res}    193.54
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  176.0{txt}){col 67}= {res}     12.27
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 2797.088{col 28}{space 2} 9906.004{col 39}{space 1}    0.28{col 48}{space 3}0.778{col 56}{space 4} -16753.8{col 69}{space 3} 22347.98
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-6939.634{col 28}{space 2}  27549.9{col 39}{space 1}   -0.25{col 48}{space 3}0.801{col 56}{space 4}-61289.87{col 69}{space 3} 47410.61
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} -16843.9{col 28}{space 2} 11811.27{col 39}{space 1}   -1.43{col 48}{space 3}0.155{col 56}{space 4}-40140.86{col 69}{space 3} 6453.064
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 80115.19{col 28}{space 2} 9310.646{col 39}{space 1}    8.60{col 48}{space 3}0.000{col 56}{space 4} 61572.67{col 69}{space 3} 98657.71
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1659.222{col 28}{space 2} 454.7474{col 39}{space 1}   -3.65{col 48}{space 3}0.000{col 56}{space 4}-2556.358{col 69}{space 3}-762.0859
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} 858.0545{col 28}{space 2} 8028.997{col 39}{space 1}    0.11{col 48}{space 3}0.915{col 56}{space 4}-14977.51{col 69}{space 3} 16693.62
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-11.23503{col 28}{space 2}  5.43799{col 39}{space 1}   -2.07{col 48}{space 3}0.040{col 56}{space 4}-21.96244{col 69}{space 3}-.5076154
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1224.466{col 28}{space 2} 603.5437{col 39}{space 1}    2.03{col 48}{space 3}0.045{col 56}{space 4} 29.64441{col 69}{space 3} 2419.288
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} 4530.822{col 28}{space 2} 18975.95{col 39}{space 1}    0.24{col 48}{space 3}0.815{col 56}{space 4}-36709.85{col 69}{space 3} 45771.49
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-502078.5{col 28}{space 2} 638618.6{col 39}{space 1}   -0.79{col 48}{space 3}0.434{col 56}{space 4} -1771322{col 69}{space 3} 767164.8
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 1276.499{col 28}{space 2} 1047.043{col 39}{space 1}    1.22{col 48}{space 3}0.227{col 56}{space 4} -809.966{col 69}{space 3} 3362.964
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 177.9786{col 28}{space 2} 201.3037{col 39}{space 1}    0.88{col 48}{space 3}0.386{col 56}{space 4}-238.5317{col 69}{space 3} 594.4889
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-7442.548{col 28}{space 2} 3028.839{col 39}{space 1}   -2.46{col 48}{space 3}0.016{col 56}{space 4}-13482.49{col 69}{space 3}-1402.602
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1119714{col 28}{space 2} 639950.7{col 39}{space 1}    1.75{col 48}{space 3}0.083{col 56}{space 4}  -150965{col 69}{space 3}  2390393
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0961
{txt}{col 49}Largest FMI{col 67}= {res}    0.4542
{txt}{col 49}Complete DF{col 67}= {res}       199
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     19.93
{txt}{col 49}        avg{col 67}= {res}    140.97
{txt}{col 49}        max{col 67}= {res}    194.77
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  189.1{txt}){col 67}= {res}      8.72
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 11795.03{col 28}{space 2}  8648.78{col 39}{space 1}    1.36{col 48}{space 3}0.174{col 56}{space 4}-5263.812{col 69}{space 3} 28853.86
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 26161.49{col 28}{space 2} 24230.39{col 39}{space 1}    1.08{col 48}{space 3}0.282{col 56}{space 4}-21629.21{col 69}{space 3} 73952.19
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-18894.62{col 28}{space 2}  10423.7{col 39}{space 1}   -1.81{col 48}{space 3}0.071{col 56}{space 4}-39452.98{col 69}{space 3} 1663.743
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 66910.63{col 28}{space 2} 7820.813{col 39}{space 1}    8.56{col 48}{space 3}0.000{col 56}{space 4} 51452.54{col 69}{space 3} 82368.71
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-393.0653{col 28}{space 2} 398.8278{col 39}{space 1}   -0.99{col 48}{space 3}0.326{col 56}{space 4}-1179.641{col 69}{space 3} 393.5105
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4512.332{col 28}{space 2} 7127.456{col 39}{space 1}   -0.63{col 48}{space 3}0.527{col 56}{space 4}-18571.07{col 69}{space 3} 9546.405
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-11.76734{col 28}{space 2} 4.800758{col 39}{space 1}   -2.45{col 48}{space 3}0.015{col 56}{space 4}-21.23678{col 69}{space 3}-2.297889
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 746.8198{col 28}{space 2} 528.0807{col 39}{space 1}    1.41{col 48}{space 3}0.160{col 56}{space 4}-297.2261{col 69}{space 3} 1790.866
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-4640.283{col 28}{space 2} 14943.89{col 39}{space 1}   -0.31{col 48}{space 3}0.759{col 56}{space 4}-35819.55{col 69}{space 3} 26538.98
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-225841.4{col 28}{space 2} 560368.7{col 39}{space 1}   -0.40{col 48}{space 3}0.688{col 56}{space 4} -1338015{col 69}{space 3} 886332.2
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 630.3977{col 28}{space 2} 903.5969{col 39}{space 1}    0.70{col 48}{space 3}0.487{col 56}{space 4}-1162.453{col 69}{space 3} 2423.249
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 94.53977{col 28}{space 2} 148.8238{col 39}{space 1}    0.64{col 48}{space 3}0.527{col 56}{space 4}-200.1941{col 69}{space 3} 389.2737
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-7234.867{col 28}{space 2} 2606.229{col 39}{space 1}   -2.78{col 48}{space 3}0.007{col 56}{space 4}-12406.49{col 69}{space 3}-2063.241
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 625935.6{col 28}{space 2}   562323{col 39}{space 1}    1.11{col 48}{space 3}0.268{col 56}{space 4}-489368.9{col 69}{space 3}  1741240
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 5: MODEL2+OXIDATIVE STRESS******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.1232
{txt}{col 49}Largest FMI{col 67}= {res}    0.4621
{txt}{col 49}Complete DF{col 67}= {res}        80
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     15.59
{txt}{col 49}        avg{col 67}= {res}     57.46
{txt}{col 49}        max{col 67}= {res}     76.79
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   74.3{txt}){col 67}= {res}      5.99
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-22775.98{col 26}{space 2} 16151.31{col 37}{space 1}   -1.41{col 46}{space 3}0.163{col 54}{space 4}-54940.69{col 67}{space 3} 9388.716
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 119034.8{col 26}{space 2} 19199.83{col 37}{space 1}    6.20{col 46}{space 3}0.000{col 54}{space 4}  80782.4{col 67}{space 3} 157287.1
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1596.978{col 26}{space 2} 1242.911{col 37}{space 1}   -1.28{col 46}{space 3}0.203{col 54}{space 4}-4079.325{col 67}{space 3} 885.3694
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 32718.98{col 26}{space 2}  21644.5{col 37}{space 1}    1.51{col 46}{space 3}0.135{col 54}{space 4}-10382.64{col 67}{space 3}  75820.6
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-22.39983{col 26}{space 2}  16.3973{col 37}{space 1}   -1.37{col 46}{space 3}0.176{col 54}{space 4}-55.09156{col 67}{space 3}  10.2919
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 577.1838{col 26}{space 2} 1640.646{col 37}{space 1}    0.35{col 46}{space 3}0.727{col 54}{space 4} -2733.62{col 67}{space 3} 3887.988
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}  1667.77{col 26}{space 2} 1666.781{col 37}{space 1}    1.00{col 46}{space 3}0.332{col 54}{space 4}-1873.246{col 67}{space 3} 5208.787
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 7675.027{col 26}{space 2} 34868.42{col 37}{space 1}    0.22{col 46}{space 3}0.827{col 54}{space 4}-62459.49{col 67}{space 3} 77809.54
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 4914.745{col 26}{space 2} 5362.185{col 37}{space 1}    0.92{col 46}{space 3}0.363{col 54}{space 4}-5803.121{col 67}{space 3} 15632.61
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 966980.6{col 26}{space 2} 191073.8{col 37}{space 1}    5.06{col 46}{space 3}0.000{col 54}{space 4} 581706.2{col 67}{space 3}  1352255
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.1210
{txt}{col 49}Largest FMI{col 67}= {res}    0.4351
{txt}{col 49}Complete DF{col 67}= {res}        80
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     17.09
{txt}{col 49}        avg{col 67}= {res}     57.22
{txt}{col 49}        max{col 67}= {res}     76.60
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   74.5{txt}){col 67}= {res}      6.22
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-13789.16{col 26}{space 2} 9414.799{col 37}{space 1}   -1.46{col 46}{space 3}0.147{col 54}{space 4}-32540.83{col 67}{space 3} 4962.506
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 61213.99{col 26}{space 2} 11129.73{col 37}{space 1}    5.50{col 46}{space 3}0.000{col 54}{space 4} 39044.49{col 67}{space 3} 83383.49
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1583.676{col 26}{space 2} 722.3251{col 37}{space 1}   -2.19{col 46}{space 3}0.032{col 54}{space 4}-3026.203{col 67}{space 3}-141.1483
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 21495.27{col 26}{space 2} 12596.09{col 37}{space 1}    1.71{col 46}{space 3}0.092{col 54}{space 4}-3588.828{col 67}{space 3} 46579.36
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -14.3957{col 26}{space 2} 9.510467{col 37}{space 1}   -1.51{col 46}{space 3}0.134{col 54}{space 4}-33.35278{col 67}{space 3} 4.561375
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 286.3214{col 26}{space 2} 982.0354{col 37}{space 1}    0.29{col 46}{space 3}0.772{col 54}{space 4}-1709.355{col 67}{space 3} 2281.998
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 561.9019{col 26}{space 2} 950.3074{col 37}{space 1}    0.59{col 46}{space 3}0.562{col 54}{space 4} -1442.25{col 67}{space 3} 2566.054
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 721.7412{col 26}{space 2} 20114.37{col 37}{space 1}    0.04{col 46}{space 3}0.972{col 54}{space 4}-39673.87{col 67}{space 3} 41117.35
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 4010.762{col 26}{space 2} 3139.096{col 37}{space 1}    1.28{col 46}{space 3}0.206{col 54}{space 4}-2269.726{col 67}{space 3} 10291.25
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 600265.8{col 26}{space 2} 110214.8{col 37}{space 1}    5.45{col 46}{space 3}0.000{col 54}{space 4} 378415.1{col 67}{space 3} 822116.4
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.0845
{txt}{col 49}Largest FMI{col 67}= {res}    0.3667
{txt}{col 49}Complete DF{col 67}= {res}        80
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     21.78
{txt}{col 49}        avg{col 67}= {res}     64.44
{txt}{col 49}        max{col 67}= {res}     77.40
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   76.0{txt}){col 67}= {res}      4.36
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-10201.08{col 26}{space 2} 7338.103{col 37}{space 1}   -1.39{col 46}{space 3}0.168{col 54}{space 4}-24811.92{col 67}{space 3} 4409.751
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 46671.26{col 26}{space 2} 8801.418{col 37}{space 1}    5.30{col 46}{space 3}0.000{col 54}{space 4} 29129.53{col 67}{space 3} 64212.99
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-351.2089{col 26}{space 2} 557.1541{col 37}{space 1}   -0.63{col 46}{space 3}0.530{col 54}{space 4}-1461.908{col 67}{space 3} 759.4898
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 6100.991{col 26}{space 2} 9849.448{col 37}{space 1}    0.62{col 46}{space 3}0.537{col 54}{space 4}-13510.48{col 67}{space 3} 25712.46
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-5.635439{col 26}{space 2}  7.42204{col 37}{space 1}   -0.76{col 46}{space 3}0.450{col 54}{space 4}-20.42372{col 67}{space 3} 9.152843
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 37.50686{col 26}{space 2} 708.2413{col 37}{space 1}    0.05{col 46}{space 3}0.958{col 54}{space 4}-1377.647{col 67}{space 3} 1452.661
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 922.6536{col 26}{space 2}  711.234{col 37}{space 1}    1.30{col 46}{space 3}0.208{col 54}{space 4}-553.2107{col 67}{space 3} 2398.518
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 7352.144{col 26}{space 2} 15476.07{col 37}{space 1}    0.48{col 46}{space 3}0.637{col 54}{space 4}-23624.75{col 67}{space 3} 38329.04
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 1240.003{col 26}{space 2} 2404.719{col 37}{space 1}    0.52{col 46}{space 3}0.608{col 54}{space 4}-3556.785{col 67}{space 3} 6036.791
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 369720.7{col 26}{space 2} 83819.79{col 37}{space 1}    4.41{col 46}{space 3}0.000{col 54}{space 4} 201945.8{col 67}{space 3} 537495.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0666
{txt}{col 49}Largest FMI{col 67}= {res}    0.4077
{txt}{col 49}Complete DF{col 67}= {res}       113
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     21.05
{txt}{col 49}        avg{col 67}= {res}     99.53
{txt}{col 49}        max{col 67}= {res}    110.95
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  108.6{txt}){col 67}= {res}      8.73
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 14888.57{col 26}{space 2} 19110.01{col 37}{space 1}    0.78{col 46}{space 3}0.438{col 54}{space 4} -22982.9{col 67}{space 3} 52760.05
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 150450.8{col 26}{space 2} 18360.94{col 37}{space 1}    8.19{col 46}{space 3}0.000{col 54}{space 4} 114063.8{col 67}{space 3} 186837.7
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1863.069{col 26}{space 2} 1149.624{col 37}{space 1}   -1.62{col 46}{space 3}0.108{col 54}{space 4}-4141.164{col 67}{space 3} 415.0261
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-28508.25{col 26}{space 2} 20767.73{col 37}{space 1}   -1.37{col 46}{space 3}0.173{col 54}{space 4}-69663.56{col 67}{space 3} 12647.06
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-23.90582{col 26}{space 2} 13.38153{col 37}{space 1}   -1.79{col 46}{space 3}0.077{col 54}{space 4}-50.42233{col 67}{space 3}  2.61069
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1077.087{col 26}{space 2} 1411.046{col 37}{space 1}    0.76{col 46}{space 3}0.447{col 54}{space 4}-1719.241{col 67}{space 3} 3873.414
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 297.9331{col 26}{space 2} 1082.289{col 37}{space 1}    0.28{col 46}{space 3}0.786{col 54}{space 4}-1952.507{col 67}{space 3} 2548.373
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-34199.57{col 26}{space 2} 35360.14{col 37}{space 1}   -0.97{col 46}{space 3}0.336{col 54}{space 4}-104320.9{col 67}{space 3} 35921.71
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-2948.337{col 26}{space 2} 4473.354{col 37}{space 1}   -0.66{col 46}{space 3}0.511{col 54}{space 4}-11825.85{col 67}{space 3} 5929.174
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1210998{col 26}{space 2} 193415.7{col 37}{space 1}    6.26{col 46}{space 3}0.000{col 54}{space 4} 827706.1{col 67}{space 3}  1594290
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0860
{txt}{col 49}Largest FMI{col 67}= {res}    0.4716
{txt}{col 49}Complete DF{col 67}= {res}       113
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     16.65
{txt}{col 49}        avg{col 67}= {res}     96.94
{txt}{col 49}        max{col 67}= {res}    111.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  107.3{txt}){col 67}= {res}      8.25
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 1562.809{col 26}{space 2} 10007.24{col 37}{space 1}    0.16{col 46}{space 3}0.876{col 54}{space 4}-18268.72{col 67}{space 3} 21394.34
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 75092.69{col 26}{space 2} 9608.836{col 37}{space 1}    7.81{col 46}{space 3}0.000{col 54}{space 4} 56051.06{col 67}{space 3} 94134.31
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1520.383{col 26}{space 2} 603.2076{col 37}{space 1}   -2.52{col 46}{space 3}0.013{col 54}{space 4}-2715.738{col 67}{space 3}-325.0273
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}   -17823{col 26}{space 2} 10888.84{col 37}{space 1}   -1.64{col 46}{space 3}0.105{col 54}{space 4} -39401.7{col 67}{space 3} 3755.708
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-7.511176{col 26}{space 2} 7.010288{col 37}{space 1}   -1.07{col 46}{space 3}0.286{col 54}{space 4} -21.4025{col 67}{space 3} 6.380147
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1059.871{col 26}{space 2}  739.125{col 37}{space 1}    1.43{col 46}{space 3}0.154{col 54}{space 4}-404.8654{col 67}{space 3} 2524.608
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 111.8787{col 26}{space 2} 594.3133{col 37}{space 1}    0.19{col 46}{space 3}0.853{col 54}{space 4}-1144.033{col 67}{space 3}  1367.79
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-9383.062{col 26}{space 2} 18721.49{col 37}{space 1}   -0.50{col 46}{space 3}0.617{col 54}{space 4}-46537.68{col 67}{space 3} 27771.56
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 409.6274{col 26}{space 2}  2394.44{col 37}{space 1}    0.17{col 46}{space 3}0.865{col 54}{space 4}-4353.022{col 67}{space 3} 5172.277
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 665112.5{col 26}{space 2} 101502.3{col 37}{space 1}    6.55{col 46}{space 3}0.000{col 54}{space 4} 463956.3{col 67}{space 3} 866268.6
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0618
{txt}{col 49}Largest FMI{col 67}= {res}    0.3726
{txt}{col 49}Complete DF{col 67}= {res}       113
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     24.12
{txt}{col 49}        avg{col 67}= {res}     99.17
{txt}{col 49}        max{col 67}= {res}    110.82
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  108.9{txt}){col 67}= {res}      6.78
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 9304.424{col 26}{space 2} 9571.222{col 37}{space 1}    0.97{col 46}{space 3}0.333{col 54}{space 4}  -9663.5{col 67}{space 3} 28272.35
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 63840.77{col 26}{space 2} 9224.015{col 37}{space 1}    6.92{col 46}{space 3}0.000{col 54}{space 4} 45558.99{col 67}{space 3} 82122.55
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -652.885{col 26}{space 2} 575.7665{col 37}{space 1}   -1.13{col 46}{space 3}0.259{col 54}{space 4}-1793.825{col 67}{space 3} 488.0552
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-13191.97{col 26}{space 2}  10390.7{col 37}{space 1}   -1.27{col 46}{space 3}0.207{col 54}{space 4}-33782.62{col 67}{space 3} 7398.675
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -13.7293{col 26}{space 2} 6.712026{col 37}{space 1}   -2.05{col 46}{space 3}0.043{col 54}{space 4}-27.03021{col 67}{space 3}-.4284002
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 301.0729{col 26}{space 2} 711.5967{col 37}{space 1}    0.42{col 46}{space 3}0.673{col 54}{space 4}-1109.511{col 67}{space 3} 1711.657
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 217.6683{col 26}{space 2} 529.3317{col 37}{space 1}    0.41{col 46}{space 3}0.685{col 54}{space 4}-874.5384{col 67}{space 3} 1309.875
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-13308.98{col 26}{space 2} 17810.07{col 37}{space 1}   -0.75{col 46}{space 3}0.457{col 54}{space 4}-48641.34{col 67}{space 3} 22023.38
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-2380.323{col 26}{space 2} 2220.763{col 37}{space 1}   -1.07{col 46}{space 3}0.286{col 54}{space 4}-6784.566{col 67}{space 3}  2023.92
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   478325{col 26}{space 2} 98032.54{col 37}{space 1}    4.88{col 46}{space 3}0.000{col 54}{space 4} 283953.4{col 67}{space 3} 672696.6
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. **********INTERACTION BY Race***************
. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0121
{txt}{col 49}Largest FMI{col 67}= {res}    0.1129
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    103.91
{txt}{col 49}        avg{col 67}= {res}    159.21
{txt}{col 49}        max{col 67}= {res}    165.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  164.8{txt}){col 67}= {res}     13.10
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 16202.86{col 28}{space 2} 18537.47{col 39}{space 1}    0.87{col 48}{space 3}0.383{col 56}{space 4}-20398.82{col 69}{space 3} 52804.53
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 17269.66{col 28}{space 2} 55183.68{col 39}{space 1}    0.31{col 48}{space 3}0.755{col 56}{space 4}-91693.88{col 69}{space 3} 126233.2
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-37261.04{col 28}{space 2} 23704.76{col 39}{space 1}   -1.57{col 48}{space 3}0.118{col 56}{space 4} -84065.3{col 69}{space 3} 9543.226
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 140172.6{col 28}{space 2} 14195.24{col 39}{space 1}    9.87{col 48}{space 3}0.000{col 56}{space 4} 112143.7{col 69}{space 3} 168201.5
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2286.919{col 28}{space 2} 864.4696{col 39}{space 1}   -2.65{col 48}{space 3}0.009{col 56}{space 4}-3993.786{col 69}{space 3}-580.0526
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -329.345{col 28}{space 2} 16060.73{col 39}{space 1}   -0.02{col 48}{space 3}0.984{col 56}{space 4}-32040.96{col 69}{space 3} 31382.27
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-20.24258{col 28}{space 2} 11.77347{col 39}{space 1}   -1.72{col 48}{space 3}0.087{col 56}{space 4}-43.48937{col 69}{space 3}  3.00421
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 785.7691{col 28}{space 2} 1114.768{col 39}{space 1}    0.70{col 48}{space 3}0.482{col 56}{space 4}-1415.306{col 69}{space 3} 2986.844
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 807.8759{col 28}{space 2} 801.5262{col 39}{space 1}    1.01{col 48}{space 3}0.316{col 56}{space 4}-781.5971{col 69}{space 3} 2397.349
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2}-2484.622{col 28}{space 2} 27146.86{col 39}{space 1}   -0.09{col 48}{space 3}0.927{col 56}{space 4}-56084.62{col 69}{space 3} 51115.37
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-2196.042{col 28}{space 2} 3507.404{col 39}{space 1}   -0.63{col 48}{space 3}0.532{col 56}{space 4}-9122.332{col 69}{space 3} 4730.249
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1054513{col 28}{space 2} 150663.1{col 39}{space 1}    7.00{col 48}{space 3}0.000{col 56}{space 4} 757030.1{col 69}{space 3}  1351997
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0072
{txt}{col 49}Largest FMI{col 67}= {res}    0.0710
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    130.64
{txt}{col 49}        avg{col 67}= {res}    161.80
{txt}{col 49}        max{col 67}= {res}    165.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  165.0{txt}){col 67}= {res}     14.68
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 3743.979{col 28}{space 2} 9969.809{col 39}{space 1}    0.38{col 48}{space 3}0.708{col 56}{space 4}-15940.96{col 69}{space 3} 23428.92
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-10653.72{col 28}{space 2} 29650.86{col 39}{space 1}   -0.36{col 48}{space 3}0.720{col 56}{space 4}-69199.43{col 69}{space 3}    47892
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-16647.57{col 28}{space 2} 12749.72{col 39}{space 1}   -1.31{col 48}{space 3}0.193{col 56}{space 4} -41821.3{col 69}{space 3} 8526.155
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 71826.22{col 28}{space 2} 7628.286{col 39}{space 1}    9.42{col 48}{space 3}0.000{col 56}{space 4} 56764.32{col 69}{space 3} 86888.13
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1948.831{col 28}{space 2}  464.902{col 39}{space 1}   -4.19{col 48}{space 3}0.000{col 56}{space 4}-2866.757{col 69}{space 3}-1030.905
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-1769.847{col 28}{space 2}  8636.66{col 39}{space 1}   -0.20{col 48}{space 3}0.838{col 56}{space 4} -18822.6{col 69}{space 3}  15282.9
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-7.107043{col 28}{space 2} 6.329877{col 39}{space 1}   -1.12{col 48}{space 3}0.263{col 56}{space 4}-19.60525{col 69}{space 3} 5.391158
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}  677.234{col 28}{space 2} 599.6212{col 39}{space 1}    1.13{col 48}{space 3}0.260{col 56}{space 4}-506.6936{col 69}{space 3} 1861.162
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 260.2571{col 28}{space 2}  422.239{col 39}{space 1}    0.62{col 48}{space 3}0.539{col 56}{space 4}-575.0537{col 69}{space 3} 1095.568
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 5199.335{col 28}{space 2} 14605.96{col 39}{space 1}    0.36{col 48}{space 3}0.722{col 56}{space 4}-23639.31{col 69}{space 3} 34037.98
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} 571.4228{col 28}{space 2} 1881.708{col 39}{space 1}    0.30{col 48}{space 3}0.762{col 56}{space 4}-3144.198{col 69}{space 3} 4287.044
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 608544.4{col 28}{space 2} 81014.45{col 39}{space 1}    7.51{col 48}{space 3}0.000{col 56}{space 4} 448583.8{col 69}{space 3}   768505
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0136
{txt}{col 49}Largest FMI{col 67}= {res}    0.1179
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    100.92
{txt}{col 49}        avg{col 67}= {res}    158.72
{txt}{col 49}        max{col 67}= {res}    164.97
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  164.8{txt}){col 67}= {res}      8.92
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 7597.932{col 28}{space 2} 8999.004{col 39}{space 1}    0.84{col 48}{space 3}0.400{col 56}{space 4}-10170.49{col 69}{space 3} 25366.35
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 22875.57{col 28}{space 2} 26793.24{col 39}{space 1}    0.85{col 48}{space 3}0.394{col 56}{space 4}-30030.14{col 69}{space 3} 75781.28
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-17140.07{col 28}{space 2} 11505.45{col 39}{space 1}   -1.49{col 48}{space 3}0.138{col 56}{space 4}-39857.33{col 69}{space 3} 5577.188
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 57397.63{col 28}{space 2}   6896.3{col 39}{space 1}    8.32{col 48}{space 3}0.000{col 56}{space 4}  43780.3{col 69}{space 3} 71014.96
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-697.7378{col 28}{space 2} 419.5756{col 39}{space 1}   -1.66{col 48}{space 3}0.098{col 56}{space 4} -1526.18{col 69}{space 3} 130.7047
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3183.485{col 28}{space 2} 7795.259{col 39}{space 1}   -0.41{col 48}{space 3}0.684{col 56}{space 4}-18575.17{col 69}{space 3}  12208.2
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-10.74342{col 28}{space 2} 5.714115{col 39}{space 1}   -1.88{col 48}{space 3}0.062{col 56}{space 4}-22.02605{col 69}{space 3} .5392021
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 215.8497{col 28}{space 2} 541.0482{col 39}{space 1}    0.40{col 48}{space 3}0.690{col 56}{space 4}-852.4392{col 69}{space 3} 1284.139
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 521.6599{col 28}{space 2} 389.9041{col 39}{space 1}    1.34{col 48}{space 3}0.184{col 56}{space 4}-251.8123{col 69}{space 3} 1295.132
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 690.5248{col 28}{space 2} 13172.87{col 39}{space 1}    0.05{col 48}{space 3}0.958{col 56}{space 4}-25318.63{col 69}{space 3} 26699.68
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-1975.906{col 28}{space 2} 1704.147{col 39}{space 1}   -1.16{col 48}{space 3}0.248{col 56}{space 4}-5341.344{col 69}{space 3} 1389.533
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 405876.2{col 28}{space 2} 73114.42{col 39}{space 1}    5.55{col 48}{space 3}0.000{col 56}{space 4} 261511.9{col 69}{space 3} 550240.6
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***********MODEL 6: MODEL 2+lifestyle/health-related factors*******  
. 
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.0261
{txt}{col 49}Largest FMI{col 67}= {res}    0.1452
{txt}{col 49}Complete DF{col 67}= {res}        81
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     52.31
{txt}{col 49}        avg{col 67}= {res}     74.08
{txt}{col 49}        max{col 67}= {res}     79.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   78.7{txt}){col 67}= {res}      7.74
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-17833.03{col 26}{space 2} 15859.11{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-49401.51{col 67}{space 3} 13735.45
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 116190.5{col 26}{space 2} 18814.48{col 37}{space 1}    6.18{col 46}{space 3}0.000{col 54}{space 4} 78738.24{col 67}{space 3} 153642.8
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1465.373{col 26}{space 2} 1163.257{col 37}{space 1}   -1.26{col 46}{space 3}0.211{col 54}{space 4}-3780.933{col 67}{space 3} 850.1876
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 29782.59{col 26}{space 2} 21109.23{col 37}{space 1}    1.41{col 46}{space 3}0.162{col 54}{space 4}-12233.82{col 67}{space 3} 71798.99
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-27.93294{col 26}{space 2} 15.35238{col 37}{space 1}   -1.82{col 46}{space 3}0.073{col 54}{space 4}-58.49096{col 67}{space 3} 2.625079
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-205.6012{col 26}{space 2} 1534.495{col 37}{space 1}   -0.13{col 46}{space 3}0.894{col 54}{space 4}-3284.354{col 67}{space 3} 2873.152
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}     1487{col 26}{space 2} 20990.96{col 37}{space 1}    0.07{col 46}{space 3}0.944{col 54}{space 4}-40412.21{col 67}{space 3} 43386.21
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 22313.93{col 26}{space 2} 11602.97{col 37}{space 1}    1.92{col 46}{space 3}0.058{col 54}{space 4}-782.3969{col 67}{space 3} 45410.26
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1014830{col 26}{space 2} 84658.28{col 37}{space 1}   11.99{col 46}{space 3}0.000{col 54}{space 4} 846171.8{col 67}{space 3}  1183488
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.0371
{txt}{col 49}Largest FMI{col 67}= {res}    0.2125
{txt}{col 49}Complete DF{col 67}= {res}        81
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     39.91
{txt}{col 49}        avg{col 67}= {res}     72.27
{txt}{col 49}        max{col 67}= {res}     79.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   78.5{txt}){col 67}= {res}      8.29
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-10579.08{col 26}{space 2} 9128.149{col 37}{space 1}   -1.16{col 46}{space 3}0.250{col 54}{space 4}-28749.78{col 67}{space 3} 7591.609
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 59877.82{col 26}{space 2} 10823.12{col 37}{space 1}    5.53{col 46}{space 3}0.000{col 54}{space 4}    38333{col 67}{space 3} 81422.64
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1591.002{col 26}{space 2} 669.3826{col 37}{space 1}   -2.38{col 46}{space 3}0.020{col 54}{space 4}-2923.496{col 67}{space 3}-258.5084
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 20447.01{col 26}{space 2} 12140.71{col 37}{space 1}    1.68{col 46}{space 3}0.096{col 54}{space 4} -3718.29{col 67}{space 3} 44612.31
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -16.7656{col 26}{space 2} 8.827759{col 37}{space 1}   -1.90{col 46}{space 3}0.061{col 54}{space 4}-34.33666{col 67}{space 3} .8054712
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-149.3563{col 26}{space 2} 914.3547{col 37}{space 1}   -0.16{col 46}{space 3}0.871{col 54}{space 4}-1997.473{col 67}{space 3}  1698.76
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} -7420.16{col 26}{space 2} 12098.93{col 37}{space 1}   -0.61{col 46}{space 3}0.542{col 54}{space 4}-31576.69{col 67}{space 3} 16736.37
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 14371.04{col 26}{space 2} 6685.147{col 37}{space 1}    2.15{col 46}{space 3}0.035{col 54}{space 4} 1062.948{col 67}{space 3} 27679.12
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 607038.8{col 26}{space 2} 49003.81{col 37}{space 1}   12.39{col 46}{space 3}0.000{col 54}{space 4} 509361.5{col 67}{space 3} 704716.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.0153
{txt}{col 49}Largest FMI{col 67}= {res}    0.0655
{txt}{col 49}Complete DF{col 67}= {res}        81
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     69.28
{txt}{col 49}        avg{col 67}= {res}     76.48
{txt}{col 49}        max{col 67}= {res}     78.97
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   78.9{txt}){col 67}= {res}      5.26
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-8440.645{col 26}{space 2} 7283.691{col 37}{space 1}   -1.16{col 46}{space 3}0.250{col 54}{space 4}-22938.57{col 67}{space 3} 6057.277
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 45448.42{col 26}{space 2} 8656.363{col 37}{space 1}    5.25{col 46}{space 3}0.000{col 54}{space 4} 28216.73{col 67}{space 3} 62680.11
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-247.3305{col 26}{space 2} 534.3591{col 37}{space 1}   -0.46{col 46}{space 3}0.645{col 54}{space 4}-1310.972{col 67}{space 3} 816.3111
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 4455.334{col 26}{space 2} 9719.627{col 37}{space 1}    0.46{col 46}{space 3}0.648{col 54}{space 4}-14891.63{col 67}{space 3} 23802.29
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.414008{col 26}{space 2} 7.071223{col 37}{space 1}   -1.19{col 46}{space 3}0.238{col 54}{space 4}-22.48957{col 67}{space 3} 5.661555
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-273.1871{col 26}{space 2} 677.9198{col 37}{space 1}   -0.40{col 46}{space 3}0.688{col 54}{space 4}-1625.502{col 67}{space 3} 1079.127
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 8060.287{col 26}{space 2} 9587.851{col 37}{space 1}    0.84{col 46}{space 3}0.403{col 54}{space 4}-11063.36{col 67}{space 3} 27183.93
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 7409.684{col 26}{space 2} 5336.769{col 37}{space 1}    1.39{col 46}{space 3}0.169{col 54}{space 4}-3213.469{col 67}{space 3} 18032.84
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 410809.6{col 26}{space 2} 38698.27{col 37}{space 1}   10.62{col 46}{space 3}0.000{col 54}{space 4} 333744.9{col 67}{space 3} 487874.2
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0196
{txt}{col 49}Largest FMI{col 67}= {res}    0.1502
{txt}{col 49}Complete DF{col 67}= {res}       114
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     65.59
{txt}{col 49}        avg{col 67}= {res}    106.10
{txt}{col 49}        max{col 67}= {res}    112.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  111.7{txt}){col 67}= {res}     10.28
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 17634.74{col 26}{space 2} 18913.21{col 37}{space 1}    0.93{col 46}{space 3}0.353{col 54}{space 4}   -19840{col 67}{space 3} 55109.47
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 141539.2{col 26}{space 2} 18106.78{col 37}{space 1}    7.82{col 46}{space 3}0.000{col 54}{space 4} 105659.8{col 67}{space 3} 177418.7
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1867.848{col 26}{space 2} 1152.697{col 37}{space 1}   -1.62{col 46}{space 3}0.108{col 54}{space 4}-4151.848{col 67}{space 3} 416.1525
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-28217.14{col 26}{space 2}  21355.4{col 37}{space 1}   -1.32{col 46}{space 3}0.189{col 54}{space 4}-70531.89{col 67}{space 3} 14097.61
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-22.34524{col 26}{space 2} 13.43884{col 37}{space 1}   -1.66{col 46}{space 3}0.099{col 54}{space 4}-48.97539{col 67}{space 3} 4.284916
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  1317.43{col 26}{space 2} 1384.279{col 37}{space 1}    0.95{col 46}{space 3}0.343{col 54}{space 4}-1425.754{col 67}{space 3} 4060.613
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-19876.26{col 26}{space 2} 26995.75{col 37}{space 1}   -0.74{col 46}{space 3}0.464{col 54}{space 4}-73781.27{col 67}{space 3} 34028.74
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 8599.093{col 26}{space 2} 11574.97{col 37}{space 1}    0.74{col 46}{space 3}0.459{col 54}{space 4}-14335.21{col 67}{space 3}  31533.4
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1042402{col 26}{space 2}  99432.3{col 37}{space 1}   10.48{col 46}{space 3}0.000{col 54}{space 4} 845345.5{col 67}{space 3}  1239459
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0221
{txt}{col 49}Largest FMI{col 67}= {res}    0.1608
{txt}{col 49}Complete DF{col 67}= {res}       114
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     62.32
{txt}{col 49}        avg{col 67}= {res}    105.55
{txt}{col 49}        max{col 67}= {res}    111.96
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  111.6{txt}){col 67}= {res}     10.42
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}  1947.84{col 26}{space 2} 9808.034{col 37}{space 1}    0.20{col 46}{space 3}0.843{col 54}{space 4}   -17486{col 67}{space 3} 21381.68
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  70923.9{col 26}{space 2} 9393.392{col 37}{space 1}    7.55{col 46}{space 3}0.000{col 54}{space 4} 52310.04{col 67}{space 3} 89537.76
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1601.126{col 26}{space 2} 597.8244{col 37}{space 1}   -2.68{col 46}{space 3}0.009{col 54}{space 4}-2785.693{col 67}{space 3}-416.5598
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-16992.85{col 26}{space 2} 11072.96{col 37}{space 1}   -1.53{col 46}{space 3}0.128{col 54}{space 4} -38933.5{col 67}{space 3} 4947.801
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-7.287592{col 26}{space 2} 6.993144{col 37}{space 1}   -1.04{col 46}{space 3}0.300{col 54}{space 4}-21.14697{col 67}{space 3} 6.571785
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1012.479{col 26}{space 2}  716.979{col 37}{space 1}    1.41{col 46}{space 3}0.161{col 54}{space 4}-408.2921{col 67}{space 3}  2433.25
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-16597.43{col 26}{space 2} 14072.77{col 37}{space 1}   -1.18{col 46}{space 3}0.243{col 54}{space 4}-44725.65{col 67}{space 3} 11530.79
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 5880.236{col 26}{space 2} 6001.962{col 37}{space 1}    0.98{col 46}{space 3}0.329{col 54}{space 4}-6011.925{col 67}{space 3}  17772.4
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 627243.8{col 26}{space 2} 51567.63{col 37}{space 1}   12.16{col 46}{space 3}0.000{col 54}{space 4} 525044.6{col 67}{space 3}   729443
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0181
{txt}{col 49}Largest FMI{col 67}= {res}    0.1355
{txt}{col 49}Complete DF{col 67}= {res}       114
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     70.35
{txt}{col 49}        avg{col 67}= {res}    106.32
{txt}{col 49}        max{col 67}= {res}    112.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  111.8{txt}){col 67}= {res}      7.66
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 11000.77{col 26}{space 2}  9529.35{col 37}{space 1}    1.15{col 46}{space 3}0.251{col 54}{space 4}-7880.642{col 67}{space 3} 29882.19
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 61394.03{col 26}{space 2}  9123.69{col 37}{space 1}    6.73{col 46}{space 3}0.000{col 54}{space 4} 43315.07{col 67}{space 3} 79472.99
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-589.5886{col 26}{space 2} 580.6091{col 37}{space 1}   -1.02{col 46}{space 3}0.312{col 54}{space 4}-1740.017{col 67}{space 3} 560.8394
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-13181.69{col 26}{space 2} 10756.33{col 37}{space 1}   -1.23{col 46}{space 3}0.223{col 54}{space 4}-34494.56{col 67}{space 3} 8131.181
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -13.6129{col 26}{space 2} 6.751153{col 37}{space 1}   -2.02{col 46}{space 3}0.046{col 54}{space 4}-26.98967{col 67}{space 3}-.2361381
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 482.7913{col 26}{space 2} 702.7294{col 37}{space 1}    0.69{col 46}{space 3}0.494{col 54}{space 4}-910.2332{col 67}{space 3} 1875.816
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 794.3236{col 26}{space 2} 13502.23{col 37}{space 1}    0.06{col 46}{space 3}0.953{col 54}{space 4}-26132.68{col 67}{space 3} 27721.33
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 2572.618{col 26}{space 2}  5832.65{col 37}{space 1}    0.44{col 46}{space 3}0.660{col 54}{space 4}-8983.993{col 67}{space 3} 14129.23
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 404633.9{col 26}{space 2}  50224.3{col 37}{space 1}    8.06{col 46}{space 3}0.000{col 54}{space 4} 305088.8{col 67}{space 3} 504178.9
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. ******************INTERACTION BY Race***********************
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0138
{txt}{col 49}Largest FMI{col 67}= {res}    0.0839
{txt}{col 49}Complete DF{col 67}= {res}       202
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    141.99
{txt}{col 49}        avg{col 67}= {res}    189.96
{txt}{col 49}        max{col 67}= {res}    199.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  199.7{txt}){col 67}= {res}     17.14
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 19393.38{col 28}{space 2} 17222.57{col 39}{space 1}    1.13{col 48}{space 3}0.262{col 56}{space 4}-14568.48{col 69}{space 3} 53355.24
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 14422.98{col 28}{space 2} 49609.74{col 39}{space 1}    0.29{col 48}{space 3}0.772{col 56}{space 4}-83402.32{col 69}{space 3} 112248.3
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-37323.05{col 28}{space 2} 21527.87{col 39}{space 1}   -1.73{col 48}{space 3}0.085{col 56}{space 4}-79773.92{col 69}{space 3} 5127.829
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 132979.7{col 28}{space 2} 12885.86{col 39}{space 1}   10.32{col 48}{space 3}0.000{col 56}{space 4}   107570{col 69}{space 3} 158389.5
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1925.932{col 28}{space 2} 809.3513{col 39}{space 1}   -2.38{col 48}{space 3}0.018{col 56}{space 4}-3521.898{col 69}{space 3}-329.9651
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-807.9605{col 28}{space 2} 14808.08{col 39}{space 1}   -0.05{col 48}{space 3}0.957{col 56}{space 4}-30008.14{col 69}{space 3} 28392.21
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-25.02888{col 28}{space 2} 9.944024{col 39}{space 1}   -2.52{col 48}{space 3}0.013{col 56}{space 4}-44.63815{col 69}{space 3}-5.419619
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 819.7935{col 28}{space 2} 1025.522{col 39}{space 1}    0.80{col 48}{space 3}0.425{col 56}{space 4} -1207.47{col 69}{space 3} 2847.057
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-10778.16{col 28}{space 2} 16308.06{col 39}{space 1}   -0.66{col 48}{space 3}0.510{col 56}{space 4}-42981.83{col 69}{space 3} 21425.51
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 14608.16{col 28}{space 2}  8088.74{col 39}{space 1}    1.81{col 48}{space 3}0.072{col 56}{space 4}-1342.055{col 69}{space 3} 30558.37
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1024434{col 28}{space 2}  72073.7{col 39}{space 1}   14.21{col 48}{space 3}0.000{col 56}{space 4} 882258.1{col 69}{space 3}  1166610
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0195
{txt}{col 49}Largest FMI{col 67}= {res}    0.1314
{txt}{col 49}Complete DF{col 67}= {res}       202
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    104.98
{txt}{col 49}        avg{col 67}= {res}    186.18
{txt}{col 49}        max{col 67}= {res}    199.91
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  199.4{txt}){col 67}= {res}     18.47
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 3765.222{col 28}{space 2} 9348.067{col 39}{space 1}    0.40{col 48}{space 3}0.688{col 56}{space 4}-14668.93{col 69}{space 3} 22199.37
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-14132.06{col 28}{space 2} 26904.68{col 39}{space 1}   -0.53{col 48}{space 3}0.600{col 56}{space 4}-67185.44{col 69}{space 3} 38921.32
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-14814.95{col 28}{space 2} 11677.51{col 39}{space 1}   -1.27{col 48}{space 3}0.206{col 56}{space 4}-37841.98{col 69}{space 3} 8212.091
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 67383.23{col 28}{space 2} 6987.508{col 39}{space 1}    9.64{col 48}{space 3}0.000{col 56}{space 4} 53604.47{col 69}{space 3}    81162
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1784.096{col 28}{space 2} 439.0374{col 39}{space 1}   -4.06{col 48}{space 3}0.000{col 56}{space 4}-2649.843{col 69}{space 3}-918.3495
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} 499.3832{col 28}{space 2} 8034.596{col 39}{space 1}    0.06{col 48}{space 3}0.951{col 56}{space 4}-15344.25{col 69}{space 3} 16343.02
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-11.38624{col 28}{space 2} 5.415389{col 39}{space 1}   -2.10{col 48}{space 3}0.037{col 56}{space 4}-22.06627{col 69}{space 3}-.7062022
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 583.2684{col 28}{space 2} 569.6727{col 39}{space 1}    1.02{col 48}{space 3}0.308{col 56}{space 4}-546.2896{col 69}{space 3} 1712.826
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-12498.65{col 28}{space 2} 8788.859{col 39}{space 1}   -1.42{col 48}{space 3}0.157{col 56}{space 4}-29846.25{col 69}{space 3} 4848.951
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 9993.423{col 28}{space 2} 4390.568{col 39}{space 1}    2.28{col 48}{space 3}0.024{col 56}{space 4} 1335.517{col 69}{space 3} 18651.33
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 625991.8{col 28}{space 2} 39350.87{col 39}{space 1}   15.91{col 48}{space 3}0.000{col 56}{space 4} 548338.8{col 69}{space 3} 703644.7
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0120
{txt}{col 49}Largest FMI{col 67}= {res}    0.0796
{txt}{col 49}Complete DF{col 67}= {res}       202
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    145.73
{txt}{col 49}        avg{col 67}= {res}    191.15
{txt}{col 49}        max{col 67}= {res}    200.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  199.8{txt}){col 67}= {res}     11.36
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 10479.41{col 28}{space 2} 8379.397{col 39}{space 1}    1.25{col 48}{space 3}0.213{col 56}{space 4}-6044.089{col 69}{space 3}  27002.9
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 21402.67{col 28}{space 2}  24153.7{col 39}{space 1}    0.89{col 48}{space 3}0.377{col 56}{space 4}-26225.97{col 69}{space 3} 69031.31
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-18417.51{col 28}{space 2} 10480.76{col 39}{space 1}   -1.76{col 48}{space 3}0.080{col 56}{space 4}-39084.56{col 69}{space 3} 2249.534
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 55294.14{col 28}{space 2} 6273.363{col 39}{space 1}    8.81{col 48}{space 3}0.000{col 56}{space 4} 42923.62{col 69}{space 3} 67664.65
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-496.9237{col 28}{space 2} 393.9652{col 39}{space 1}   -1.26{col 48}{space 3}0.209{col 56}{space 4}-1273.785{col 69}{space 3} 279.9377
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4779.928{col 28}{space 2} 7207.978{col 39}{space 1}   -0.66{col 48}{space 3}0.508{col 56}{space 4}-18993.36{col 69}{space 3} 9433.506
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-11.70441{col 28}{space 2}   4.8309{col 39}{space 1}   -2.42{col 48}{space 3}0.016{col 56}{space 4}-21.23046{col 69}{space 3}-2.178357
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 236.6033{col 28}{space 2} 492.4264{col 39}{space 1}    0.48{col 48}{space 3}0.632{col 56}{space 4}-735.6265{col 69}{space 3} 1208.833
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2} 2970.547{col 28}{space 2} 8014.526{col 39}{space 1}    0.37{col 48}{space 3}0.711{col 56}{space 4}-12869.17{col 69}{space 3} 18810.26
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 4128.505{col 28}{space 2} 3936.945{col 39}{space 1}    1.05{col 48}{space 3}0.296{col 56}{space 4}-3634.742{col 69}{space 3} 11891.75
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 399434.7{col 28}{space 2} 34977.52{col 39}{space 1}   11.42{col 48}{space 3}0.000{col 56}{space 4} 330445.4{col 69}{space 3}   468424
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}