{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. //////////////////////////////////////////////////TABLE S5: NFL at v1 AND v3 vs. Hippocampus and LnLesion volume adjusted for ICV_volM2,  by race///////////////////////////////////////////////////////////////////////////////////
>           
.           ////////////////////////////////////////LnNFLw1 EXPOSURE/////////////////////////////////////////////
> 
. 
. ***********************LnNFLw1, MODELS 1 AND 2*********************
. 
. *********************AFRICAN-AMERICAN*******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        81
{txt}{hline 13}{c +}{hline 34}   F(6, 74)        = {res}     9.82
{txt}       Model {c |} {res} 4360319.21         6  726719.868   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 5475745.46        74  73996.5603   {txt}R-squared       ={res}    0.4433
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3982
{txt}       Total {c |} {res} 9836064.67        80  122950.808   {txt}Root MSE        =   {res} 272.02

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 33.75394{col 26}{space 2} 69.62813{col 37}{space 1}    0.48{col 46}{space 3}0.629{col 67}{space 3} .0510559
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-35.81574{col 26}{space 2} 81.35268{col 37}{space 1}   -0.44{col 46}{space 3}0.661{col 67}{space 3}-.0512917
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-9.917578{col 26}{space 2} 4.045381{col 37}{space 1}   -2.45{col 46}{space 3}0.017{col 67}{space 3}-.2758433
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} -194.304{col 26}{space 2} 75.54538{col 37}{space 1}   -2.57{col 46}{space 3}0.012{col 67}{space 3} -.273972
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0117587{col 26}{space 2} .0580229{col 37}{space 1}    0.20{col 46}{space 3}0.840{col 67}{space 3} .0198255
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}  .001755{col 26}{space 2} .0003279{col 37}{space 1}    5.35{col 46}{space 3}0.000{col 67}{space 3} .6265461
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1838.151{col 26}{space 2} 441.0377{col 37}{space 1}    4.17{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        81
{txt}{hline 13}{c +}{hline 34}   F(6, 74)        = {res}    11.00
{txt}       Model {c |} {res} 4456772.68         6  742795.446   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 4995900.79        74  67512.1728   {txt}R-squared       ={res}    0.4715
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4286
{txt}       Total {c |} {res} 9452673.47        80  118158.418   {txt}Root MSE        =   {res} 259.83

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 28.40243{col 26}{space 2}  66.5074{col 37}{space 1}    0.43{col 46}{space 3}0.671{col 67}{space 3} .0438238
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-36.00451{col 26}{space 2} 77.70646{col 37}{space 1}   -0.46{col 46}{space 3}0.644{col 67}{space 3}-.0525973
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-8.771393{col 26}{space 2} 3.864068{col 37}{space 1}   -2.27{col 46}{space 3}0.026{col 67}{space 3}-.2488621
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-179.4274{col 26}{space 2} 72.15945{col 37}{space 1}   -2.49{col 46}{space 3}0.015{col 67}{space 3}-.2580753
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}  .032344{col 26}{space 2} .0554223{col 37}{space 1}    0.58{col 46}{space 3}0.561{col 67}{space 3} .0556278
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}  .001834{col 26}{space 2} .0003132{col 37}{space 1}    5.86{col 46}{space 3}0.000{col 67}{space 3} .6678928
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1900.029{col 26}{space 2} 421.2704{col 37}{space 1}    4.51{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if Race==2,beta 
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        80
{txt}{hline 13}{c +}{hline 34}   F(6, 73)        = {res}     2.77
{txt}       Model {c |} {res} 139.041818         6  23.1736364   {txt}Prob > F        ={res}    0.0175
{txt}    Residual {c |} {res} 610.619757        73  8.36465421   {txt}R-squared       ={res}    0.1855
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1185
{txt}       Total {c |} {res} 749.661575        79  9.48938703   {txt}Root MSE        =   {res} 2.8922

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 1.593774{col 26}{space 2} .7403937{col 37}{space 1}    2.15{col 46}{space 3}0.035{col 67}{space 3} .2754611
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .5086068{col 26}{space 2} .8739571{col 37}{space 1}    0.58{col 46}{space 3}0.562{col 67}{space 3}   .08297
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0263046{col 26}{space 2} .0432589{col 37}{space 1}    0.61{col 46}{space 3}0.545{col 67}{space 3} .0829003
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-.2667706{col 26}{space 2} .8034438{col 37}{space 1}   -0.33{col 46}{space 3}0.741{col 67}{space 3}-.0429009
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0006005{col 26}{space 2} .0006182{col 37}{space 1}   -0.97{col 46}{space 3}0.335{col 67}{space 3}-.1154386
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 4.30e-06{col 26}{space 2} 3.50e-06{col 37}{space 1}    1.23{col 46}{space 3}0.223{col 67}{space 3}   .17605
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.818937{col 26}{space 2} 4.699444{col 37}{space 1}   -0.60{col 46}{space 3}0.550{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        73
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     71.08
{txt}{col 49}        avg{col 67}= {res}     71.08
{txt}{col 49}        max{col 67}= {res}     71.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   71.1{txt}){col 67}= {res}      8.31
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 29.77564{col 26}{space 2} 77.58938{col 37}{space 1}    0.38{col 46}{space 3}0.702{col 54}{space 4}-124.9302{col 67}{space 3} 184.4815
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-37.83102{col 26}{space 2} 83.61558{col 37}{space 1}   -0.45{col 46}{space 3}0.652{col 54}{space 4}-204.5525{col 67}{space 3} 128.8905
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-9.691391{col 26}{space 2} 4.490337{col 37}{space 1}   -2.16{col 46}{space 3}0.034{col 54}{space 4} -18.6447{col 67}{space 3}-.7380861
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-192.8933{col 26}{space 2} 76.96299{col 37}{space 1}   -2.51{col 46}{space 3}0.014{col 54}{space 4}-346.3502{col 67}{space 3}-39.43638
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0111758{col 26}{space 2} .0586162{col 37}{space 1}    0.19{col 46}{space 3}0.849{col 54}{space 4}-.1056993{col 67}{space 3} .1280509
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} -.676547{col 26}{space 2}   5.6571{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-11.95627{col 67}{space 3} 10.60317
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0017589{col 26}{space 2} .0003318{col 37}{space 1}    5.30{col 46}{space 3}0.000{col 54}{space 4} .0010974{col 67}{space 3} .0024205
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1852.069{col 26}{space 2} 459.0036{col 37}{space 1}    4.03{col 46}{space 3}0.000{col 54}{space 4} 936.8594{col 67}{space 3} 2767.279
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        73
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     71.08
{txt}{col 49}        avg{col 67}= {res}     71.08
{txt}{col 49}        max{col 67}= {res}     71.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   71.1{txt}){col 67}= {res}      9.45
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 4.736612{col 26}{space 2} 73.83699{col 37}{space 1}    0.06{col 46}{space 3}0.949{col 54}{space 4}-142.4873{col 67}{space 3} 151.9606
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-47.99283{col 26}{space 2} 79.57176{col 37}{space 1}   -0.60{col 46}{space 3}0.548{col 54}{space 4}-206.6514{col 67}{space 3} 110.6657
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-7.425862{col 26}{space 2} 4.273174{col 37}{space 1}   -1.74{col 46}{space 3}0.087{col 54}{space 4}-15.94617{col 67}{space 3} 1.094441
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-171.0353{col 26}{space 2}  73.2409{col 37}{space 1}   -2.34{col 46}{space 3}0.022{col 54}{space 4}-317.0706{col 67}{space 3}-24.99987
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0288766{col 26}{space 2} .0557814{col 37}{space 1}    0.52{col 46}{space 3}0.606{col 54}{space 4}-.0823461{col 67}{space 3} .1400994
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  -4.0246{col 26}{space 2}  5.38351{col 37}{space 1}   -0.75{col 46}{space 3}0.457{col 54}{space 4}-14.75881{col 67}{space 3} 6.709607
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0018576{col 26}{space 2} .0003158{col 37}{space 1}    5.88{col 46}{space 3}0.000{col 54}{space 4} .0012281{col 67}{space 3} .0024872
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1982.824{col 26}{space 2} 436.8052{col 37}{space 1}    4.54{col 46}{space 3}0.000{col 54}{space 4} 1111.876{col 67}{space 3} 2853.772
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        80
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        72
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     70.08
{txt}{col 49}        avg{col 67}= {res}     70.08
{txt}{col 49}        max{col 67}= {res}     70.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   70.1{txt}){col 67}= {res}      2.61
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0186

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.029584{col 26}{space 2} .8163415{col 37}{space 1}    2.49{col 46}{space 3}0.015{col 54}{space 4} .4014749{col 67}{space 3} 3.657693
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .7346978{col 26}{space 2} .8893779{col 37}{space 1}    0.83{col 46}{space 3}0.412{col 54}{space 4}-1.039075{col 67}{space 3}  2.50847
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0013106{col 26}{space 2} .0475362{col 37}{space 1}    0.03{col 46}{space 3}0.978{col 54}{space 4}-.0934955{col 67}{space 3} .0961167
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.4206953{col 26}{space 2} .8098989{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-2.035955{col 67}{space 3} 1.194565
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -.000535{col 26}{space 2} .0006181{col 37}{space 1}   -0.87{col 46}{space 3}0.390{col 54}{space 4}-.0017677{col 67}{space 3} .0006977
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0741984{col 26}{space 2} .0595517{col 37}{space 1}    1.25{col 46}{space 3}0.217{col 54}{space 4}-.0445715{col 67}{space 3} .1929682
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.86e-06{col 26}{space 2} 3.51e-06{col 37}{space 1}    1.10{col 46}{space 3}0.275{col 54}{space 4}-3.14e-06{col 67}{space 3} .0000108
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.332765{col 26}{space 2} 4.836852{col 37}{space 1}   -0.90{col 46}{space 3}0.373{col 54}{space 4}-13.97937{col 67}{space 3} 5.313839
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. *********************WHITES******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       119
{txt}{hline 13}{c +}{hline 34}   F(6, 112)       = {res}    12.17
{txt}       Model {c |} {res}  6902827.3         6  1150471.22   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 10591877.9       112  94570.3382   {txt}R-squared       ={res}    0.3946
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3621
{txt}       Total {c |} {res} 17494705.2       118  148260.213   {txt}Root MSE        =   {res} 307.52

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-59.07982{col 26}{space 2} 68.18194{col 37}{space 1}   -0.87{col 46}{space 3}0.388{col 67}{space 3}-.0770314
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-62.96597{col 26}{space 2} 79.60628{col 37}{space 1}   -0.79{col 46}{space 3}0.431{col 67}{space 3}-.0816186
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -1.96424{col 26}{space 2} 3.917467{col 37}{space 1}   -0.50{col 46}{space 3}0.617{col 67}{space 3}-.0440427
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} -20.8187{col 26}{space 2} 66.75394{col 37}{space 1}   -0.31{col 46}{space 3}0.756{col 67}{space 3}-.0243071
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0157425{col 26}{space 2} .0453558{col 37}{space 1}    0.35{col 46}{space 3}0.729{col 67}{space 3} .0269641
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0018357{col 26}{space 2} .0002854{col 37}{space 1}    6.43{col 46}{space 3}0.000{col 67}{space 3} .6797785
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1405.827{col 26}{space 2} 406.0669{col 37}{space 1}    3.46{col 46}{space 3}0.001{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       119
{txt}{hline 13}{c +}{hline 34}   F(6, 112)       = {res}    16.01
{txt}       Model {c |} {res} 9536986.28         6  1589497.71   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 11119319.2       112  99279.6361   {txt}R-squared       ={res}    0.4617
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4329
{txt}       Total {c |} {res} 20656305.5       118  175053.437   {txt}Root MSE        =   {res} 315.09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-65.49318{col 26}{space 2} 69.85893{col 37}{space 1}   -0.94{col 46}{space 3}0.351{col 67}{space 3}-.0785871
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-187.5818{col 26}{space 2} 81.56427{col 37}{space 1}   -2.30{col 46}{space 3}0.023{col 67}{space 3}-.2237694
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.029926{col 26}{space 2} 4.013821{col 37}{space 1}    0.26{col 46}{space 3}0.798{col 67}{space 3} .0212526
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 9.560409{col 26}{space 2} 68.39582{col 37}{space 1}    0.14{col 46}{space 3}0.889{col 67}{space 3} .0102727
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0473511{col 26}{space 2} .0464714{col 37}{space 1}    1.02{col 46}{space 3}0.310{col 67}{space 3} .0746397
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0024447{col 26}{space 2} .0002924{col 37}{space 1}    8.36{col 46}{space 3}0.000{col 67}{space 3} .8331367
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 828.5139{col 26}{space 2} 416.0545{col 37}{space 1}    1.99{col 46}{space 3}0.049{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if Race==1,beta 
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       117
{txt}{hline 13}{c +}{hline 34}   F(6, 110)       = {res}     2.17
{txt}       Model {c |} {res} 202.245862         6  33.7076436   {txt}Prob > F        ={res}    0.0512
{txt}    Residual {c |} {res}  1708.5517       110  15.5322882   {txt}R-squared       ={res}    0.1058
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0571
{txt}       Total {c |} {res} 1910.79756       116  16.4723928   {txt}Root MSE        =   {res} 3.9411

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.527642{col 26}{space 2} .9190924{col 37}{space 1}    2.75{col 46}{space 3}0.007{col 67}{space 3} .3056554
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0927673{col 26}{space 2} 1.023201{col 37}{space 1}    0.09{col 46}{space 3}0.928{col 67}{space 3} .0114065
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0183607{col 26}{space 2} .0521139{col 37}{space 1}   -0.35{col 46}{space 3}0.725{col 67}{space 3}-.0386617
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 1.819022{col 26}{space 2} .8677077{col 37}{space 1}    2.10{col 46}{space 3}0.038{col 67}{space 3} .2006421
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0005381{col 26}{space 2} .0005819{col 37}{space 1}   -0.92{col 46}{space 3}0.357{col 67}{space 3}-.0881706
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.51e-06{col 26}{space 2} 3.66e-06{col 37}{space 1}    0.41{col 46}{space 3}0.680{col 67}{space 3}  .053285
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.390287{col 26}{space 2} 5.226424{col 37}{space 1}   -0.46{col 46}{space 3}0.648{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       111
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    109.05
{txt}{col 49}        avg{col 67}= {res}    109.05
{txt}{col 49}        max{col 67}= {res}    109.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}  109.1{txt}){col 67}= {res}     10.39
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-55.55587{col 26}{space 2} 68.77571{col 37}{space 1}   -0.81{col 46}{space 3}0.421{col 54}{space 4}-191.8664{col 67}{space 3} 80.75461
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-57.96438{col 26}{space 2} 80.50176{col 37}{space 1}   -0.72{col 46}{space 3}0.473{col 54}{space 4}-217.5154{col 67}{space 3} 101.5866
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.939798{col 26}{space 2} 3.930978{col 37}{space 1}   -0.49{col 46}{space 3}0.623{col 54}{space 4}-9.730827{col 67}{space 3}  5.85123
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-20.22466{col 26}{space 2} 66.98955{col 37}{space 1}   -0.30{col 46}{space 3}0.763{col 54}{space 4}-152.9951{col 67}{space 3} 112.5457
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0185569{col 26}{space 2} .0458573{col 37}{space 1}    0.40{col 46}{space 3}0.687{col 54}{space 4}-.0723303{col 67}{space 3} .1094441
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 2.093469{col 26}{space 2} 4.197687{col 37}{space 1}    0.50{col 46}{space 3}0.619{col 54}{space 4}-6.226165{col 67}{space 3}  10.4131
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}  .001834{col 26}{space 2} .0002864{col 37}{space 1}    6.40{col 46}{space 3}0.000{col 54}{space 4} .0012665{col 67}{space 3} .0024016
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1324.514{col 26}{space 2} 438.8472{col 37}{space 1}    3.02{col 46}{space 3}0.003{col 54}{space 4} 454.7378{col 67}{space 3}  2194.29
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       111
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    109.05
{txt}{col 49}        avg{col 67}= {res}    109.05
{txt}{col 49}        max{col 67}= {res}    109.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}  109.1{txt}){col 67}= {res}     14.10
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-55.63566{col 26}{space 2} 69.95595{col 37}{space 1}   -0.80{col 46}{space 3}0.428{col 54}{space 4}-194.2853{col 67}{space 3}   83.014
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-173.5909{col 26}{space 2} 81.88322{col 37}{space 1}   -2.12{col 46}{space 3}0.036{col 54}{space 4}-335.8799{col 67}{space 3}-11.30187
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.098294{col 26}{space 2} 3.998436{col 37}{space 1}    0.27{col 46}{space 3}0.784{col 54}{space 4}-6.826433{col 67}{space 3} 9.023022
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}  11.2221{col 26}{space 2} 68.13913{col 37}{space 1}    0.16{col 46}{space 3}0.869{col 54}{space 4}-123.8267{col 67}{space 3} 146.2709
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0552238{col 26}{space 2} .0466442{col 37}{space 1}    1.18{col 46}{space 3}0.239{col 54}{space 4} -.037223{col 67}{space 3} .1476707
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 5.856052{col 26}{space 2} 4.269722{col 37}{space 1}    1.37{col 46}{space 3}0.173{col 54}{space 4}-2.606353{col 67}{space 3} 14.31846
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}   .00244{col 26}{space 2} .0002913{col 37}{space 1}    8.38{col 46}{space 3}0.000{col 54}{space 4} .0018627{col 67}{space 3} .0030173
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 601.0583{col 26}{space 2} 446.3781{col 37}{space 1}    1.35{col 46}{space 3}0.181{col 54}{space 4}-283.6438{col 67}{space 3}  1485.76
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       117
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       109
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    107.05
{txt}{col 49}        avg{col 67}= {res}    107.05
{txt}{col 49}        max{col 67}= {res}    107.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}  107.1{txt}){col 67}= {res}      1.90
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0762

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.565906{col 26}{space 2} .9239194{col 37}{space 1}    2.78{col 46}{space 3}0.006{col 54}{space 4} .7343544{col 67}{space 3} 4.397458
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .1725733{col 26}{space 2} 1.034605{col 37}{space 1}    0.17{col 46}{space 3}0.868{col 54}{space 4}-1.878399{col 67}{space 3} 2.223545
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0177909{col 26}{space 2} .0522732{col 37}{space 1}   -0.34{col 46}{space 3}0.734{col 54}{space 4}-.1214159{col 67}{space 3} .0858341
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.818314{col 26}{space 2} .8702196{col 37}{space 1}    2.09{col 46}{space 3}0.039{col 54}{space 4} .0932147{col 67}{space 3} 3.543413
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0004919{col 26}{space 2} .0005885{col 37}{space 1}   -0.84{col 46}{space 3}0.405{col 54}{space 4}-.0016586{col 67}{space 3} .0006747
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0328277{col 26}{space 2} .0542574{col 37}{space 1}    0.61{col 46}{space 3}0.546{col 54}{space 4}-.0747307{col 67}{space 3} .1403862
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.49e-06{col 26}{space 2} 3.67e-06{col 37}{space 1}    0.41{col 46}{space 3}0.685{col 54}{space 4}-5.78e-06{col 67}{space 3} 8.77e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.642598{col 26}{space 2} 5.635419{col 37}{space 1}   -0.65{col 46}{space 3}0.519{col 54}{space 4} -14.8141{col 67}{space 3}   7.5289
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //INTERACTION BY Race//
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       190
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    188.03
{txt}{col 49}        avg{col 67}= {res}    188.03
{txt}{col 49}        max{col 67}= {res}    188.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  188.0{txt}){col 67}= {res}     16.78
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-39.66908{col 28}{space 2} 60.68152{col 39}{space 1}   -0.65{col 48}{space 3}0.514{col 56}{space 4}-159.3731{col 69}{space 3} 80.03496
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-150.8539{col 28}{space 2} 169.7475{col 39}{space 1}   -0.89{col 48}{space 3}0.375{col 56}{space 4}-485.7081{col 69}{space 3} 184.0003
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 40.61499{col 28}{space 2} 83.52545{col 39}{space 1}    0.49{col 48}{space 3}0.627{col 56}{space 4}-124.1524{col 69}{space 3} 205.3823
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-40.50441{col 28}{space 2} 57.99876{col 39}{space 1}   -0.70{col 48}{space 3}0.486{col 56}{space 4}-154.9163{col 69}{space 3} 73.90746
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-4.661518{col 28}{space 2} 2.793602{col 39}{space 1}   -1.67{col 48}{space 3}0.097{col 56}{space 4}-10.17235{col 69}{space 3}   .84931
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-82.02332{col 28}{space 2}    48.65{col 39}{space 1}   -1.69{col 48}{space 3}0.093{col 56}{space 4}-177.9933{col 69}{space 3} 13.94662
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0041923{col 28}{space 2} .0353062{col 39}{space 1}    0.12{col 48}{space 3}0.906{col 56}{space 4}-.0654549{col 69}{space 3} .0738395
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0680504{col 28}{space 2} 3.271155{col 39}{space 1}    0.02{col 48}{space 3}0.983{col 56}{space 4}-6.384827{col 69}{space 3} 6.520928
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0017375{col 28}{space 2} .0002138{col 39}{space 1}    8.13{col 48}{space 3}0.000{col 56}{space 4} .0013158{col 69}{space 3} .0021593
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1696.152{col 28}{space 2} 320.1168{col 39}{space 1}    5.30{col 48}{space 3}0.000{col 56}{space 4}  1064.67{col 69}{space 3} 2327.633
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       190
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    188.03
{txt}{col 49}        avg{col 67}= {res}    188.03
{txt}{col 49}        max{col 67}= {res}    188.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  188.0{txt}){col 67}= {res}     20.56
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-31.92025{col 28}{space 2} 61.34116{col 39}{space 1}   -0.52{col 48}{space 3}0.603{col 56}{space 4}-152.9255{col 69}{space 3} 89.08504
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-154.3192{col 28}{space 2} 171.5927{col 39}{space 1}   -0.90{col 48}{space 3}0.370{col 56}{space 4}-492.8135{col 69}{space 3}  184.175
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 39.03686{col 28}{space 2} 84.43341{col 39}{space 1}    0.46{col 48}{space 3}0.644{col 56}{space 4}-127.5216{col 69}{space 3} 205.5953
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-107.7588{col 28}{space 2} 58.62924{col 39}{space 1}   -1.84{col 48}{space 3}0.068{col 56}{space 4}-223.4144{col 69}{space 3} 7.896778
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2.791662{col 28}{space 2}  2.82397{col 39}{space 1}   -0.99{col 48}{space 3}0.324{col 56}{space 4}-8.362397{col 69}{space 3} 2.779072
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -62.1678{col 28}{space 2} 49.17885{col 39}{space 1}   -1.26{col 48}{space 3}0.208{col 56}{space 4} -159.181{col 69}{space 3} 34.84538
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0318593{col 28}{space 2}   .03569{col 39}{space 1}    0.89{col 48}{space 3}0.373{col 56}{space 4} -.038545{col 69}{space 3} .1022637
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1.227189{col 28}{space 2} 3.306714{col 39}{space 1}    0.37{col 48}{space 3}0.711{col 56}{space 4}-5.295835{col 69}{space 3} 7.750214
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021268{col 28}{space 2} .0002161{col 39}{space 1}    9.84{col 48}{space 3}0.000{col 56}{space 4} .0017005{col 69}{space 3} .0025531
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1349.452{col 28}{space 2} 323.5966{col 39}{space 1}    4.17{col 48}{space 3}0.000{col 56}{space 4} 711.1056{col 69}{space 3} 1987.798
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       197
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       187
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    185.03
{txt}{col 49}        avg{col 67}= {res}    185.03
{txt}{col 49}        max{col 67}= {res}    185.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  185.0{txt}){col 67}= {res}      2.57
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0084

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 2.165116{col 28}{space 2} .7626427{col 39}{space 1}    2.84{col 48}{space 3}0.005{col 56}{space 4} .6605224{col 69}{space 3} 3.669709
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.405384{col 28}{space 2} 2.080321{col 39}{space 1}    0.68{col 48}{space 3}0.500{col 56}{space 4}-2.698815{col 69}{space 3} 5.509582
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.1426499{col 28}{space 2} 1.028162{col 39}{space 1}   -0.14{col 48}{space 3}0.890{col 56}{space 4}-2.171077{col 69}{space 3} 1.885778
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .5287551{col 28}{space 2} .7069273{col 39}{space 1}    0.75{col 48}{space 3}0.455{col 56}{space 4}-.8659189{col 69}{space 3} 1.923429
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0081189{col 28}{space 2} .0347285{col 39}{space 1}    0.23{col 48}{space 3}0.815{col 56}{space 4}-.0603959{col 69}{space 3} .0766337
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .8443423{col 28}{space 2}  .596086{col 39}{space 1}    1.42{col 48}{space 3}0.158{col 56}{space 4}-.3316565{col 69}{space 3} 2.020341
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0005157{col 28}{space 2} .0004283{col 39}{space 1}   -1.20{col 48}{space 3}0.230{col 56}{space 4}-.0013607{col 69}{space 3} .0003293
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0468205{col 28}{space 2} .0398771{col 39}{space 1}    1.17{col 48}{space 3}0.242{col 56}{space 4}-.0318518{col 69}{space 3} .1254928
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 1.74e-06{col 28}{space 2} 2.60e-06{col 39}{space 1}    0.67{col 48}{space 3}0.504{col 56}{space 4}-3.38e-06{col 69}{space 3} 6.86e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-4.035512{col 28}{space 2} 3.883357{col 39}{space 1}   -1.04{col 48}{space 3}0.300{col 56}{space 4}-11.69686{col 69}{space 3} 3.625837
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. *********************LnNFLw1, MODELS 3-6***************************
. 
. ***********MODEL 3: MODEL 2+w1dxDiabetes w1Glucose******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0069
{txt}{col 49}Largest FMI{col 67}= {res}    0.0624
{txt}{col 49}Complete DF{col 67}= {res}        71
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     61.59
{txt}{col 49}        avg{col 67}= {res}     68.01
{txt}{col 49}        max{col 67}= {res}     69.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   69.0{txt}){col 67}= {res}      7.09
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 16.30067{col 26}{space 2} 79.96206{col 37}{space 1}    0.20{col 46}{space 3}0.839{col 54}{space 4}-143.2222{col 67}{space 3} 175.8236
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-45.22829{col 26}{space 2} 82.96368{col 37}{space 1}   -0.55{col 46}{space 3}0.587{col 54}{space 4}-210.7459{col 67}{space 3} 120.2893
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-8.514048{col 26}{space 2} 4.631177{col 37}{space 1}   -1.84{col 46}{space 3}0.070{col 54}{space 4}-17.75323{col 67}{space 3} .7251353
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-194.0311{col 26}{space 2} 75.79359{col 37}{space 1}   -2.56{col 46}{space 3}0.013{col 54}{space 4}-345.2324{col 67}{space 3}-42.82974
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0038899{col 26}{space 2}  .058296{col 37}{space 1}    0.07{col 46}{space 3}0.947{col 54}{space 4}-.1124078{col 67}{space 3} .1201877
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-2.016779{col 26}{space 2} 5.613319{col 37}{space 1}   -0.36{col 46}{space 3}0.720{col 54}{space 4}-13.21498{col 67}{space 3}  9.18142
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-60.49845{col 26}{space 2} 63.64213{col 37}{space 1}   -0.95{col 46}{space 3}0.346{col 54}{space 4}-187.7341{col 67}{space 3} 66.73716
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 3.720928{col 26}{space 2} 1.835946{col 37}{space 1}    2.03{col 46}{space 3}0.047{col 54}{space 4} .0565498{col 67}{space 3} 7.385307
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0016533{col 26}{space 2} .0003342{col 37}{space 1}    4.95{col 46}{space 3}0.000{col 54}{space 4} .0009865{col 67}{space 3} .0023202
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1691.386{col 26}{space 2} 459.8057{col 37}{space 1}    3.68{col 46}{space 3}0.000{col 54}{space 4} 774.1123{col 67}{space 3}  2608.66
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0008
{txt}{col 49}Largest FMI{col 67}= {res}    0.0043
{txt}{col 49}Complete DF{col 67}= {res}        71
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     68.82
{txt}{col 49}        avg{col 67}= {res}     68.99
{txt}{col 49}        max{col 67}= {res}     69.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   69.1{txt}){col 67}= {res}      9.48
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 1.372797{col 26}{space 2} 72.89382{col 37}{space 1}    0.02{col 46}{space 3}0.985{col 54}{space 4}-144.0463{col 67}{space 3} 146.7919
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-64.79417{col 26}{space 2} 75.57622{col 37}{space 1}   -0.86{col 46}{space 3}0.394{col 54}{space 4}-215.5658{col 67}{space 3} 85.97749
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.621004{col 26}{space 2}  4.22141{col 37}{space 1}   -1.57{col 46}{space 3}0.121{col 54}{space 4}-15.04252{col 67}{space 3} 1.800508
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-174.0174{col 26}{space 2} 69.13442{col 37}{space 1}   -2.52{col 46}{space 3}0.014{col 54}{space 4}-311.9345{col 67}{space 3}-36.10031
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0238296{col 26}{space 2} .0531443{col 37}{space 1}    0.45{col 46}{space 3}0.655{col 54}{space 4}-.0821888{col 67}{space 3}  .129848
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-5.904334{col 26}{space 2} 5.120753{col 37}{space 1}   -1.15{col 46}{space 3}0.253{col 54}{space 4}-16.11996{col 67}{space 3} 4.311292
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-46.11816{col 26}{space 2} 56.41125{col 37}{space 1}   -0.82{col 46}{space 3}0.416{col 54}{space 4}-158.6606{col 67}{space 3} 66.42431
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 5.071438{col 26}{space 2} 1.658087{col 37}{space 1}    3.06{col 46}{space 3}0.003{col 54}{space 4} 1.763648{col 67}{space 3} 8.379227
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0017402{col 26}{space 2} .0003041{col 37}{space 1}    5.72{col 46}{space 3}0.000{col 54}{space 4} .0011337{col 67}{space 3} .0023468
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1729.041{col 26}{space 2}  419.365{col 37}{space 1}    4.12{col 46}{space 3}0.000{col 54}{space 4}  892.445{col 67}{space 3} 2565.637
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        80
{txt}{col 49}Average RVI{col 67}= {res}    0.0016
{txt}{col 49}Largest FMI{col 67}= {res}    0.0171
{txt}{col 49}Complete DF{col 67}= {res}        70
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     66.72
{txt}{col 49}        avg{col 67}= {res}     67.88
{txt}{col 49}        max{col 67}= {res}     68.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   68.1{txt}){col 67}= {res}      2.00
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0520

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 1.995662{col 26}{space 2} .8653616{col 37}{space 1}    2.31{col 46}{space 3}0.024{col 54}{space 4} .2688578{col 67}{space 3} 3.722467
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .7709582{col 26}{space 2} .9049816{col 37}{space 1}    0.85{col 46}{space 3}0.397{col 54}{space 4}-1.034868{col 67}{space 3} 2.576784
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}  .002446{col 26}{space 2} .0504966{col 37}{space 1}    0.05{col 46}{space 3}0.962{col 54}{space 4}-.0983186{col 67}{space 3} .1032106
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.4140335{col 26}{space 2} .8205288{col 37}{space 1}   -0.50{col 46}{space 3}0.615{col 54}{space 4}-2.051338{col 67}{space 3}  1.22327
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0005425{col 26}{space 2} .0006325{col 37}{space 1}   -0.86{col 46}{space 3}0.394{col 54}{space 4}-.0018047{col 67}{space 3} .0007197
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0767438{col 26}{space 2} .0607725{col 37}{space 1}    1.26{col 46}{space 3}0.211{col 54}{space 4}-.0445233{col 67}{space 3} .1980109
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-.0331254{col 26}{space 2} .6749749{col 37}{space 1}   -0.05{col 46}{space 3}0.961{col 54}{space 4}-1.380484{col 67}{space 3} 1.314233
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-.0066426{col 26}{space 2}  .019724{col 37}{space 1}   -0.34{col 46}{space 3}0.737{col 54}{space 4}-.0460048{col 67}{space 3} .0327196
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.95e-06{col 26}{space 2} 3.62e-06{col 37}{space 1}    1.09{col 46}{space 3}0.279{col 54}{space 4}-3.27e-06{col 67}{space 3} .0000112
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.917095{col 26}{space 2} 4.981802{col 37}{space 1}   -0.79{col 46}{space 3}0.434{col 54}{space 4}-13.85791{col 67}{space 3} 6.023719
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //Whites//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0002
{txt}{col 49}Largest FMI{col 67}= {res}    0.0013
{txt}{col 49}Complete DF{col 67}= {res}       109
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    106.95
{txt}{col 49}        avg{col 67}= {res}    107.03
{txt}{col 49}        max{col 67}= {res}    107.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  107.1{txt}){col 67}= {res}      8.15
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-69.75754{col 26}{space 2} 74.40006{col 37}{space 1}   -0.94{col 46}{space 3}0.351{col 54}{space 4}-217.2477{col 67}{space 3} 77.73266
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} -69.4338{col 26}{space 2} 81.99348{col 37}{space 1}   -0.85{col 46}{space 3}0.399{col 54}{space 4}-231.9755{col 67}{space 3}  93.1079
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2.549905{col 26}{space 2} 4.010856{col 37}{space 1}   -0.64{col 46}{space 3}0.526{col 54}{space 4}-10.50097{col 67}{space 3} 5.401156
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-31.93015{col 26}{space 2} 68.09438{col 37}{space 1}   -0.47{col 46}{space 3}0.640{col 54}{space 4}-166.9186{col 67}{space 3} 103.0582
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0298941{col 26}{space 2} .0472003{col 37}{space 1}    0.63{col 46}{space 3}0.528{col 54}{space 4}-.0636745{col 67}{space 3} .1234627
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .5581775{col 26}{space 2}  4.52286{col 37}{space 1}    0.12{col 46}{space 3}0.902{col 54}{space 4}-8.407814{col 67}{space 3} 9.524169
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 61.89274{col 26}{space 2} 64.54064{col 37}{space 1}    0.96{col 46}{space 3}0.340{col 54}{space 4} -66.0509{col 67}{space 3} 189.8364
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-.3297791{col 26}{space 2} 1.419335{col 37}{space 1}   -0.23{col 46}{space 3}0.817{col 54}{space 4} -3.14343{col 67}{space 3} 2.483872
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0018186{col 26}{space 2} .0002889{col 37}{space 1}    6.29{col 46}{space 3}0.000{col 54}{space 4} .0012459{col 67}{space 3} .0023913
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1468.699{col 26}{space 2} 470.0835{col 37}{space 1}    3.12{col 46}{space 3}0.002{col 54}{space 4} 536.8187{col 67}{space 3}  2400.58
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0010
{txt}{col 49}Largest FMI{col 67}= {res}    0.0084
{txt}{col 49}Complete DF{col 67}= {res}       109
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    106.02
{txt}{col 49}        avg{col 67}= {res}    106.90
{txt}{col 49}        max{col 67}= {res}    107.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  107.0{txt}){col 67}= {res}     10.93
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-70.45606{col 26}{space 2} 75.79415{col 37}{space 1}   -0.93{col 46}{space 3}0.355{col 54}{space 4}-220.7095{col 67}{space 3} 79.79736
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-184.2771{col 26}{space 2} 83.54261{col 37}{space 1}   -2.21{col 46}{space 3}0.030{col 54}{space 4}-349.8899{col 67}{space 3} -18.6643
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .6433441{col 26}{space 2} 4.085416{col 37}{space 1}    0.16{col 46}{space 3}0.875{col 54}{space 4}-7.455473{col 67}{space 3} 8.742162
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.330888{col 26}{space 2} 69.38234{col 37}{space 1}    0.02{col 46}{space 3}0.985{col 54}{space 4}-136.2109{col 67}{space 3} 138.8727
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0648527{col 26}{space 2} .0480998{col 37}{space 1}    1.35{col 46}{space 3}0.180{col 54}{space 4}-.0304995{col 67}{space 3} .1602049
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 4.473237{col 26}{space 2} 4.608747{col 37}{space 1}    0.97{col 46}{space 3}0.334{col 54}{space 4}-4.663042{col 67}{space 3} 13.60952
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 48.28919{col 26}{space 2} 66.01909{col 37}{space 1}    0.73{col 46}{space 3}0.466{col 54}{space 4}-82.59974{col 67}{space 3} 179.1781
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-.1157011{col 26}{space 2} 1.447829{col 37}{space 1}   -0.08{col 46}{space 3}0.936{col 54}{space 4}-2.985921{col 67}{space 3} 2.754519
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0024301{col 26}{space 2} .0002944{col 37}{space 1}    8.26{col 46}{space 3}0.000{col 54}{space 4} .0018466{col 67}{space 3} .0030136
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 710.4162{col 26}{space 2}    479.1{col 37}{space 1}    1.48{col 46}{space 3}0.141{col 54}{space 4}-239.3455{col 67}{space 3} 1660.178
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       117
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       107
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    105.05
{txt}{col 49}        avg{col 67}= {res}    105.05
{txt}{col 49}        max{col 67}= {res}    105.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  105.1{txt}){col 67}= {res}      1.58
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1315

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.931634{col 26}{space 2} 1.011654{col 37}{space 1}    2.90{col 46}{space 3}0.005{col 54}{space 4} .9257231{col 67}{space 3} 4.937546
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .3608959{col 26}{space 2} 1.056203{col 37}{space 1}    0.34{col 46}{space 3}0.733{col 54}{space 4}-1.733347{col 67}{space 3} 2.455138
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0177677{col 26}{space 2} .0534518{col 37}{space 1}   -0.33{col 46}{space 3}0.740{col 54}{space 4} -.123752{col 67}{space 3} .0882167
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.925842{col 26}{space 2} .8832543{col 37}{space 1}    2.18{col 46}{space 3}0.031{col 54}{space 4}  .174522{col 67}{space 3} 3.677161
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0006053{col 26}{space 2} .0006062{col 37}{space 1}   -1.00{col 46}{space 3}0.320{col 54}{space 4}-.0018072{col 67}{space 3} .0005967
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0535274{col 26}{space 2} .0584787{col 37}{space 1}    0.92{col 46}{space 3}0.362{col 54}{space 4}-.0624242{col 67}{space 3} .1694791
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-.2934559{col 26}{space 2} .8375572{col 37}{space 1}   -0.35{col 46}{space 3}0.727{col 54}{space 4}-1.954167{col 67}{space 3} 1.367255
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} -.008859{col 26}{space 2} .0185235{col 37}{space 1}   -0.48{col 46}{space 3}0.633{col 54}{space 4}-.0455874{col 67}{space 3} .0278694
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.40e-06{col 26}{space 2} 3.71e-06{col 37}{space 1}    0.38{col 46}{space 3}0.707{col 54}{space 4}-5.95e-06{col 67}{space 3} 8.75e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.059334{col 26}{space 2} 6.052056{col 37}{space 1}   -0.67{col 46}{space 3}0.504{col 54}{space 4}-16.05937{col 67}{space 3} 7.940701
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //INTERACTION by Race//
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0031
{txt}{col 49}Largest FMI{col 67}= {res}    0.0335
{txt}{col 49}Complete DF{col 67}= {res}       188
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    171.79
{txt}{col 49}        avg{col 67}= {res}    184.44
{txt}{col 49}        max{col 67}= {res}    186.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  186.0{txt}){col 67}= {res}     13.88
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-68.60745{col 28}{space 2} 64.16251{col 39}{space 1}   -1.07{col 48}{space 3}0.286{col 56}{space 4}-195.1872{col 69}{space 3} 57.97226
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-210.3717{col 28}{space 2} 174.7946{col 39}{space 1}   -1.20{col 48}{space 3}0.230{col 56}{space 4}-555.2071{col 69}{space 3} 134.4636
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 72.84339{col 28}{space 2} 86.44778{col 39}{space 1}    0.84{col 48}{space 3}0.401{col 56}{space 4}-97.70103{col 69}{space 3} 243.3878
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} -53.4182{col 28}{space 2} 58.70793{col 39}{space 1}   -0.91{col 48}{space 3}0.364{col 56}{space 4}-169.2372{col 69}{space 3} 62.40077
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-4.732657{col 28}{space 2} 2.862644{col 39}{space 1}   -1.65{col 48}{space 3}0.100{col 56}{space 4}-10.38013{col 69}{space 3} .9148213
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-87.28042{col 28}{space 2} 48.79353{col 39}{space 1}   -1.79{col 48}{space 3}0.075{col 56}{space 4}-183.5402{col 69}{space 3}   8.9794
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0104429{col 28}{space 2} .0358797{col 39}{space 1}    0.29{col 48}{space 3}0.771{col 56}{space 4}-.0603409{col 69}{space 3} .0812266
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}-1.262515{col 28}{space 2} 3.399058{col 39}{space 1}   -0.37{col 48}{space 3}0.711{col 56}{space 4}-7.968179{col 69}{space 3} 5.443149
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} 11.79626{col 28}{space 2} 44.83446{col 39}{space 1}    0.26{col 48}{space 3}0.793{col 56}{space 4} -76.7011{col 69}{space 3} 100.2936
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 1.033388{col 28}{space 2} 1.097566{col 39}{space 1}    0.94{col 48}{space 3}0.348{col 56}{space 4}-1.132182{col 69}{space 3} 3.198958
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0017454{col 28}{space 2} .0002138{col 39}{space 1}    8.16{col 48}{space 3}0.000{col 56}{space 4} .0013236{col 69}{space 3} .0021672
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1691.754{col 28}{space 2} 329.6329{col 39}{space 1}    5.13{col 48}{space 3}0.000{col 56}{space 4} 1041.446{col 69}{space 3} 2342.061
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0005
{txt}{col 49}Largest FMI{col 67}= {res}    0.0049
{txt}{col 49}Complete DF{col 67}= {res}       188
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    184.97
{txt}{col 49}        avg{col 67}= {res}    185.89
{txt}{col 49}        max{col 67}= {res}    186.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  186.0{txt}){col 67}= {res}     17.43
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-72.89682{col 28}{space 2} 64.46954{col 39}{space 1}   -1.13{col 48}{space 3}0.260{col 56}{space 4}-200.0822{col 69}{space 3} 54.28861
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} -241.941{col 28}{space 2} 175.6117{col 39}{space 1}   -1.38{col 48}{space 3}0.170{col 56}{space 4}-588.3879{col 69}{space 3} 104.5059
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 86.22406{col 28}{space 2} 86.85408{col 39}{space 1}    0.99{col 48}{space 3}0.322{col 56}{space 4}-85.12171{col 69}{space 3} 257.5698
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-126.9382{col 28}{space 2} 58.98743{col 39}{space 1}   -2.15{col 48}{space 3}0.033{col 56}{space 4}-243.3085{col 69}{space 3}-10.56786
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2.990739{col 28}{space 2} 2.874419{col 39}{space 1}   -1.04{col 48}{space 3}0.299{col 56}{space 4}-8.661393{col 69}{space 3} 2.679916
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-70.01825{col 28}{space 2} 49.02586{col 39}{space 1}   -1.43{col 48}{space 3}0.155{col 56}{space 4}-166.7364{col 69}{space 3} 26.69989
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0416696{col 28}{space 2} .0360399{col 39}{space 1}    1.16{col 48}{space 3}0.249{col 56}{space 4}-.0294299{col 69}{space 3} .1127691
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}-.7293698{col 28}{space 2}  3.41499{col 39}{space 1}   -0.21{col 48}{space 3}0.831{col 56}{space 4}-7.466455{col 69}{space 3} 6.007716
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} 23.80691{col 28}{space 2} 44.41398{col 39}{space 1}    0.54{col 48}{space 3}0.593{col 56}{space 4}-63.81618{col 69}{space 3}   111.43
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 1.373357{col 28}{space 2} 1.096657{col 39}{space 1}    1.25{col 48}{space 3}0.212{col 56}{space 4}-.7901517{col 69}{space 3} 3.536867
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021392{col 28}{space 2} .0002149{col 39}{space 1}    9.96{col 48}{space 3}0.000{col 56}{space 4} .0017153{col 69}{space 3}  .002563
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1354.719{col 28}{space 2} 330.9622{col 39}{space 1}    4.09{col 48}{space 3}0.000{col 56}{space 4} 701.7955{col 69}{space 3} 2007.642
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       197
{txt}{col 49}Average RVI{col 67}= {res}    0.0002
{txt}{col 49}Largest FMI{col 67}= {res}    0.0020
{txt}{col 49}Complete DF{col 67}= {res}       185
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    182.67
{txt}{col 49}        avg{col 67}= {res}    182.99
{txt}{col 49}        max{col 67}= {res}    183.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  183.0{txt}){col 67}= {res}      2.20
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0163

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 2.433389{col 28}{space 2} .8152942{col 39}{space 1}    2.98{col 48}{space 3}0.003{col 56}{space 4} .8248056{col 69}{space 3} 4.041972
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.982591{col 28}{space 2} 2.151566{col 39}{space 1}    0.92{col 48}{space 3}0.358{col 56}{space 4}-2.262471{col 69}{space 3} 6.227652
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.4507097{col 28}{space 2} 1.069018{col 39}{space 1}   -0.42{col 48}{space 3}0.674{col 56}{space 4}-2.559892{col 69}{space 3} 1.658473
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}  .650437{col 28}{space 2} .7173772{col 39}{space 1}    0.91{col 48}{space 3}0.366{col 56}{space 4}-.7649558{col 69}{space 3}  2.06583
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0092936{col 28}{space 2} .0356859{col 39}{space 1}    0.26{col 48}{space 3}0.795{col 56}{space 4}-.0611151{col 69}{space 3} .0797023
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .8907394{col 28}{space 2} .5989802{col 39}{space 1}    1.49{col 48}{space 3}0.139{col 56}{space 4}-.2910543{col 69}{space 3} 2.072533
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0005817{col 28}{space 2} .0004362{col 39}{space 1}   -1.33{col 48}{space 3}0.184{col 56}{space 4}-.0014422{col 69}{space 3} .0002789
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0590665{col 28}{space 2} .0415249{col 39}{space 1}    1.42{col 48}{space 3}0.157{col 56}{space 4}-.0228626{col 69}{space 3} .1409956
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-.1877194{col 28}{space 2} .5400379{col 39}{space 1}   -0.35{col 48}{space 3}0.729{col 56}{space 4}-1.253233{col 69}{space 3} .8777947
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2}-.0077867{col 28}{space 2} .0134098{col 39}{space 1}   -0.58{col 48}{space 3}0.562{col 56}{space 4}-.0342445{col 69}{space 3} .0186712
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 1.66e-06{col 28}{space 2} 2.60e-06{col 39}{space 1}    0.64{col 48}{space 3}0.524{col 56}{space 4}-3.47e-06{col 69}{space 3} 6.80e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-4.145647{col 28}{space 2} 4.005548{col 39}{space 1}   -1.03{col 48}{space 3}0.302{col 56}{space 4}-12.04864{col 69}{space 3} 3.757343
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 4: MODEL 2+liver/kidney disease******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.1092
{txt}{col 49}Largest FMI{col 67}= {res}    0.5973
{txt}{col 49}Complete DF{col 67}= {res}        68
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      9.61
{txt}{col 49}        avg{col 67}= {res}     56.67
{txt}{col 49}        max{col 67}= {res}     65.52
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   64.1{txt}){col 67}= {res}      4.58
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 33.46147{col 26}{space 2} 84.41544{col 37}{space 1}    0.40{col 46}{space 3}0.693{col 54}{space 4} -135.542{col 67}{space 3} 202.4649
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-53.00788{col 26}{space 2} 115.4489{col 37}{space 1}   -0.46{col 46}{space 3}0.648{col 54}{space 4}-285.6792{col 67}{space 3} 179.6635
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-9.675144{col 26}{space 2} 5.231281{col 37}{space 1}   -1.85{col 46}{space 3}0.069{col 54}{space 4} -20.1217{col 67}{space 3} .7714158
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-182.8743{col 26}{space 2} 81.02508{col 37}{space 1}   -2.26{col 46}{space 3}0.027{col 54}{space 4}-344.7214{col 67}{space 3}-21.02725
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0046355{col 26}{space 2} .0639753{col 37}{space 1}    0.07{col 46}{space 3}0.942{col 54}{space 4}-.1233754{col 67}{space 3} .1326464
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-.1440811{col 26}{space 2} 6.300925{col 37}{space 1}   -0.02{col 46}{space 3}0.982{col 54}{space 4}-12.72601{col 67}{space 3} 12.43785
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 120.8135{col 26}{space 2} 233.3229{col 37}{space 1}    0.52{col 46}{space 3}0.616{col 54}{space 4}-401.9336{col 67}{space 3} 643.5605
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-3974.893{col 26}{space 2} 4993.017{col 37}{space 1}   -0.80{col 46}{space 3}0.429{col 54}{space 4}-13947.49{col 67}{space 3} 5997.707
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-.8542727{col 26}{space 2} 11.14496{col 37}{space 1}   -0.08{col 46}{space 3}0.939{col 54}{space 4}-23.17745{col 67}{space 3}  21.4689
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} .0979386{col 26}{space 2} 1.693175{col 37}{space 1}    0.06{col 46}{space 3}0.954{col 54}{space 4}-3.287067{col 67}{space 3} 3.482945
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-7.442643{col 26}{space 2} 28.39302{col 37}{space 1}   -0.26{col 46}{space 3}0.794{col 54}{space 4}-64.22087{col 67}{space 3} 49.33558
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0017715{col 26}{space 2} .0003633{col 37}{space 1}    4.88{col 46}{space 3}0.000{col 54}{space 4} .0010454{col 67}{space 3} .0024976
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  5820.48{col 26}{space 2}  5116.41{col 37}{space 1}    1.14{col 46}{space 3}0.259{col 54}{space 4}-4396.973{col 67}{space 3} 16037.93
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0486
{txt}{col 49}Largest FMI{col 67}= {res}    0.3682
{txt}{col 49}Complete DF{col 67}= {res}        68
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     20.23
{txt}{col 49}        avg{col 67}= {res}     60.13
{txt}{col 49}        max{col 67}= {res}     65.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   65.5{txt}){col 67}= {res}      5.72
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 8.182885{col 26}{space 2}  78.8537{col 37}{space 1}    0.10{col 46}{space 3}0.918{col 54}{space 4}-149.4793{col 67}{space 3} 165.8451
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-101.4924{col 26}{space 2} 105.2277{col 37}{space 1}   -0.96{col 46}{space 3}0.339{col 54}{space 4}-312.2976{col 67}{space 3} 109.3127
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -9.13994{col 26}{space 2} 4.927262{col 37}{space 1}   -1.85{col 46}{space 3}0.068{col 54}{space 4} -18.9776{col 67}{space 3} .6977176
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-177.1107{col 26}{space 2} 76.13927{col 37}{space 1}   -2.33{col 46}{space 3}0.023{col 54}{space 4}-329.1453{col 67}{space 3}-25.07603
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0385517{col 26}{space 2} .0597153{col 37}{space 1}    0.65{col 46}{space 3}0.521{col 54}{space 4}-.0807878{col 67}{space 3} .1578913
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} -6.41124{col 26}{space 2} 5.963263{col 37}{space 1}   -1.08{col 46}{space 3}0.286{col 54}{space 4}-18.31937{col 67}{space 3} 5.496892
{txt}w1Creatinine {c |}{col 14}{res}{space 2}  109.063{col 26}{space 2} 183.6912{col 37}{space 1}    0.59{col 46}{space 3}0.559{col 54}{space 4}-273.8351{col 67}{space 3} 491.9611
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 859.4353{col 26}{space 2}  4717.46{col 37}{space 1}    0.18{col 46}{space 3}0.856{col 54}{space 4}-8562.225{col 67}{space 3}  10281.1
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 10.53328{col 26}{space 2} 10.32827{col 37}{space 1}    1.02{col 46}{space 3}0.312{col 54}{space 4}-10.11009{col 67}{space 3} 31.17664
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} -.129901{col 26}{space 2} 1.585806{col 37}{space 1}   -0.08{col 46}{space 3}0.935{col 54}{space 4}-3.297873{col 67}{space 3} 3.038071
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} .2931425{col 26}{space 2} 26.49148{col 37}{space 1}    0.01{col 46}{space 3}0.991{col 54}{space 4}-52.62536{col 67}{space 3} 53.21165
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019653{col 26}{space 2} .0003418{col 37}{space 1}    5.75{col 46}{space 3}0.000{col 54}{space 4} .0012825{col 67}{space 3} .0026481
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 953.5341{col 26}{space 2} 4839.808{col 37}{space 1}    0.20{col 46}{space 3}0.844{col 54}{space 4}-8711.622{col 67}{space 3} 10618.69
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        80
{txt}{col 49}Average RVI{col 67}= {res}    0.0104
{txt}{col 49}Largest FMI{col 67}= {res}    0.0460
{txt}{col 49}Complete DF{col 67}= {res}        67
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     60.53
{txt}{col 49}        avg{col 67}= {res}     64.20
{txt}{col 49}        max{col 67}= {res}     64.86
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   65.0{txt}){col 67}= {res}      1.94
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0497

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 1.945894{col 26}{space 2} .8518017{col 37}{space 1}    2.28{col 46}{space 3}0.026{col 54}{space 4} .2444199{col 67}{space 3} 3.647368
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .6223561{col 26}{space 2} 1.162435{col 37}{space 1}    0.54{col 46}{space 3}0.594{col 54}{space 4}-1.699349{col 67}{space 3} 2.944061
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0158934{col 26}{space 2} .0544158{col 37}{space 1}    0.29{col 46}{space 3}0.771{col 54}{space 4}-.0927942{col 67}{space 3}  .124581
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.2109993{col 26}{space 2} .8382868{col 37}{space 1}   -0.25{col 46}{space 3}0.802{col 54}{space 4}-1.885432{col 67}{space 3} 1.463433
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0007231{col 26}{space 2} .0006507{col 37}{space 1}   -1.11{col 46}{space 3}0.271{col 54}{space 4} -.002023{col 67}{space 3} .0005769
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0807652{col 26}{space 2}  .066555{col 37}{space 1}    1.21{col 46}{space 3}0.229{col 54}{space 4}-.0522004{col 67}{space 3} .2137309
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 1.451221{col 26}{space 2} 1.693415{col 37}{space 1}    0.86{col 46}{space 3}0.395{col 54}{space 4}-1.935503{col 67}{space 3} 4.837944
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-67.18945{col 26}{space 2} 52.01917{col 37}{space 1}   -1.29{col 46}{space 3}0.201{col 54}{space 4}-171.0886{col 67}{space 3} 36.70974
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} .0669353{col 26}{space 2} .1126784{col 37}{space 1}    0.59{col 46}{space 3}0.555{col 54}{space 4}-.1581084{col 67}{space 3} .2919791
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0123329{col 26}{space 2} .0173775{col 37}{space 1}   -0.71{col 46}{space 3}0.480{col 54}{space 4}-.0470411{col 67}{space 3} .0223753
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}  -.34772{col 26}{space 2} .3069622{col 37}{space 1}   -1.13{col 46}{space 3}0.261{col 54}{space 4}-.9608229{col 67}{space 3}  .265383
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 4.23e-06{col 26}{space 2} 3.78e-06{col 37}{space 1}    1.12{col 46}{space 3}0.267{col 54}{space 4}-3.32e-06{col 67}{space 3} .0000118
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 63.94173{col 26}{space 2} 53.38336{col 37}{space 1}    1.20{col 46}{space 3}0.235{col 54}{space 4}-42.68159{col 67}{space 3} 170.5651
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0150
{txt}{col 49}Largest FMI{col 67}= {res}    0.0851
{txt}{col 49}Complete DF{col 67}= {res}       106
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     82.85
{txt}{col 49}        avg{col 67}= {res}     98.17
{txt}{col 49}        max{col 67}= {res}    103.94
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  103.9{txt}){col 67}= {res}      7.23
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-86.70614{col 26}{space 2} 72.08784{col 37}{space 1}   -1.20{col 46}{space 3}0.232{col 54}{space 4}-229.6609{col 67}{space 3} 56.24864
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-77.64143{col 26}{space 2} 97.70553{col 37}{space 1}   -0.79{col 46}{space 3}0.429{col 54}{space 4}-271.4146{col 67}{space 3} 116.1318
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.429075{col 26}{space 2} 4.030629{col 37}{space 1}   -0.35{col 46}{space 3}0.724{col 54}{space 4}-9.422082{col 67}{space 3} 6.563933
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-20.22454{col 26}{space 2} 67.09589{col 37}{space 1}   -0.30{col 46}{space 3}0.764{col 54}{space 4}-153.2791{col 67}{space 3} 112.8301
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0288083{col 26}{space 2} .0470945{col 37}{space 1}    0.61{col 46}{space 3}0.542{col 54}{space 4} -.064588{col 67}{space 3} .1222045
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1.981964{col 26}{space 2} 4.642089{col 37}{space 1}    0.43{col 46}{space 3}0.670{col 54}{space 4}-7.223632{col 67}{space 3} 11.18756
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-150.8853{col 26}{space 2} 183.5265{col 37}{space 1}   -0.82{col 46}{space 3}0.413{col 54}{space 4}-515.8515{col 67}{space 3}  214.081
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-2630.231{col 26}{space 2}  5479.88{col 37}{space 1}   -0.48{col 46}{space 3}0.633{col 54}{space 4}-13529.78{col 67}{space 3} 8269.321
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 18.17372{col 26}{space 2} 8.457579{col 37}{space 1}    2.15{col 46}{space 3}0.034{col 54}{space 4} 1.380021{col 67}{space 3} 34.96742
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-1.902394{col 26}{space 2} 1.405299{col 37}{space 1}   -1.35{col 46}{space 3}0.179{col 54}{space 4}-4.689275{col 67}{space 3} .8844873
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} 2.878224{col 26}{space 2} 25.99766{col 37}{space 1}    0.11{col 46}{space 3}0.912{col 54}{space 4}-48.67977{col 67}{space 3} 54.43622
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019679{col 26}{space 2} .0002984{col 37}{space 1}    6.59{col 46}{space 3}0.000{col 54}{space 4} .0013761{col 67}{space 3} .0025597
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 3866.032{col 26}{space 2} 5505.953{col 37}{space 1}    0.70{col 46}{space 3}0.485{col 54}{space 4}-7084.767{col 67}{space 3} 14816.83
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0237
{txt}{col 49}Largest FMI{col 67}= {res}    0.1847
{txt}{col 49}Complete DF{col 67}= {res}       106
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     53.15
{txt}{col 49}        avg{col 67}= {res}     93.68
{txt}{col 49}        max{col 67}= {res}    103.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  103.7{txt}){col 67}= {res}      9.35
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} -97.7223{col 26}{space 2} 73.65409{col 37}{space 1}   -1.33{col 46}{space 3}0.187{col 54}{space 4}-243.7851{col 67}{space 3} 48.34052
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-198.4996{col 26}{space 2} 100.2745{col 37}{space 1}   -1.98{col 46}{space 3}0.050{col 54}{space 4}-397.4063{col 67}{space 3} .4071463
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.359518{col 26}{space 2} 4.117741{col 37}{space 1}    0.33{col 46}{space 3}0.742{col 54}{space 4}-6.806329{col 67}{space 3} 9.525365
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 8.402196{col 26}{space 2} 68.50156{col 37}{space 1}    0.12{col 46}{space 3}0.903{col 54}{space 4}-127.4392{col 67}{space 3} 144.2436
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0608585{col 26}{space 2} .0482039{col 37}{space 1}    1.26{col 46}{space 3}0.210{col 54}{space 4}-.0347451{col 67}{space 3} .1564621
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 6.264825{col 26}{space 2} 4.742747{col 37}{space 1}    1.32{col 46}{space 3}0.189{col 54}{space 4}-3.140508{col 67}{space 3} 15.67016
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-58.06901{col 26}{space 2} 197.6391{col 37}{space 1}   -0.29{col 46}{space 3}0.770{col 54}{space 4}-454.4568{col 67}{space 3} 338.3188
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-1632.916{col 26}{space 2} 5675.091{col 37}{space 1}   -0.29{col 46}{space 3}0.774{col 54}{space 4}-12941.38{col 67}{space 3} 9675.546
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 18.30104{col 26}{space 2}  8.73048{col 37}{space 1}    2.10{col 46}{space 3}0.039{col 54}{space 4}  .948163{col 67}{space 3} 35.65392
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.5665504{col 26}{space 2} 1.435241{col 37}{space 1}   -0.39{col 46}{space 3}0.694{col 54}{space 4}-3.412822{col 67}{space 3} 2.279721
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-5.225787{col 26}{space 2} 26.49618{col 37}{space 1}   -0.20{col 46}{space 3}0.844{col 54}{space 4}-57.76952{col 67}{space 3} 47.31794
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0025455{col 26}{space 2}  .000305{col 37}{space 1}    8.35{col 46}{space 3}0.000{col 54}{space 4} .0019407{col 67}{space 3} .0031504
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2063.329{col 26}{space 2} 5705.856{col 37}{space 1}    0.36{col 46}{space 3}0.719{col 54}{space 4}-9306.732{col 67}{space 3} 13433.39
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       117
{txt}{col 49}Average RVI{col 67}= {res}    0.0041
{txt}{col 49}Largest FMI{col 67}= {res}    0.0399
{txt}{col 49}Complete DF{col 67}= {res}       104
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     94.78
{txt}{col 49}        avg{col 67}= {res}    101.12
{txt}{col 49}        max{col 67}= {res}    102.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  102.0{txt}){col 67}= {res}      1.54
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1276

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.612549{col 26}{space 2} .9554125{col 37}{space 1}    2.73{col 46}{space 3}0.007{col 54}{space 4} .7174982{col 67}{space 3}   4.5076
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.7090678{col 26}{space 2} 1.289333{col 37}{space 1}   -0.55{col 46}{space 3}0.584{col 54}{space 4}-3.266498{col 67}{space 3} 1.848363
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0211332{col 26}{space 2} .0544322{col 37}{space 1}   -0.39{col 46}{space 3}0.699{col 54}{space 4}-.1290997{col 67}{space 3} .0868334
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.652573{col 26}{space 2} .8834686{col 37}{space 1}    1.87{col 46}{space 3}0.064{col 54}{space 4}-.0998087{col 67}{space 3} 3.404956
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0005013{col 26}{space 2} .0006109{col 37}{space 1}   -0.82{col 46}{space 3}0.414{col 54}{space 4}-.0017131{col 67}{space 3} .0007105
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-.0045885{col 26}{space 2} .0612019{col 37}{space 1}   -0.07{col 46}{space 3}0.940{col 54}{space 4}-.1259823{col 67}{space 3} .1168053
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-.4184743{col 26}{space 2} 2.394282{col 37}{space 1}   -0.17{col 46}{space 3}0.862{col 54}{space 4}-5.171866{col 67}{space 3} 4.334917
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}  106.098{col 26}{space 2} 69.34003{col 37}{space 1}    1.53{col 46}{space 3}0.129{col 54}{space 4}-31.45736{col 67}{space 3} 243.6535
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-.0056389{col 26}{space 2} .1101158{col 37}{space 1}   -0.05{col 46}{space 3}0.959{col 54}{space 4}-.2240829{col 67}{space 3} .2128052
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0034908{col 26}{space 2} .0182752{col 37}{space 1}   -0.19{col 46}{space 3}0.849{col 54}{space 4}-.0397396{col 67}{space 3}  .032758
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} .3219479{col 26}{space 2} .3437528{col 37}{space 1}    0.94{col 46}{space 3}0.351{col 54}{space 4}-.3598914{col 67}{space 3} 1.003787
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.26e-06{col 26}{space 2} 3.88e-06{col 37}{space 1}    0.58{col 46}{space 3}0.561{col 54}{space 4}-5.43e-06{col 67}{space 3} 9.96e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-111.2082{col 26}{space 2} 69.64013{col 37}{space 1}   -1.60{col 46}{space 3}0.113{col 54}{space 4}-249.3603{col 67}{space 3} 26.94385
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. **INTERACTION by Race**
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0329
{txt}{col 49}Largest FMI{col 67}= {res}    0.3254
{txt}{col 49}Complete DF{col 67}= {res}       185
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     34.00
{txt}{col 49}        avg{col 67}= {res}    165.64
{txt}{col 49}        max{col 67}= {res}    182.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  182.0{txt}){col 67}= {res}     11.39
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} -59.2947{col 28}{space 2} 63.13528{col 39}{space 1}   -0.94{col 48}{space 3}0.349{col 56}{space 4}-183.8712{col 69}{space 3} 65.28177
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} -147.988{col 28}{space 2}  177.152{col 39}{space 1}   -0.84{col 48}{space 3}0.405{col 56}{space 4}-497.6294{col 69}{space 3} 201.6534
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 51.31331{col 28}{space 2} 86.44225{col 39}{space 1}    0.59{col 48}{space 3}0.554{col 56}{space 4}-119.2717{col 69}{space 3} 221.8983
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-49.02419{col 28}{space 2} 71.17781{col 39}{space 1}   -0.69{col 48}{space 3}0.492{col 56}{space 4}-189.5746{col 69}{space 3} 91.52624
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-5.038841{col 28}{space 2} 2.953859{col 39}{space 1}   -1.71{col 48}{space 3}0.090{col 56}{space 4}-10.86705{col 69}{space 3} .7893666
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-78.72942{col 28}{space 2} 49.31025{col 39}{space 1}   -1.60{col 48}{space 3}0.112{col 56}{space 4}-176.0203{col 69}{space 3} 18.56149
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0028481{col 28}{space 2} .0358701{col 39}{space 1}    0.08{col 48}{space 3}0.937{col 56}{space 4}-.0679255{col 69}{space 3} .0736218
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .1911151{col 28}{space 2} 3.572507{col 39}{space 1}    0.05{col 48}{space 3}0.957{col 56}{space 4}-6.857511{col 69}{space 3} 7.239741
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-7.395116{col 28}{space 2} 133.8305{col 39}{space 1}   -0.06{col 48}{space 3}0.956{col 56}{space 4}-279.3711{col 69}{space 3} 264.5809
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-2163.499{col 28}{space 2} 3614.241{col 39}{space 1}   -0.60{col 48}{space 3}0.550{col 56}{space 4}-9300.565{col 69}{space 3} 4973.566
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 10.16165{col 28}{space 2} 6.389524{col 39}{space 1}    1.59{col 48}{space 3}0.114{col 56}{space 4}-2.460798{col 69}{space 3} 22.78411
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.6922936{col 28}{space 2} 1.037262{col 39}{space 1}   -0.67{col 48}{space 3}0.505{col 56}{space 4}-2.738861{col 69}{space 3} 1.354273
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-5.055964{col 28}{space 2} 18.50976{col 39}{space 1}   -0.27{col 48}{space 3}0.785{col 56}{space 4}-41.57756{col 69}{space 3} 31.46563
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0017741{col 28}{space 2} .0002193{col 39}{space 1}    8.09{col 48}{space 3}0.000{col 56}{space 4} .0013414{col 69}{space 3} .0022068
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 3853.616{col 28}{space 2}   3663.7{col 39}{space 1}    1.05{col 48}{space 3}0.294{col 56}{space 4}-3381.296{col 69}{space 3} 11088.53
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0144
{txt}{col 49}Largest FMI{col 67}= {res}    0.1492
{txt}{col 49}Complete DF{col 67}= {res}       185
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     89.15
{txt}{col 49}        avg{col 67}= {res}    173.21
{txt}{col 49}        max{col 67}= {res}    183.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  182.8{txt}){col 67}= {res}     14.40
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-61.59938{col 28}{space 2} 63.41271{col 39}{space 1}   -0.97{col 48}{space 3}0.333{col 56}{space 4}-186.7163{col 69}{space 3} 63.51758
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-164.3199{col 28}{space 2} 176.9449{col 39}{space 1}   -0.93{col 48}{space 3}0.354{col 56}{space 4}-513.4586{col 69}{space 3} 184.8187
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 58.97453{col 28}{space 2}  86.5525{col 39}{space 1}    0.68{col 48}{space 3}0.497{col 56}{space 4}-111.8016{col 69}{space 3} 229.7507
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-125.5599{col 28}{space 2} 70.77754{col 39}{space 1}   -1.77{col 48}{space 3}0.078{col 56}{space 4}-265.2334{col 69}{space 3} 14.11366
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-3.237314{col 28}{space 2} 2.970235{col 39}{space 1}   -1.09{col 48}{space 3}0.277{col 56}{space 4}-9.097678{col 69}{space 3}  2.62305
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-61.79067{col 28}{space 2}  49.6382{col 39}{space 1}   -1.24{col 48}{space 3}0.215{col 56}{space 4} -159.728{col 69}{space 3} 36.14663
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0300347{col 28}{space 2} .0361242{col 39}{space 1}    0.83{col 48}{space 3}0.407{col 56}{space 4}-.0412401{col 69}{space 3} .1013096
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1.140001{col 28}{space 2} 3.598246{col 39}{space 1}    0.32{col 48}{space 3}0.752{col 56}{space 4}-5.959419{col 69}{space 3}  8.23942
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} 25.13627{col 28}{space 2} 122.0372{col 39}{space 1}    0.21{col 48}{space 3}0.837{col 56}{space 4}-217.3434{col 69}{space 3} 267.6159
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} 309.5174{col 28}{space 2} 3630.122{col 39}{space 1}    0.09{col 48}{space 3}0.932{col 56}{space 4}-6857.726{col 69}{space 3} 7476.761
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 12.14221{col 28}{space 2} 6.326284{col 39}{space 1}    1.92{col 48}{space 3}0.057{col 56}{space 4} -.343046{col 69}{space 3} 24.62747
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.1016612{col 28}{space 2} 1.044363{col 39}{space 1}   -0.10{col 48}{space 3}0.923{col 56}{space 4}-2.162231{col 69}{space 3} 1.958909
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-8.550749{col 28}{space 2} 18.61339{col 39}{space 1}   -0.46{col 48}{space 3}0.647{col 56}{space 4}-45.27582{col 69}{space 3} 28.17432
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2}  .002164{col 28}{space 2} .0002209{col 39}{space 1}    9.80{col 48}{space 3}0.000{col 56}{space 4} .0017283{col 69}{space 3} .0025998
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 949.8222{col 28}{space 2} 3678.634{col 39}{space 1}    0.26{col 48}{space 3}0.797{col 56}{space 4}-6313.234{col 69}{space 3} 8212.878
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       197
{txt}{col 49}Average RVI{col 67}= {res}    0.0011
{txt}{col 49}Largest FMI{col 67}= {res}    0.0123
{txt}{col 49}Complete DF{col 67}= {res}       182
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    176.76
{txt}{col 49}        avg{col 67}= {res}    179.69
{txt}{col 49}        max{col 67}= {res}    180.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  180.0{txt}){col 67}= {res}      1.85
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0393

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 2.090425{col 28}{space 2} .7852294{col 39}{space 1}    2.66{col 48}{space 3}0.008{col 56}{space 4} .5409864{col 69}{space 3} 3.639863
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.318659{col 28}{space 2} 2.157118{col 39}{space 1}    0.61{col 48}{space 3}0.542{col 56}{space 4} -2.93784{col 69}{space 3} 5.575157
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.0412461{col 28}{space 2} 1.057892{col 39}{space 1}   -0.04{col 48}{space 3}0.969{col 56}{space 4}-2.128713{col 69}{space 3} 2.046221
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .1738554{col 28}{space 2} .8784532{col 39}{space 1}    0.20{col 48}{space 3}0.843{col 56}{space 4}-1.559549{col 69}{space 3} 1.907259
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0047742{col 28}{space 2} .0372467{col 39}{space 1}    0.13{col 48}{space 3}0.898{col 56}{space 4}-.0687223{col 69}{space 3} .0782707
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .8154874{col 28}{space 2} .6073149{col 39}{space 1}    1.34{col 48}{space 3}0.181{col 56}{space 4}-.3828848{col 69}{space 3}  2.01386
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0005118{col 28}{space 2} .0004372{col 39}{space 1}   -1.17{col 48}{space 3}0.243{col 56}{space 4}-.0013746{col 69}{space 3}  .000351
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0350196{col 28}{space 2} .0443423{col 39}{space 1}    0.79{col 48}{space 3}0.431{col 56}{space 4} -.052478{col 69}{space 3} .1225171
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} .2592385{col 28}{space 2} 1.398472{col 39}{space 1}    0.19{col 48}{space 3}0.853{col 56}{space 4}-2.500612{col 69}{space 3} 3.019089
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}  25.8844{col 28}{space 2}  43.6679{col 39}{space 1}    0.59{col 48}{space 3}0.554{col 56}{space 4}-60.28369{col 69}{space 3} 112.0525
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} .0458527{col 28}{space 2}   .07789{col 39}{space 1}    0.59{col 48}{space 3}0.557{col 56}{space 4}-.1078434{col 69}{space 3} .1995487
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.0041223{col 28}{space 2} .0126875{col 39}{space 1}   -0.32{col 48}{space 3}0.746{col 56}{space 4}-.0291576{col 69}{space 3} .0209131
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2} .0554629{col 28}{space 2} .2353708{col 39}{space 1}    0.24{col 48}{space 3}0.814{col 56}{space 4}-.4089782{col 69}{space 3} .5199041
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.18e-06{col 28}{space 2} 2.70e-06{col 39}{space 1}    0.81{col 48}{space 3}0.422{col 56}{space 4}-3.16e-06{col 69}{space 3} 7.51e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-30.70183{col 28}{space 2} 44.17127{col 39}{space 1}   -0.70{col 48}{space 3}0.488{col 56}{space 4}-117.8633{col 69}{space 3} 56.45962
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0333
{txt}{col 49}Largest FMI{col 67}= {res}    0.3094
{txt}{col 49}Complete DF{col 67}= {res}       186
{txt}{col 49}DF:     min{col 67}= {res}     36.74
{txt}{col 49}        avg{col 67}= {res}    166.80
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}        max{col 67}= {res}    183.97
{txt}{col 49}{help j_robustsingular##|_new:F(  12,      .)}{col 67}=          {res}.
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}=          {res}.

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-37.25832{col 26}{space 2} 50.88558{col 37}{space 1}   -0.73{col 46}{space 3}0.465{col 54}{space 4}-137.6533{col 67}{space 3}  63.1367
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-43.57278{col 26}{space 2} 70.24163{col 37}{space 1}   -0.62{col 46}{space 3}0.536{col 54}{space 4} -182.245{col 67}{space 3} 95.09944
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-5.060419{col 26}{space 2} 2.949241{col 37}{space 1}   -1.72{col 46}{space 3}0.088{col 54}{space 4}-10.87934{col 67}{space 3} .7584995
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-47.71295{col 26}{space 2} 51.06917{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4}-148.4815{col 67}{space 3} 53.05563
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-79.51262{col 26}{space 2} 49.20706{col 37}{space 1}   -1.62{col 46}{space 3}0.108{col 54}{space 4}-176.5964{col 67}{space 3} 17.57113
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0020168{col 26}{space 2} .0357846{col 37}{space 1}    0.06{col 46}{space 3}0.955{col 54}{space 4}-.0685856{col 67}{space 3} .0726193
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0910275{col 26}{space 2} 3.562295{col 37}{space 1}    0.03{col 46}{space 3}0.980{col 54}{space 4}-6.937188{col 67}{space 3} 7.119243
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-19.32324{col 26}{space 2} 130.2101{col 37}{space 1}   -0.15{col 46}{space 3}0.883{col 54}{space 4}-283.2165{col 67}{space 3}   244.57
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-2302.201{col 26}{space 2} 3598.888{col 37}{space 1}   -0.64{col 46}{space 3}0.523{col 54}{space 4}-9408.514{col 67}{space 3} 4804.112
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 10.13172{col 26}{space 2}  6.37474{col 37}{space 1}    1.59{col 46}{space 3}0.114{col 54}{space 4}-2.460543{col 67}{space 3} 22.72398
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.6707219{col 26}{space 2} 1.034622{col 37}{space 1}   -0.65{col 46}{space 3}0.518{col 54}{space 4}-2.712003{col 67}{space 3} 1.370559
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} -4.39417{col 26}{space 2}  18.4413{col 37}{space 1}   -0.24{col 46}{space 3}0.812{col 54}{space 4}-40.77925{col 67}{space 3} 31.99091
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0017535{col 26}{space 2} .0002162{col 37}{space 1}    8.11{col 46}{space 3}0.000{col 54}{space 4} .0013269{col 67}{space 3}   .00218
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4028.771{col 26}{space 2} 3647.103{col 37}{space 1}    1.10{col 46}{space 3}0.271{col 54}{space 4}-3172.847{col 67}{space 3} 11230.39
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0144
{txt}{col 49}Largest FMI{col 67}= {res}    0.1379
{txt}{col 49}Complete DF{col 67}= {res}       186
{txt}{col 49}DF:     min{col 67}= {res}     95.90
{txt}{col 49}        avg{col 67}= {res}    174.17
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}        max{col 67}= {res}    183.99
{txt}{col 49}{help j_robustsingular##|_new:F(  12,      .)}{col 67}=          {res}.
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}=          {res}.

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-36.25761{col 26}{space 2} 51.24757{col 37}{space 1}   -0.71{col 46}{space 3}0.480{col 54}{space 4}-137.3664{col 67}{space 3}  64.8512
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-119.2986{col 26}{space 2} 69.98962{col 37}{space 1}   -1.70{col 46}{space 3}0.090{col 54}{space 4}-257.4069{col 67}{space 3} 18.80963
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-3.263323{col 26}{space 2} 2.965383{col 37}{space 1}   -1.10{col 46}{space 3}0.273{col 54}{space 4}-9.113898{col 67}{space 3} 2.587253
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-49.09547{col 26}{space 2} 51.25277{col 37}{space 1}   -0.96{col 46}{space 3}0.339{col 54}{space 4}-150.2175{col 67}{space 3} 52.02658
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} -62.7007{col 26}{space 2} 49.54821{col 37}{space 1}   -1.27{col 46}{space 3}0.207{col 54}{space 4}-160.4569{col 67}{space 3} 35.05548
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}  .029086{col 26}{space 2} .0360391{col 37}{space 1}    0.81{col 46}{space 3}0.421{col 54}{space 4}-.0420182{col 67}{space 3} .1001902
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1.027243{col 26}{space 2} 3.588663{col 37}{space 1}    0.29{col 46}{space 3}0.775{col 54}{space 4}-6.052998{col 67}{space 3} 8.107483
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 11.48583{col 26}{space 2} 119.2375{col 37}{space 1}    0.10{col 46}{space 3}0.923{col 54}{space 4}-225.2017{col 67}{space 3} 248.1734
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 149.8604{col 26}{space 2} 3617.669{col 37}{space 1}    0.04{col 46}{space 3}0.967{col 54}{space 4}-6992.603{col 67}{space 3} 7292.324
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 12.10546{col 26}{space 2} 6.314764{col 37}{space 1}    1.92{col 46}{space 3}0.057{col 54}{space 4}-.3564548{col 67}{space 3} 24.56737
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0762213{col 26}{space 2} 1.041921{col 37}{space 1}   -0.07{col 46}{space 3}0.942{col 54}{space 4}-2.131892{col 67}{space 3} 1.979449
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} -7.78575{col 26}{space 2} 18.55129{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-44.38693{col 67}{space 3} 28.81543
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0021403{col 26}{space 2} .0002178{col 37}{space 1}    9.83{col 46}{space 3}0.000{col 54}{space 4} .0017106{col 67}{space 3} .0025699
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1145.604{col 26}{space 2} 3665.283{col 37}{space 1}    0.31{col 46}{space 3}0.755{col 54}{space 4}-6090.861{col 67}{space 3} 8382.068
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       197
{txt}{col 49}Average RVI{col 67}= {res}    0.0012
{txt}{col 49}Largest FMI{col 67}= {res}    0.0122
{txt}{col 49}Complete DF{col 67}= {res}       183
{txt}{col 49}DF:     min{col 67}= {res}    177.77
{txt}{col 49}        avg{col 67}= {res}    180.68
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}        max{col 67}= {res}    181.02
{txt}{col 49}{help j_robustsingular##|_new:F(  12,      .)}{col 67}=          {res}.
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}=          {res}.

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.072196{col 26}{space 2}   .62909{col 37}{space 1}    3.29{col 46}{space 3}0.001{col 54}{space 4} .8309037{col 67}{space 3} 3.313489
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .1699732{col 26}{space 2} .8703758{col 37}{space 1}    0.20{col 46}{space 3}0.845{col 54}{space 4}-1.547427{col 67}{space 3} 1.887373
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0048196{col 26}{space 2} .0371251{col 37}{space 1}    0.13{col 46}{space 3}0.897{col 54}{space 4}-.0684342{col 67}{space 3} .0780735
{txt}{space 8}Race {c |}{col 14}{res}{space 2} 1.238204{col 26}{space 2} .6245621{col 37}{space 1}    1.98{col 46}{space 3}0.049{col 54}{space 4} .0058438{col 67}{space 3} 2.470564
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}  .815802{col 26}{space 2} .6055982{col 37}{space 1}    1.35{col 46}{space 3}0.180{col 54}{space 4}-.3791381{col 67}{space 3} 2.010742
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0005111{col 26}{space 2} .0004357{col 37}{space 1}   -1.17{col 46}{space 3}0.242{col 54}{space 4}-.0013707{col 67}{space 3} .0003486
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0351251{col 26}{space 2} .0441332{col 37}{space 1}    0.80{col 46}{space 3}0.427{col 54}{space 4}-.0519567{col 67}{space 3} .1222069
{txt}w1Creatinine {c |}{col 14}{res}{space 2} .2674628{col 26}{space 2} 1.377196{col 37}{space 1}    0.19{col 46}{space 3}0.846{col 54}{space 4}-2.450293{col 67}{space 3} 2.985219
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}  26.0112{col 26}{space 2} 43.42633{col 37}{space 1}    0.60{col 46}{space 3}0.550{col 54}{space 4}-59.67694{col 67}{space 3} 111.6993
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} .0457958{col 26}{space 2} .0776599{col 37}{space 1}    0.59{col 46}{space 3}0.556{col 54}{space 4}-.1074404{col 67}{space 3} .1990321
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0041418{col 26}{space 2} .0126438{col 37}{space 1}   -0.33{col 46}{space 3}0.744{col 54}{space 4}  -.02909{col 67}{space 3} .0208065
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} .0548518{col 26}{space 2} .2341912{col 37}{space 1}    0.23{col 46}{space 3}0.815{col 54}{space 4}-.4072445{col 67}{space 3} .5169482
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.19e-06{col 26}{space 2} 2.67e-06{col 37}{space 1}    0.82{col 46}{space 3}0.411{col 54}{space 4}-3.06e-06{col 67}{space 3} 7.45e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-32.05637{col 26}{space 2}  43.9169{col 37}{space 1}   -0.73{col 46}{space 3}0.466{col 54}{space 4}-118.7125{col 67}{space 3} 54.59981
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. ***********MODEL 5: MODEL2+OXIDATIVE STRESS******
. 
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0849
{txt}{col 49}Largest FMI{col 67}= {res}    0.5101
{txt}{col 49}Complete DF{col 67}= {res}        70
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     12.74
{txt}{col 49}        avg{col 67}= {res}     61.89
{txt}{col 49}        max{col 67}= {res}     67.89
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   66.8{txt}){col 67}= {res}      5.59
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 26.96436{col 26}{space 2} 79.13403{col 37}{space 1}    0.34{col 46}{space 3}0.734{col 54}{space 4}-130.9947{col 67}{space 3} 184.9235
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-48.11094{col 26}{space 2}  85.2136{col 37}{space 1}   -0.56{col 46}{space 3}0.574{col 54}{space 4}-218.1616{col 67}{space 3} 121.9397
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-9.076089{col 26}{space 2} 4.603364{col 37}{space 1}   -1.97{col 46}{space 3}0.053{col 54}{space 4}-18.26509{col 67}{space 3} .1129099
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-193.7874{col 26}{space 2} 77.97428{col 37}{space 1}   -2.49{col 46}{space 3}0.015{col 54}{space 4}-349.4269{col 67}{space 3}-38.14789
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0202175{col 26}{space 2} .0628262{col 37}{space 1}    0.32{col 46}{space 3}0.749{col 54}{space 4}-.1053355{col 67}{space 3} .1457704
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .7466461{col 26}{space 2}  5.89283{col 37}{space 1}    0.13{col 46}{space 3}0.900{col 54}{space 4}-11.01458{col 67}{space 3} 12.50788
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-.5737482{col 26}{space 2} 6.452568{col 37}{space 1}   -0.09{col 46}{space 3}0.931{col 54}{space 4}-14.54254{col 67}{space 3} 13.39505
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 178.3093{col 26}{space 2} 119.2281{col 37}{space 1}    1.50{col 46}{space 3}0.139{col 54}{space 4}-59.61612{col 67}{space 3} 416.2347
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-.1228362{col 26}{space 2} 18.34327{col 37}{space 1}   -0.01{col 46}{space 3}0.995{col 54}{space 4}-36.72734{col 67}{space 3} 36.48166
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0017414{col 26}{space 2} .0003417{col 37}{space 1}    5.10{col 46}{space 3}0.000{col 54}{space 4} .0010593{col 67}{space 3} .0024236
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1043.56{col 26}{space 2} 710.9811{col 37}{space 1}    1.47{col 46}{space 3}0.147{col 54}{space 4} -375.276{col 67}{space 3} 2462.396
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0738
{txt}{col 49}Largest FMI{col 67}= {res}    0.4659
{txt}{col 49}Complete DF{col 67}= {res}        70
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     14.70
{txt}{col 49}        avg{col 67}= {res}     61.75
{txt}{col 49}        max{col 67}= {res}     67.85
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   67.0{txt}){col 67}= {res}      6.49
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 7.870859{col 26}{space 2}  74.8549{col 37}{space 1}    0.11{col 46}{space 3}0.917{col 54}{space 4}-141.5278{col 67}{space 3} 157.2695
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-63.38945{col 26}{space 2} 81.01418{col 37}{space 1}   -0.78{col 46}{space 3}0.437{col 54}{space 4}-225.0789{col 67}{space 3} 98.30004
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.478337{col 26}{space 2} 4.389327{col 37}{space 1}   -1.48{col 46}{space 3}0.145{col 54}{space 4}-15.24318{col 67}{space 3} 2.286511
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-175.4752{col 26}{space 2} 73.80169{col 37}{space 1}   -2.38{col 46}{space 3}0.020{col 54}{space 4}-322.7722{col 67}{space 3}-28.17827
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0281615{col 26}{space 2} .0596123{col 37}{space 1}    0.47{col 46}{space 3}0.638{col 54}{space 4} -.090977{col 67}{space 3} .1472999
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-2.977363{col 26}{space 2} 5.611696{col 37}{space 1}   -0.53{col 46}{space 3}0.597{col 54}{space 4}-14.18014{col 67}{space 3} 8.225411
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} -3.34465{col 26}{space 2} 5.903467{col 37}{space 1}   -0.57{col 46}{space 3}0.580{col 54}{space 4}-15.94984{col 67}{space 3} 9.260545
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 170.0126{col 26}{space 2} 113.4833{col 37}{space 1}    1.50{col 46}{space 3}0.139{col 54}{space 4}-56.48806{col 67}{space 3} 396.5133
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 1.558466{col 26}{space 2} 17.39851{col 37}{space 1}    0.09{col 46}{space 3}0.929{col 54}{space 4}-33.16114{col 67}{space 3} 36.27807
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0018706{col 26}{space 2} .0003244{col 37}{space 1}    5.77{col 46}{space 3}0.000{col 54}{space 4} .0012229{col 67}{space 3} .0025182
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1227.868{col 26}{space 2} 676.0348{col 37}{space 1}    1.82{col 46}{space 3}0.074{col 54}{space 4}-121.4017{col 67}{space 3} 2577.138
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        80
{txt}{col 49}Average RVI{col 67}= {res}    0.0141
{txt}{col 49}Largest FMI{col 67}= {res}    0.1269
{txt}{col 49}Complete DF{col 67}= {res}        69
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     49.19
{txt}{col 49}        avg{col 67}= {res}     65.27
{txt}{col 49}        max{col 67}= {res}     67.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   67.0{txt}){col 67}= {res}      1.80
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0779

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.050945{col 26}{space 2} .8410706{col 37}{space 1}    2.44{col 46}{space 3}0.017{col 54}{space 4} .3721324{col 67}{space 3} 3.729757
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .7676167{col 26}{space 2}  .926282{col 37}{space 1}    0.83{col 46}{space 3}0.410{col 54}{space 4}-1.081268{col 67}{space 3} 2.616501
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0043154{col 26}{space 2}  .049404{col 37}{space 1}   -0.09{col 46}{space 3}0.931{col 54}{space 4} -.102937{col 67}{space 3} .0943062
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.3952118{col 26}{space 2} .8294862{col 37}{space 1}   -0.48{col 46}{space 3}0.635{col 54}{space 4}-2.050906{col 67}{space 3} 1.260483
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0004985{col 26}{space 2}   .00066{col 37}{space 1}   -0.76{col 46}{space 3}0.453{col 54}{space 4}-.0018161{col 67}{space 3} .0008191
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0736815{col 26}{space 2} .0627682{col 37}{space 1}    1.17{col 46}{space 3}0.245{col 54}{space 4}-.0516063{col 67}{space 3} .1989694
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} .0173761{col 26}{space 2} .0544181{col 37}{space 1}    0.32{col 46}{space 3}0.751{col 54}{space 4}-.0919703{col 67}{space 3} .1267225
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-.6458137{col 26}{space 2} 1.295888{col 37}{space 1}   -0.50{col 46}{space 3}0.620{col 54}{space 4}-3.232416{col 67}{space 3} 1.940788
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} .0734438{col 26}{space 2} .1977952{col 37}{space 1}    0.37{col 46}{space 3}0.712{col 54}{space 4}-.3213529{col 67}{space 3} .4682405
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.65e-06{col 26}{space 2} 3.63e-06{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4}-3.61e-06{col 67}{space 3} .0000109
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.641701{col 26}{space 2} 7.714438{col 37}{space 1}   -0.21{col 46}{space 3}0.832{col 54}{space 4}-17.03966{col 67}{space 3} 13.75626
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITE//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0101
{txt}{col 49}Largest FMI{col 67}= {res}    0.0683
{txt}{col 49}Complete DF{col 67}= {res}       108
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     89.78
{txt}{col 49}        avg{col 67}= {res}    103.98
{txt}{col 49}        max{col 67}= {res}    106.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  106.0{txt}){col 67}= {res}      7.18
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-45.03035{col 26}{space 2} 73.57068{col 37}{space 1}   -0.61{col 46}{space 3}0.542{col 54}{space 4}-190.8984{col 67}{space 3} 100.8376
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-78.56227{col 26}{space 2} 84.45239{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-245.9978{col 67}{space 3} 88.87326
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -1.96392{col 26}{space 2} 3.989902{col 37}{space 1}   -0.49{col 46}{space 3}0.624{col 54}{space 4}-9.874265{col 67}{space 3} 5.946425
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -21.0366{col 26}{space 2} 68.03172{col 37}{space 1}   -0.31{col 46}{space 3}0.758{col 54}{space 4}-155.9161{col 67}{space 3} 113.8429
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0286813{col 26}{space 2} .0475592{col 37}{space 1}    0.60{col 46}{space 3}0.548{col 54}{space 4}-.0656099{col 67}{space 3} .1229726
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 3.978376{col 26}{space 2} 4.629027{col 37}{space 1}    0.86{col 46}{space 3}0.392{col 54}{space 4}-5.199329{col 67}{space 3} 13.15608
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} .9692221{col 26}{space 2} 3.147587{col 37}{space 1}    0.31{col 46}{space 3}0.759{col 54}{space 4} -5.28422{col 67}{space 3} 7.222664
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 115.3072{col 26}{space 2} 125.4574{col 37}{space 1}    0.92{col 46}{space 3}0.360{col 54}{space 4}-133.4291{col 67}{space 3} 364.0435
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} .8073337{col 26}{space 2} 14.82676{col 37}{space 1}    0.05{col 46}{space 3}0.957{col 54}{space 4}-28.60562{col 67}{space 3} 30.22029
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0018605{col 26}{space 2} .0002904{col 37}{space 1}    6.41{col 46}{space 3}0.000{col 54}{space 4} .0012848{col 67}{space 3} .0024362
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 692.9637{col 26}{space 2} 775.1719{col 37}{space 1}    0.89{col 46}{space 3}0.373{col 54}{space 4}-843.8863{col 67}{space 3} 2229.814
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0121
{txt}{col 49}Largest FMI{col 67}= {res}    0.0787
{txt}{col 49}Complete DF{col 67}= {res}       108
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     86.36
{txt}{col 49}        avg{col 67}= {res}    103.35
{txt}{col 49}        max{col 67}= {res}    106.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  106.0{txt}){col 67}= {res}      9.61
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-41.76381{col 26}{space 2} 74.93336{col 37}{space 1}   -0.56{col 46}{space 3}0.578{col 54}{space 4}-190.3322{col 67}{space 3} 106.8046
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-189.5492{col 26}{space 2} 86.01555{col 37}{space 1}   -2.20{col 46}{space 3}0.030{col 54}{space 4}-360.0825{col 67}{space 3}-19.01593
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .8736052{col 26}{space 2} 4.065979{col 37}{space 1}    0.21{col 46}{space 3}0.830{col 54}{space 4}-7.187612{col 67}{space 3} 8.934822
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}  6.95772{col 26}{space 2} 69.31599{col 37}{space 1}    0.10{col 46}{space 3}0.920{col 54}{space 4} -130.468{col 67}{space 3} 144.3835
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0597269{col 26}{space 2} .0484659{col 37}{space 1}    1.23{col 46}{space 3}0.221{col 54}{space 4}-.0363625{col 67}{space 3} .1558164
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 7.016551{col 26}{space 2} 4.717289{col 37}{space 1}    1.49{col 46}{space 3}0.140{col 54}{space 4}-2.336202{col 67}{space 3}  16.3693
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-.2498373{col 26}{space 2} 3.223527{col 37}{space 1}   -0.08{col 46}{space 3}0.938{col 54}{space 4}-6.657617{col 67}{space 3} 6.157943
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 73.08633{col 26}{space 2} 127.8702{col 37}{space 1}    0.57{col 46}{space 3}0.569{col 54}{space 4} -180.436{col 67}{space 3} 326.6087
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 8.598594{col 26}{space 2} 15.20416{col 37}{space 1}    0.57{col 46}{space 3}0.573{col 54}{space 4}-21.57581{col 67}{space 3}   38.773
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}  .002463{col 26}{space 2} .0002958{col 37}{space 1}    8.33{col 46}{space 3}0.000{col 54}{space 4} .0018765{col 67}{space 3} .0030495
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 200.4744{col 26}{space 2}   789.78{col 37}{space 1}    0.25{col 46}{space 3}0.800{col 54}{space 4}-1365.337{col 67}{space 3} 1766.286
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       117
{txt}{col 49}Average RVI{col 67}= {res}    0.0064
{txt}{col 49}Largest FMI{col 67}= {res}    0.0499
{txt}{col 49}Complete DF{col 67}= {res}       106
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     93.82
{txt}{col 49}        avg{col 67}= {res}    102.93
{txt}{col 49}        max{col 67}= {res}    103.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  104.0{txt}){col 67}= {res}      1.70
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0902

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 3.060656{col 26}{space 2} .9691368{col 37}{space 1}    3.16{col 46}{space 3}0.002{col 54}{space 4} 1.138725{col 67}{space 3} 4.982587
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.3556188{col 26}{space 2} 1.074022{col 37}{space 1}   -0.33{col 46}{space 3}0.741{col 54}{space 4}-2.485514{col 67}{space 3} 1.774276
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0243922{col 26}{space 2} .0525264{col 37}{space 1}   -0.46{col 46}{space 3}0.643{col 54}{space 4}-.1285542{col 67}{space 3} .0797698
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.634663{col 26}{space 2} .8750523{col 37}{space 1}    1.87{col 46}{space 3}0.065{col 54}{space 4} -.100608{col 67}{space 3} 3.369934
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0003841{col 26}{space 2} .0006057{col 37}{space 1}   -0.63{col 46}{space 3}0.527{col 54}{space 4}-.0015853{col 67}{space 3} .0008172
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0657997{col 26}{space 2} .0598155{col 37}{space 1}    1.10{col 46}{space 3}0.274{col 54}{space 4}-.0528176{col 67}{space 3}  .184417
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-.0329273{col 26}{space 2} .0397436{col 37}{space 1}   -0.83{col 46}{space 3}0.409{col 54}{space 4}-.1118412{col 67}{space 3} .0459866
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}  2.78678{col 26}{space 2} 1.612601{col 37}{space 1}    1.73{col 46}{space 3}0.087{col 54}{space 4}-.4112068{col 67}{space 3} 5.984768
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} .0900246{col 26}{space 2} .1857617{col 37}{space 1}    0.48{col 46}{space 3}0.629{col 54}{space 4}-.2783482{col 67}{space 3} .4583974
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.21e-06{col 26}{space 2} 3.68e-06{col 37}{space 1}    0.60{col 46}{space 3}0.549{col 54}{space 4}-5.09e-06{col 67}{space 3} 9.51e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-17.07175{col 26}{space 2} 9.965539{col 37}{space 1}   -1.71{col 46}{space 3}0.090{col 54}{space 4}-36.83405{col 67}{space 3} 2.690545
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. **********INTERACTION by Race***************
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0240
{txt}{col 49}Largest FMI{col 67}= {res}    0.2244
{txt}{col 49}Complete DF{col 67}= {res}       187
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     57.33
{txt}{col 49}        avg{col 67}= {res}    173.96
{txt}{col 49}        max{col 67}= {res}    185.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  184.5{txt}){col 67}= {res}     12.55
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-22.00302{col 28}{space 2}  62.7474{col 39}{space 1}   -0.35{col 48}{space 3}0.726{col 56}{space 4}-145.8021{col 69}{space 3} 101.7961
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-116.1883{col 28}{space 2}  171.968{col 39}{space 1}   -0.68{col 48}{space 3}0.500{col 56}{space 4}-455.4661{col 69}{space 3} 223.0894
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}   26.825{col 28}{space 2} 84.09028{col 39}{space 1}    0.32{col 48}{space 3}0.750{col 56}{space 4}-139.0745{col 69}{space 3} 192.7245
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-59.00247{col 28}{space 2} 59.27981{col 39}{space 1}   -1.00{col 48}{space 3}0.321{col 56}{space 4}-175.9541{col 69}{space 3} 57.94919
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-4.728588{col 28}{space 2} 2.797887{col 39}{space 1}   -1.69{col 48}{space 3}0.093{col 56}{space 4}-10.24845{col 69}{space 3} .7912774
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -85.3275{col 28}{space 2} 49.13971{col 39}{space 1}   -1.74{col 48}{space 3}0.084{col 56}{space 4}-182.2771{col 69}{space 3} 11.62211
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0142363{col 28}{space 2}  .036427{col 39}{space 1}    0.39{col 48}{space 3}0.696{col 56}{space 4}-.0576348{col 69}{space 3} .0861074
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1.963872{col 28}{space 2} 3.491773{col 39}{space 1}    0.56{col 48}{space 3}0.575{col 56}{space 4}-4.925146{col 69}{space 3} 8.852889
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} .0967476{col 28}{space 2} 2.741522{col 39}{space 1}    0.04{col 48}{space 3}0.972{col 56}{space 4}-5.392361{col 69}{space 3} 5.585856
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 147.8502{col 28}{space 2} 85.61859{col 39}{space 1}    1.73{col 48}{space 3}0.086{col 56}{space 4}-21.06603{col 69}{space 3} 316.7664
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} 1.033791{col 28}{space 2} 11.33438{col 39}{space 1}    0.09{col 48}{space 3}0.927{col 56}{space 4}-21.33508{col 69}{space 3} 23.40266
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2}  .001748{col 28}{space 2} .0002144{col 39}{space 1}    8.15{col 48}{space 3}0.000{col 56}{space 4} .0013251{col 69}{space 3} .0021709
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 954.2679{col 28}{space 2} 534.2421{col 39}{space 1}    1.79{col 48}{space 3}0.076{col 56}{space 4}-99.72767{col 69}{space 3} 2008.264
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0118
{txt}{col 49}Largest FMI{col 67}= {res}    0.0934
{txt}{col 49}Complete DF{col 67}= {res}       187
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    126.52
{txt}{col 49}        avg{col 67}= {res}    179.08
{txt}{col 49}        max{col 67}= {res}    184.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  184.9{txt}){col 67}= {res}     15.40
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-8.227394{col 28}{space 2} 63.39585{col 39}{space 1}   -0.13{col 48}{space 3}0.897{col 56}{space 4}-133.3009{col 69}{space 3} 116.8461
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-137.8579{col 28}{space 2}  174.121{col 39}{space 1}   -0.79{col 48}{space 3}0.430{col 56}{space 4}-481.3834{col 69}{space 3} 205.6675
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}  25.7448{col 28}{space 2} 85.17084{col 39}{space 1}    0.30{col 48}{space 3}0.763{col 56}{space 4}-142.2873{col 69}{space 3} 193.7769
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-126.4024{col 28}{space 2} 60.01867{col 39}{space 1}   -2.11{col 48}{space 3}0.037{col 56}{space 4}-244.8116{col 69}{space 3}-7.993141
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2.888947{col 28}{space 2} 2.834153{col 39}{space 1}   -1.02{col 48}{space 3}0.309{col 56}{space 4}-8.480396{col 69}{space 3} 2.702502
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-70.02834{col 28}{space 2} 49.70299{col 39}{space 1}   -1.41{col 48}{space 3}0.161{col 56}{space 4}-168.0875{col 69}{space 3} 28.03083
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0350211{col 28}{space 2} .0368039{col 39}{space 1}    0.95{col 48}{space 3}0.343{col 56}{space 4}-.0375903{col 69}{space 3} .1076325
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2.417376{col 28}{space 2} 3.530984{col 39}{space 1}    0.68{col 48}{space 3}0.494{col 56}{space 4}-4.548856{col 69}{space 3} 9.383608
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2}-1.963567{col 28}{space 2} 2.590745{col 39}{space 1}   -0.76{col 48}{space 3}0.450{col 56}{space 4}-7.090371{col 69}{space 3} 3.163238
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2}  113.874{col 28}{space 2} 86.62685{col 39}{space 1}    1.31{col 48}{space 3}0.190{col 56}{space 4}-57.02956{col 69}{space 3} 284.7776
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} 6.391425{col 28}{space 2} 11.53654{col 39}{space 1}    0.55{col 48}{space 3}0.580{col 56}{space 4}-16.38217{col 69}{space 3} 29.16502
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021471{col 28}{space 2}  .000217{col 39}{space 1}    9.89{col 48}{space 3}0.000{col 56}{space 4} .0017189{col 69}{space 3} .0025753
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 809.9582{col 28}{space 2} 540.7956{col 39}{space 1}    1.50{col 48}{space 3}0.136{col 56}{space 4}-256.9629{col 69}{space 3} 1876.879
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       197
{txt}{col 49}Average RVI{col 67}= {res}    0.0085
{txt}{col 49}Largest FMI{col 67}= {res}    0.0946
{txt}{col 49}Complete DF{col 67}= {res}       184
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    124.05
{txt}{col 49}        avg{col 67}= {res}    177.35
{txt}{col 49}        max{col 67}= {res}    182.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  181.9{txt}){col 67}= {res}      2.08
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0204

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 2.356759{col 28}{space 2} .7857326{col 39}{space 1}    3.00{col 48}{space 3}0.003{col 56}{space 4}  .806382{col 69}{space 3} 3.907136
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.606879{col 28}{space 2} 2.104037{col 39}{space 1}    0.76{col 48}{space 3}0.446{col 56}{space 4}-2.544571{col 69}{space 3} 5.758328
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.2165997{col 28}{space 2}  1.03596{col 39}{space 1}   -0.21{col 48}{space 3}0.835{col 56}{space 4}-2.260644{col 69}{space 3} 1.827444
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .3021771{col 28}{space 2} .7269999{col 39}{space 1}    0.42{col 48}{space 3}0.678{col 56}{space 4} -1.13226{col 69}{space 3} 1.736614
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0068632{col 28}{space 2}  .034861{col 39}{space 1}    0.20{col 48}{space 3}0.844{col 56}{space 4}-.0619204{col 69}{space 3} .0756469
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}   .76121{col 28}{space 2} .6033813{col 39}{space 1}    1.26{col 48}{space 3}0.209{col 56}{space 4}-.4293181{col 69}{space 3} 1.951738
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0004485{col 28}{space 2} .0004425{col 39}{space 1}   -1.01{col 48}{space 3}0.312{col 56}{space 4}-.0013216{col 69}{space 3} .0004245
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0638257{col 28}{space 2} .0428789{col 39}{space 1}    1.49{col 48}{space 3}0.138{col 56}{space 4}-.0207786{col 69}{space 3} .1484301
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2}-.0098155{col 28}{space 2}  .031215{col 39}{space 1}   -0.31{col 48}{space 3}0.754{col 56}{space 4}-.0715986{col 69}{space 3} .0519675
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 1.148852{col 28}{space 2} 1.057352{col 39}{space 1}    1.09{col 48}{space 3}0.279{col 56}{space 4}-.9374057{col 69}{space 3} 3.235111
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} .1297388{col 28}{space 2} .1367343{col 39}{space 1}    0.95{col 48}{space 3}0.344{col 56}{space 4}-.1400502{col 69}{space 3} .3995277
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 1.95e-06{col 28}{space 2} 2.61e-06{col 39}{space 1}    0.75{col 48}{space 3}0.457{col 56}{space 4}-3.20e-06{col 69}{space 3} 7.10e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-9.989937{col 28}{space 2} 6.574482{col 39}{space 1}   -1.52{col 48}{space 3}0.130{col 56}{space 4}-22.96194{col 69}{space 3} 2.982066
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***********MODEL 6: MODEL 2+lifestyle/health-related factors*******  
. 
. 
. 
. //AFRICAN-AMERICAN//
. 
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0050
{txt}{col 49}Largest FMI{col 67}= {res}    0.0237
{txt}{col 49}Complete DF{col 67}= {res}        71
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     66.99
{txt}{col 49}        avg{col 67}= {res}     68.69
{txt}{col 49}        max{col 67}= {res}     69.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   69.1{txt}){col 67}= {res}      6.83
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 52.79532{col 26}{space 2} 81.05351{col 37}{space 1}    0.65{col 46}{space 3}0.517{col 54}{space 4}-108.9108{col 67}{space 3} 214.5014
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  -31.564{col 26}{space 2} 83.34489{col 37}{space 1}   -0.38{col 46}{space 3}0.706{col 54}{space 4}-197.8295{col 67}{space 3} 134.7015
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -10.5986{col 26}{space 2} 4.571472{col 37}{space 1}   -2.32{col 46}{space 3}0.023{col 54}{space 4} -19.7192{col 67}{space 3}-1.477997
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-208.4351{col 26}{space 2} 77.10842{col 37}{space 1}   -2.70{col 46}{space 3}0.009{col 54}{space 4}-362.2684{col 67}{space 3}-54.60187
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0128306{col 26}{space 2} .0585855{col 37}{space 1}    0.22{col 46}{space 3}0.827{col 54}{space 4}-.1040518{col 67}{space 3}  .129713
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-.6015527{col 26}{space 2} 5.646433{col 37}{space 1}   -0.11{col 46}{space 3}0.915{col 54}{space 4}-11.86614{col 67}{space 3} 10.66304
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-113.0032{col 26}{space 2} 72.41868{col 37}{space 1}   -1.56{col 46}{space 3}0.123{col 54}{space 4}-257.5519{col 67}{space 3} 31.54537
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-32.47239{col 26}{space 2} 41.89588{col 37}{space 1}   -0.78{col 46}{space 3}0.441{col 54}{space 4} -116.055{col 67}{space 3} 51.11022
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}  .001838{col 26}{space 2} .0003342{col 37}{space 1}    5.50{col 46}{space 3}0.000{col 54}{space 4} .0011712{col 67}{space 3} .0025048
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1857.287{col 26}{space 2} 456.8583{col 37}{space 1}    4.07{col 46}{space 3}0.000{col 54}{space 4}  945.893{col 67}{space 3} 2768.681
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        81
{txt}{col 49}Average RVI{col 67}= {res}    0.0044
{txt}{col 49}Largest FMI{col 67}= {res}    0.0137
{txt}{col 49}Complete DF{col 67}= {res}        71
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     68.03
{txt}{col 49}        avg{col 67}= {res}     68.80
{txt}{col 49}        max{col 67}= {res}     69.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   69.1{txt}){col 67}= {res}      7.69
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 31.73023{col 26}{space 2} 77.19758{col 37}{space 1}    0.41{col 46}{space 3}0.682{col 54}{space 4}-122.2796{col 67}{space 3} 185.7401
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-44.14066{col 26}{space 2} 79.42456{col 37}{space 1}   -0.56{col 46}{space 3}0.580{col 54}{space 4}-202.5855{col 67}{space 3} 114.3042
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-8.475706{col 26}{space 2}  4.35457{col 37}{space 1}   -1.95{col 46}{space 3}0.056{col 54}{space 4} -17.1634{col 67}{space 3} .2119921
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-185.1999{col 26}{space 2} 73.46523{col 37}{space 1}   -2.52{col 46}{space 3}0.014{col 54}{space 4}-331.7637{col 67}{space 3}-38.63624
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0319127{col 26}{space 2} .0558638{col 37}{space 1}    0.57{col 46}{space 3}0.570{col 54}{space 4}-.0795426{col 67}{space 3} .1433679
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-4.095473{col 26}{space 2}  5.38087{col 37}{space 1}   -0.76{col 46}{space 3}0.449{col 54}{space 4}-14.83027{col 67}{space 3} 6.639324
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-110.9852{col 26}{space 2} 68.67527{col 37}{space 1}   -1.62{col 46}{space 3}0.111{col 54}{space 4}-248.0233{col 67}{space 3} 26.05288
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-17.85534{col 26}{space 2} 39.93514{col 37}{space 1}   -0.45{col 46}{space 3}0.656{col 54}{space 4}-97.52704{col 67}{space 3} 61.81636
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019204{col 26}{space 2} .0003185{col 37}{space 1}    6.03{col 46}{space 3}0.000{col 54}{space 4}  .001285{col 67}{space 3} .0025557
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1978.866{col 26}{space 2} 435.3747{col 37}{space 1}    4.55{col 46}{space 3}0.000{col 54}{space 4}  1110.33{col 67}{space 3} 2847.403
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        80
{txt}{col 49}Average RVI{col 67}= {res}    0.0017
{txt}{col 49}Largest FMI{col 67}= {res}    0.0119
{txt}{col 49}Complete DF{col 67}= {res}        70
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     67.22
{txt}{col 49}        avg{col 67}= {res}     67.97
{txt}{col 49}        max{col 67}= {res}     68.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   68.1{txt}){col 67}= {res}      2.36
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0221

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 1.683195{col 26}{space 2} .8528114{col 37}{space 1}    1.97{col 46}{space 3}0.052{col 54}{space 4}-.0185549{col 67}{space 3} 3.384945
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .8386885{col 26}{space 2} .8872528{col 37}{space 1}    0.95{col 46}{space 3}0.348{col 54}{space 4}-.9317587{col 67}{space 3} 2.609136
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}  .014372{col 26}{space 2}  .048293{col 37}{space 1}    0.30{col 46}{space 3}0.767{col 54}{space 4}-.0819937{col 67}{space 3} .1107377
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.4175169{col 26}{space 2} .8115122{col 37}{space 1}   -0.51{col 46}{space 3}0.609{col 54}{space 4} -2.03683{col 67}{space 3} 1.201797
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0006183{col 26}{space 2} .0006177{col 37}{space 1}   -1.00{col 46}{space 3}0.320{col 54}{space 4}-.0018508{col 67}{space 3} .0006143
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0822632{col 26}{space 2} .0594609{col 37}{space 1}    1.38{col 46}{space 3}0.171{col 54}{space 4}-.0363872{col 67}{space 3} .2009136
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} .4615092{col 26}{space 2} .7605662{col 37}{space 1}    0.61{col 46}{space 3}0.546{col 54}{space 4}-1.056497{col 67}{space 3} 1.979516
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-.6670958{col 26}{space 2} .4413241{col 37}{space 1}   -1.51{col 46}{space 3}0.135{col 54}{space 4}-1.547737{col 67}{space 3} .2135449
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 4.37e-06{col 26}{space 2} 3.54e-06{col 37}{space 1}    1.24{col 46}{space 3}0.221{col 54}{space 4}-2.69e-06{col 67}{space 3} .0000114
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.844965{col 26}{space 2} 4.820451{col 37}{space 1}   -0.80{col 46}{space 3}0.428{col 54}{space 4}-13.46383{col 67}{space 3} 5.773897
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0051
{txt}{col 49}Largest FMI{col 67}= {res}    0.0393
{txt}{col 49}Complete DF{col 67}= {res}       109
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     99.38
{txt}{col 49}        avg{col 67}= {res}    106.16
{txt}{col 49}        max{col 67}= {res}    107.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  107.0{txt}){col 67}= {res}      8.01
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-65.77468{col 26}{space 2} 71.30482{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-207.1315{col 67}{space 3} 75.58218
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-53.89138{col 26}{space 2} 81.93871{col 37}{space 1}   -0.66{col 46}{space 3}0.512{col 54}{space 4} -216.326{col 67}{space 3} 108.5432
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.368479{col 26}{space 2} 4.027692{col 37}{space 1}   -0.34{col 46}{space 3}0.735{col 54}{space 4}-9.353067{col 67}{space 3} 6.616109
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-28.35708{col 26}{space 2} 70.87702{col 37}{space 1}   -0.40{col 46}{space 3}0.690{col 54}{space 4}-168.8627{col 67}{space 3} 112.1486
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0237825{col 26}{space 2} .0481839{col 37}{space 1}    0.49{col 46}{space 3}0.623{col 54}{space 4}-.0717389{col 67}{space 3} .1193039
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 2.335288{col 26}{space 2} 4.366467{col 37}{space 1}    0.53{col 46}{space 3}0.594{col 54}{space 4}-6.320837{col 67}{space 3} 10.99141
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 51.95714{col 26}{space 2} 84.53373{col 37}{space 1}    0.61{col 46}{space 3}0.540{col 54}{space 4}-115.7681{col 67}{space 3} 219.6824
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-18.81498{col 26}{space 2} 40.80678{col 37}{space 1}   -0.46{col 46}{space 3}0.646{col 54}{space 4} -99.7095{col 67}{space 3} 62.07953
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0018458{col 26}{space 2} .0002897{col 37}{space 1}    6.37{col 46}{space 3}0.000{col 54}{space 4} .0012715{col 67}{space 3} .0024202
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1322.831{col 26}{space 2} 457.5077{col 37}{space 1}    2.89{col 46}{space 3}0.005{col 54}{space 4} 415.8741{col 67}{space 3} 2229.787
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       119
{txt}{col 49}Average RVI{col 67}= {res}    0.0079
{txt}{col 49}Largest FMI{col 67}= {res}    0.0650
{txt}{col 49}Complete DF{col 67}= {res}       109
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     91.64
{txt}{col 49}        avg{col 67}= {res}    105.37
{txt}{col 49}        max{col 67}= {res}    107.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  107.0{txt}){col 67}= {res}     10.84
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-69.98175{col 26}{space 2} 72.46297{col 37}{space 1}   -0.97{col 46}{space 3}0.336{col 54}{space 4}-213.6341{col 67}{space 3} 73.67058
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-172.6985{col 26}{space 2} 83.27819{col 37}{space 1}   -2.07{col 46}{space 3}0.041{col 54}{space 4}-337.7884{col 67}{space 3}-7.608657
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.698971{col 26}{space 2} 4.095466{col 37}{space 1}    0.41{col 46}{space 3}0.679{col 54}{space 4}-6.420069{col 67}{space 3} 9.818011
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-3.211876{col 26}{space 2} 72.03591{col 37}{space 1}   -0.04{col 46}{space 3}0.965{col 54}{space 4}-146.0148{col 67}{space 3} 139.5911
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0640992{col 26}{space 2} .0489585{col 37}{space 1}    1.31{col 46}{space 3}0.193{col 54}{space 4}-.0329571{col 67}{space 3} .1611554
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 5.788114{col 26}{space 2} 4.440305{col 37}{space 1}    1.30{col 46}{space 3}0.195{col 54}{space 4}-3.014507{col 67}{space 3} 14.59073
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 40.45056{col 26}{space 2} 87.01603{col 37}{space 1}    0.46{col 46}{space 3}0.643{col 54}{space 4}-132.3799{col 67}{space 3}  213.281
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-30.24451{col 26}{space 2} 41.47382{col 37}{space 1}   -0.73{col 46}{space 3}0.467{col 54}{space 4}-112.4613{col 67}{space 3} 51.97228
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0024606{col 26}{space 2} .0002944{col 37}{space 1}    8.36{col 46}{space 3}0.000{col 54}{space 4}  .001877{col 67}{space 3} .0030443
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 636.1527{col 26}{space 2} 465.1671{col 37}{space 1}    1.37{col 46}{space 3}0.174{col 54}{space 4}-285.9957{col 67}{space 3} 1558.301
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       117
{txt}{col 49}Average RVI{col 67}= {res}    0.0025
{txt}{col 49}Largest FMI{col 67}= {res}    0.0090
{txt}{col 49}Complete DF{col 67}= {res}       107
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    103.98
{txt}{col 49}        avg{col 67}= {res}    104.82
{txt}{col 49}        max{col 67}= {res}    105.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  105.0{txt}){col 67}= {res}      1.56
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1368

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.657083{col 26}{space 2} .9639268{col 37}{space 1}    2.76{col 46}{space 3}0.007{col 54}{space 4} .7457385{col 67}{space 3} 4.568428
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0501591{col 26}{space 2} 1.052932{col 37}{space 1}    0.05{col 46}{space 3}0.962{col 54}{space 4}-2.037623{col 67}{space 3} 2.137941
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0267825{col 26}{space 2} .0538411{col 37}{space 1}   -0.50{col 46}{space 3}0.620{col 54}{space 4}-.1335391{col 67}{space 3} .0799741
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.820711{col 26}{space 2} .9140025{col 37}{space 1}    1.99{col 46}{space 3}0.049{col 54}{space 4} .0084093{col 67}{space 3} 3.633013
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0005051{col 26}{space 2}  .000619{col 37}{space 1}   -0.82{col 46}{space 3}0.416{col 54}{space 4}-.0017324{col 67}{space 3} .0007223
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0222677{col 26}{space 2} .0565021{col 37}{space 1}    0.39{col 46}{space 3}0.694{col 54}{space 4}-.0897652{col 67}{space 3} .1343006
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-1.017487{col 26}{space 2} 1.071573{col 37}{space 1}   -0.95{col 46}{space 3}0.345{col 54}{space 4}-3.142463{col 67}{space 3} 1.107489
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} .0503166{col 26}{space 2} .5307985{col 37}{space 1}    0.09{col 46}{space 3}0.925{col 54}{space 4}-1.002159{col 67}{space 3} 1.102792
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.48e-06{col 26}{space 2} 3.71e-06{col 37}{space 1}    0.40{col 46}{space 3}0.691{col 54}{space 4}-5.88e-06{col 67}{space 3} 8.84e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.823941{col 26}{space 2} 5.860016{col 37}{space 1}   -0.48{col 46}{space 3}0.631{col 54}{space 4} -14.4433{col 67}{space 3} 8.795416
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. ******************INTERACTION by Race***********************
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0041
{txt}{col 49}Largest FMI{col 67}= {res}    0.0427
{txt}{col 49}Complete DF{col 67}= {res}       188
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    165.71
{txt}{col 49}        avg{col 67}= {res}    184.25
{txt}{col 49}        max{col 67}= {res}    186.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  186.0{txt}){col 67}= {res}     13.69
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-48.64755{col 28}{space 2} 61.80221{col 39}{space 1}   -0.79{col 48}{space 3}0.432{col 56}{space 4} -170.571{col 69}{space 3} 73.27586
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-156.8686{col 28}{space 2} 170.8386{col 39}{space 1}   -0.92{col 48}{space 3}0.360{col 56}{space 4}-493.9001{col 69}{space 3} 180.1629
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 45.24384{col 28}{space 2} 84.56615{col 39}{space 1}    0.54{col 48}{space 3}0.593{col 56}{space 4}-121.5897{col 69}{space 3} 212.0774
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-43.29876{col 28}{space 2} 58.27456{col 39}{space 1}   -0.74{col 48}{space 3}0.458{col 56}{space 4}-158.2629{col 69}{space 3} 71.66537
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-4.576957{col 28}{space 2} 2.845275{col 39}{space 1}   -1.61{col 48}{space 3}0.109{col 56}{space 4}-10.19013{col 69}{space 3} 1.036216
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-92.57277{col 28}{space 2} 49.93564{col 39}{space 1}   -1.85{col 48}{space 3}0.065{col 56}{space 4}-191.0857{col 69}{space 3} 5.940183
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0097324{col 28}{space 2} .0359059{col 39}{space 1}    0.27{col 48}{space 3}0.787{col 56}{space 4}-.0611029{col 69}{space 3} .0805678
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}-.3349783{col 28}{space 2} 3.319264{col 39}{space 1}   -0.10{col 48}{space 3}0.920{col 56}{space 4}-6.883265{col 69}{space 3} 6.213309
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-24.58969{col 28}{space 2} 55.69981{col 39}{space 1}   -0.44{col 48}{space 3}0.659{col 56}{space 4}-134.5624{col 69}{space 3} 85.38307
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} -26.2041{col 28}{space 2} 28.61596{col 39}{space 1}   -0.92{col 48}{space 3}0.361{col 56}{space 4}-82.65769{col 69}{space 3} 30.24949
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0017648{col 28}{space 2} .0002161{col 39}{space 1}    8.17{col 48}{space 3}0.000{col 56}{space 4} .0013386{col 69}{space 3} .0021911
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1753.465{col 28}{space 2} 326.0792{col 39}{space 1}    5.38{col 48}{space 3}0.000{col 56}{space 4} 1110.173{col 69}{space 3} 2396.758
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       200
{txt}{col 49}Average RVI{col 67}= {res}    0.0061
{txt}{col 49}Largest FMI{col 67}= {res}    0.0629
{txt}{col 49}Complete DF{col 67}= {res}       188
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    150.65
{txt}{col 49}        avg{col 67}= {res}    182.95
{txt}{col 49}        max{col 67}= {res}    186.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  186.0{txt}){col 67}= {res}     16.80
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-42.25704{col 28}{space 2}  62.4035{col 39}{space 1}   -0.68{col 48}{space 3}0.499{col 56}{space 4}-165.3668{col 69}{space 3} 80.85271
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-162.3819{col 28}{space 2} 172.5124{col 39}{space 1}   -0.94{col 48}{space 3}0.348{col 56}{space 4}-502.7162{col 69}{space 3} 177.9524
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 45.28748{col 28}{space 2} 85.40826{col 39}{space 1}    0.53{col 48}{space 3}0.597{col 56}{space 4}-123.2081{col 69}{space 3} 213.7831
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-111.3459{col 28}{space 2} 58.84642{col 39}{space 1}   -1.89{col 48}{space 3}0.060{col 56}{space 4}-227.4384{col 69}{space 3} 4.746595
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2.720525{col 28}{space 2} 2.872763{col 39}{space 1}   -0.95{col 48}{space 3}0.345{col 56}{space 4}-8.387926{col 69}{space 3} 2.946877
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-74.67558{col 28}{space 2} 50.41835{col 39}{space 1}   -1.48{col 48}{space 3}0.140{col 56}{space 4}-174.1408{col 69}{space 3} 24.78967
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0384326{col 28}{space 2} .0362595{col 39}{space 1}    1.06{col 48}{space 3}0.291{col 56}{space 4}-.0331005{col 69}{space 3} .1099657
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .7237554{col 28}{space 2} 3.351797{col 39}{space 1}    0.22{col 48}{space 3}0.829{col 56}{space 4}-5.888727{col 69}{space 3} 7.336237
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-32.95051{col 28}{space 2}  56.8094{col 39}{space 1}   -0.58{col 48}{space 3}0.563{col 56}{space 4}-145.1966{col 69}{space 3} 79.29554
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-30.61871{col 28}{space 2} 28.89611{col 39}{space 1}   -1.06{col 48}{space 3}0.291{col 56}{space 4}-87.62507{col 69}{space 3} 26.38766
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021592{col 28}{space 2} .0002182{col 39}{space 1}    9.90{col 48}{space 3}0.000{col 56}{space 4} .0017289{col 69}{space 3} .0025896
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1418.804{col 28}{space 2} 329.2663{col 39}{space 1}    4.31{col 48}{space 3}0.000{col 56}{space 4} 769.2231{col 69}{space 3} 2068.385
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       197
{txt}{col 49}Average RVI{col 67}= {res}    0.0004
{txt}{col 49}Largest FMI{col 67}= {res}    0.0044
{txt}{col 49}Complete DF{col 67}= {res}       185
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    182.11
{txt}{col 49}        avg{col 67}= {res}    182.95
{txt}{col 49}        max{col 67}= {res}    183.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  183.0{txt}){col 67}= {res}      2.12
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0207

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 2.070982{col 28}{space 2}  .780222{col 39}{space 1}    2.65{col 48}{space 3}0.009{col 56}{space 4} .5315961{col 69}{space 3} 3.610367
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.391277{col 28}{space 2} 2.095068{col 39}{space 1}    0.66{col 48}{space 3}0.507{col 56}{space 4}-2.742314{col 69}{space 3} 5.524868
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.1335466{col 28}{space 2} 1.040807{col 39}{space 1}   -0.13{col 48}{space 3}0.898{col 56}{space 4}-2.187071{col 69}{space 3} 1.919978
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}  .510148{col 28}{space 2} .7117305{col 39}{space 1}    0.72{col 48}{space 3}0.474{col 56}{space 4}-.8941033{col 69}{space 3} 1.914399
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0107698{col 28}{space 2} .0355435{col 39}{space 1}    0.30{col 48}{space 3}0.762{col 56}{space 4}-.0593578{col 69}{space 3} .0808975
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .7623311{col 28}{space 2}  .610967{col 39}{space 1}    1.25{col 48}{space 3}0.214{col 56}{space 4}-.4431128{col 69}{space 3} 1.967775
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0004687{col 28}{space 2}  .000436{col 39}{space 1}   -1.07{col 48}{space 3}0.284{col 56}{space 4}-.0013289{col 69}{space 3} .0003916
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0443721{col 28}{space 2} .0405496{col 39}{space 1}    1.09{col 48}{space 3}0.275{col 56}{space 4}-.0356327{col 69}{space 3} .1243769
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-.0525179{col 28}{space 2} .6658194{col 39}{space 1}   -0.08{col 48}{space 3}0.937{col 56}{space 4} -1.36623{col 69}{space 3} 1.261195
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-.2379911{col 28}{space 2} .3502468{col 39}{space 1}   -0.68{col 48}{space 3}0.498{col 56}{space 4}-.9290313{col 69}{space 3} .4530492
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 1.97e-06{col 28}{space 2} 2.63e-06{col 39}{space 1}    0.75{col 48}{space 3}0.455{col 56}{space 4}-3.22e-06{col 69}{space 3} 7.15e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-3.637088{col 28}{space 2} 3.957832{col 39}{space 1}   -0.92{col 48}{space 3}0.359{col 56}{space 4}-11.44593{col 69}{space 3} 4.171757
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ////////////////////////////////////////TABLE S5. LnNFLw3 exposure/////////////////////////////////////////////
> 
. 
. 
. 
. ***********************LnNFLw3, MODELS 1 AND 2*********************
. 
. 
. *********************AFRICAN-AMERICAN*******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. //ANALYSIS B//
. reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        90
{txt}{hline 13}{c +}{hline 34}   F(6, 83)        = {res}    11.23
{txt}       Model {c |} {res} 5004386.06         6  834064.343   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 6162497.51        83  74246.9579   {txt}R-squared       ={res}    0.4481
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4083
{txt}       Total {c |} {res} 11166883.6        89  125470.602   {txt}Root MSE        =   {res} 272.48

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-77.83375{col 26}{space 2} 51.05542{col 37}{space 1}   -1.52{col 46}{space 3}0.131{col 67}{space 3}-.1486809
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 23.78611{col 26}{space 2} 79.23054{col 37}{space 1}    0.30{col 46}{space 3}0.765{col 67}{space 3} .0334621
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.283734{col 26}{space 2} 3.733138{col 37}{space 1}   -1.68{col 46}{space 3}0.096{col 67}{space 3}-.1760947
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-166.5409{col 26}{space 2} 70.02901{col 37}{space 1}   -2.38{col 46}{space 3}0.020{col 67}{space 3}-.2326336
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}   .00213{col 26}{space 2} .0515212{col 37}{space 1}    0.04{col 46}{space 3}0.967{col 67}{space 3} .0037556
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0016211{col 26}{space 2} .0003258{col 37}{space 1}    4.98{col 46}{space 3}0.000{col 67}{space 3}  .552379
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1993.452{col 26}{space 2} 420.9212{col 37}{space 1}    4.74{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        90
{txt}{hline 13}{c +}{hline 34}   F(6, 83)        = {res}    11.98
{txt}       Model {c |} {res}  5358493.5         6  893082.251   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 6184885.53        83  74516.6931   {txt}R-squared       ={res}    0.4642
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4255
{txt}       Total {c |} {res}   11543379        89  129700.888   {txt}Root MSE        =   {res} 272.98

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-51.15552{col 26}{space 2} 51.14807{col 37}{space 1}   -1.00{col 46}{space 3}0.320{col 67}{space 3}-.0961123
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-7.175124{col 26}{space 2} 79.37433{col 37}{space 1}   -0.09{col 46}{space 3}0.928{col 67}{space 3}-.0099279
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.847864{col 26}{space 2} 3.739913{col 37}{space 1}   -1.83{col 46}{space 3}0.071{col 67}{space 3}-.1887484
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} -157.201{col 26}{space 2}  70.1561{col 37}{space 1}   -2.24{col 46}{space 3}0.028{col 67}{space 3}-.2159764
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0137028{col 26}{space 2} .0516147{col 37}{space 1}    0.27{col 46}{space 3}0.791{col 67}{space 3} .0237627
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0018456{col 26}{space 2} .0003264{col 37}{space 1}    5.65{col 46}{space 3}0.000{col 67}{space 3} .6185251
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1952.534{col 26}{space 2} 421.6851{col 37}{space 1}    4.63{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if Race==2,beta 
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        88
{txt}{hline 13}{c +}{hline 34}   F(6, 81)        = {res}     1.37
{txt}       Model {c |} {res} 125.029628         6  20.8382714   {txt}Prob > F        ={res}    0.2362
{txt}    Residual {c |} {res} 1230.90659        81  15.1963777   {txt}R-squared       ={res}    0.0922
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0250
{txt}       Total {c |} {res} 1355.93622        87  15.5854738   {txt}Root MSE        =   {res} 3.8983

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .1634156{col 26}{space 2} .7404861{col 37}{space 1}    0.22{col 46}{space 3}0.826{col 67}{space 3} .0276807
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0910418{col 26}{space 2} 1.150313{col 37}{space 1}    0.08{col 46}{space 3}0.937{col 67}{space 3} .0114883
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0786772{col 26}{space 2} .0537296{col 37}{space 1}    1.46{col 46}{space 3}0.147{col 67}{space 3} .1966781
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-1.151197{col 26}{space 2}  1.01205{col 37}{space 1}   -1.14{col 46}{space 3}0.259{col 67}{space 3}-.1447687
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0001397{col 26}{space 2} .0007394{col 37}{space 1}   -0.19{col 46}{space 3}0.851{col 67}{space 3}-.0222658
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.20e-06{col 26}{space 2} 4.69e-06{col 37}{space 1}    0.25{col 46}{space 3}0.799{col 67}{space 3} .0367661
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.054261{col 26}{space 2} 6.041545{col 37}{space 1}    0.34{col 46}{space 3}0.735{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.0846
{txt}{col 49}Largest FMI{col 67}= {res}    0.4460
{txt}{col 49}Complete DF{col 67}= {res}        82
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     16.60
{txt}{col 49}        avg{col 67}= {res}     70.67
{txt}{col 49}        max{col 67}= {res}     79.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   77.2{txt}){col 67}= {res}      8.91
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-86.58057{col 26}{space 2} 52.00977{col 37}{space 1}   -1.66{col 46}{space 3}0.100{col 54}{space 4}-190.1157{col 67}{space 3} 16.95458
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 11.43773{col 26}{space 2} 80.35522{col 37}{space 1}    0.14{col 46}{space 3}0.887{col 54}{space 4}-148.5098{col 67}{space 3} 171.3853
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-5.572734{col 26}{space 2} 3.817641{col 37}{space 1}   -1.46{col 46}{space 3}0.148{col 54}{space 4}-13.17324{col 67}{space 3} 2.027771
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-168.1413{col 26}{space 2} 69.84283{col 37}{space 1}   -2.41{col 46}{space 3}0.018{col 54}{space 4}-307.1336{col 67}{space 3}-29.14901
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0049888{col 26}{space 2} .0515175{col 37}{space 1}    0.10{col 46}{space 3}0.923{col 54}{space 4}-.0975404{col 67}{space 3} .1075179
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-4.935434{col 26}{space 2} 5.946197{col 37}{space 1}   -0.83{col 46}{space 3}0.418{col 54}{space 4}-17.50406{col 67}{space 3} 7.633194
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0016516{col 26}{space 2} .0003275{col 37}{space 1}    5.04{col 46}{space 3}0.000{col 54}{space 4} .0009999{col 67}{space 3} .0023033
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2098.813{col 26}{space 2} 438.3978{col 37}{space 1}    4.79{col 46}{space 3}0.000{col 54}{space 4} 1225.302{col 67}{space 3} 2972.324
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.1039
{txt}{col 49}Largest FMI{col 67}= {res}    0.5021
{txt}{col 49}Complete DF{col 67}= {res}        82
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     13.74
{txt}{col 49}        avg{col 67}= {res}     69.90
{txt}{col 49}        max{col 67}= {res}     79.95
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   76.0{txt}){col 67}= {res}      9.37
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-60.73518{col 26}{space 2} 52.09126{col 37}{space 1}   -1.17{col 46}{space 3}0.247{col 54}{space 4}-164.4419{col 67}{space 3} 42.97157
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-20.64857{col 26}{space 2} 80.42103{col 37}{space 1}   -0.26{col 46}{space 3}0.798{col 54}{space 4}-180.7345{col 67}{space 3} 139.4373
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -6.06781{col 26}{space 2} 3.825795{col 37}{space 1}   -1.59{col 46}{space 3}0.117{col 54}{space 4}-13.68556{col 67}{space 3} 1.549941
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-158.9861{col 26}{space 2} 69.84154{col 37}{space 1}   -2.28{col 46}{space 3}0.025{col 54}{space 4}-297.9765{col 67}{space 3}-19.99571
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0167922{col 26}{space 2} .0515247{col 37}{space 1}    0.33{col 46}{space 3}0.745{col 54}{space 4}-.0857525{col 67}{space 3} .1193369
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-5.411766{col 26}{space 2}  6.20996{col 37}{space 1}   -0.87{col 46}{space 3}0.398{col 54}{space 4}-18.75426{col 67}{space 3} 7.930725
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0018791{col 26}{space 2} .0003275{col 37}{space 1}    5.74{col 46}{space 3}0.000{col 54}{space 4} .0012273{col 67}{space 3} .0025309
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2067.889{col 26}{space 2} 440.4773{col 37}{space 1}    4.69{col 46}{space 3}0.000{col 54}{space 4} 1189.856{col 67}{space 3} 2945.923
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        88
{txt}{col 49}Average RVI{col 67}= {res}    0.1238
{txt}{col 49}Largest FMI{col 67}= {res}    0.5549
{txt}{col 49}Complete DF{col 67}= {res}        80
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     11.50
{txt}{col 49}        avg{col 67}= {res}     67.73
{txt}{col 49}        max{col 67}= {res}     78.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   72.9{txt}){col 67}= {res}      1.02
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.4236

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .1912383{col 26}{space 2} .7636213{col 37}{space 1}    0.25{col 46}{space 3}0.803{col 54}{space 4}  -1.3301{col 67}{space 3} 1.712576
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .1225369{col 26}{space 2} 1.176348{col 37}{space 1}    0.10{col 46}{space 3}0.917{col 54}{space 4} -2.22035{col 67}{space 3} 2.465424
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0765204{col 26}{space 2}  .055493{col 37}{space 1}    1.38{col 46}{space 3}0.172{col 54}{space 4}-.0340398{col 67}{space 3} .1870806
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-1.126926{col 26}{space 2} 1.014976{col 37}{space 1}   -1.11{col 46}{space 3}0.270{col 54}{space 4}-3.147589{col 67}{space 3} .8937362
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0001528{col 26}{space 2} .0007426{col 37}{space 1}   -0.21{col 46}{space 3}0.838{col 54}{space 4}-.0016313{col 67}{space 3} .0013257
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0163555{col 26}{space 2} .0938308{col 37}{space 1}    0.17{col 46}{space 3}0.865{col 54}{space 4}-.1890726{col 67}{space 3} .2217836
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.16e-06{col 26}{space 2} 4.77e-06{col 37}{space 1}    0.24{col 46}{space 3}0.809{col 54}{space 4}-8.34e-06{col 67}{space 3} .0000107
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.62403{col 26}{space 2} 6.323829{col 37}{space 1}    0.26{col 46}{space 3}0.798{col 54}{space 4} -10.9805{col 67}{space 3} 14.22856
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. *********************WHITE******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. //ANALYSIS B//
. reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       123
{txt}{hline 13}{c +}{hline 34}   F(6, 116)       = {res}    15.16
{txt}       Model {c |} {res} 8641805.44         6  1440300.91   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 11021049.2       116  95009.0446   {txt}R-squared       ={res}    0.4395
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4105
{txt}       Total {c |} {res} 19662854.6       122  161170.939   {txt}Root MSE        =   {res} 308.24

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-161.5124{col 26}{space 2}  61.0588{col 37}{space 1}   -2.65{col 46}{space 3}0.009{col 67}{space 3}-.2044254
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-86.50687{col 26}{space 2} 75.26462{col 37}{space 1}   -1.15{col 46}{space 3}0.253{col 67}{space 3}-.1077472
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.896913{col 26}{space 2} 3.733302{col 37}{space 1}   -0.51{col 46}{space 3}0.612{col 67}{space 3}-.0389929
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-40.79105{col 26}{space 2} 67.70386{col 37}{space 1}   -0.60{col 46}{space 3}0.548{col 67}{space 3}-.0442959
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0041602{col 26}{space 2} .0425112{col 37}{space 1}   -0.10{col 46}{space 3}0.922{col 67}{space 3}-.0070506
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019432{col 26}{space 2} .0002616{col 37}{space 1}    7.43{col 46}{space 3}0.000{col 67}{space 3} .7091219
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1607.868{col 26}{space 2} 378.9366{col 37}{space 1}    4.24{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       123
{txt}{hline 13}{c +}{hline 34}   F(6, 116)       = {res}    17.84
{txt}       Model {c |} {res} 11278161.9         6  1879693.65   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 12219770.7       116  105342.851   {txt}R-squared       ={res}    0.4800
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4531
{txt}       Total {c |} {res} 23497932.6       122  192606.005   {txt}Root MSE        =   {res} 324.57

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-108.5629{col 26}{space 2} 64.29368{col 37}{space 1}   -1.69{col 46}{space 3}0.094{col 67}{space 3}-.1256952
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-153.4434{col 26}{space 2} 79.25213{col 37}{space 1}   -1.94{col 46}{space 3}0.055{col 67}{space 3}-.1748285
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -.511575{col 26}{space 2} 3.931091{col 37}{space 1}   -0.13{col 46}{space 3}0.897{col 67}{space 3}-.0096196
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-6.402222{col 26}{space 2}  71.2908{col 37}{space 1}   -0.09{col 46}{space 3}0.929{col 67}{space 3}-.0063597
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}  .020352{col 26}{space 2} .0447634{col 37}{space 1}    0.45{col 46}{space 3}0.650{col 67}{space 3} .0315525
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}  .002407{col 26}{space 2} .0002755{col 37}{space 1}    8.74{col 46}{space 3}0.000{col 67}{space 3} .8035284
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1089.432{col 26}{space 2} 399.0126{col 37}{space 1}    2.73{col 46}{space 3}0.007{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if Race==1,beta 
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       121
{txt}{hline 13}{c +}{hline 34}   F(6, 114)       = {res}     0.92
{txt}       Model {c |} {res} 88.4831307         6  14.7471885   {txt}Prob > F        ={res}    0.4843
{txt}    Residual {c |} {res} 1829.86851       114  16.0514782   {txt}R-squared       ={res}    0.0461
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0041
{txt}       Total {c |} {res} 1918.35164       120  15.9862637   {txt}Root MSE        =   {res} 4.0064

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .5412249{col 26}{space 2} .8207356{col 37}{space 1}    0.66{col 46}{space 3}0.511{col 67}{space 3} .0674691
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.0393996{col 26}{space 2} .9812657{col 37}{space 1}   -0.04{col 46}{space 3}0.968{col 67}{space 3}-.0049271
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0606084{col 26}{space 2} .0500271{col 37}{space 1}    1.21{col 46}{space 3}0.228{col 67}{space 3} .1236754
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 1.321153{col 26}{space 2} .8944038{col 37}{space 1}    1.48{col 46}{space 3}0.142{col 67}{space 3} .1432774
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0001475{col 26}{space 2}  .000553{col 37}{space 1}   -0.27{col 46}{space 3}0.790{col 67}{space 3}-.0253116
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.78e-06{col 26}{space 2} 3.40e-06{col 37}{space 1}    0.82{col 46}{space 3}0.416{col 67}{space 3} .1021093
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.750709{col 26}{space 2} 4.953759{col 37}{space 1}   -0.76{col 46}{space 3}0.451{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0007
{txt}{col 49}Complete DF{col 67}= {res}       115
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    113.01
{txt}{col 49}        avg{col 67}= {res}    113.04
{txt}{col 49}        max{col 67}= {res}    113.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}  113.1{txt}){col 67}= {res}     13.09
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-152.3608{col 26}{space 2} 61.94445{col 37}{space 1}   -2.46{col 46}{space 3}0.015{col 54}{space 4}-275.0833{col 67}{space 3}-29.63826
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-76.03321{col 26}{space 2} 76.21644{col 37}{space 1}   -1.00{col 46}{space 3}0.321{col 54}{space 4}-227.0311{col 67}{space 3} 74.96464
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.798897{col 26}{space 2} 3.737884{col 37}{space 1}   -0.48{col 46}{space 3}0.631{col 54}{space 4}-9.204284{col 67}{space 3}  5.60649
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-36.18377{col 26}{space 2} 67.95196{col 37}{space 1}   -0.53{col 46}{space 3}0.595{col 54}{space 4}-170.8082{col 67}{space 3} 98.44068
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0004829{col 26}{space 2} .0427457{col 37}{space 1}   -0.01{col 46}{space 3}0.991{col 54}{space 4}-.0851696{col 67}{space 3} .0842038
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 3.982676{col 26}{space 2} 4.415444{col 37}{space 1}    0.90{col 46}{space 3}0.369{col 54}{space 4}-4.765106{col 67}{space 3} 12.73046
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019334{col 26}{space 2}  .000262{col 37}{space 1}    7.38{col 46}{space 3}0.000{col 54}{space 4} .0014143{col 67}{space 3} .0024526
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1451.613{col 26}{space 2}  416.939{col 37}{space 1}    3.48{col 46}{space 3}0.001{col 54}{space 4} 625.5849{col 67}{space 3} 2277.641
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0009
{txt}{col 49}Largest FMI{col 67}= {res}    0.0073
{txt}{col 49}Complete DF{col 67}= {res}       115
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    112.13
{txt}{col 49}        avg{col 67}= {res}    112.90
{txt}{col 49}        max{col 67}= {res}    113.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}  113.0{txt}){col 67}= {res}     15.60
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-94.92075{col 26}{space 2} 64.99613{col 37}{space 1}   -1.46{col 46}{space 3}0.147{col 54}{space 4}-223.6893{col 67}{space 3} 33.84782
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  -137.81{col 26}{space 2} 79.97902{col 37}{space 1}   -1.72{col 46}{space 3}0.088{col 54}{space 4}-296.2628{col 67}{space 3} 20.64266
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.3656274{col 26}{space 2} 3.921824{col 37}{space 1}   -0.09{col 46}{space 3}0.926{col 54}{space 4} -8.13543{col 67}{space 3} 7.404175
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} .4532121{col 26}{space 2} 71.29544{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-140.7952{col 67}{space 3} 141.7017
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0258572{col 26}{space 2} .0448591{col 37}{space 1}    0.58{col 46}{space 3}0.565{col 54}{space 4}-.0630169{col 67}{space 3} .1147313
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 5.939542{col 26}{space 2} 4.647767{col 37}{space 1}    1.28{col 46}{space 3}0.204{col 54}{space 4}-3.269293{col 67}{space 3} 15.14838
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0023925{col 26}{space 2} .0002749{col 37}{space 1}    8.70{col 46}{space 3}0.000{col 54}{space 4} .0018478{col 67}{space 3} .0029372
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 856.3637{col 26}{space 2} 437.7418{col 37}{space 1}    1.96{col 46}{space 3}0.053{col 54}{space 4}-10.89128{col 67}{space 3} 1723.619
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       121
{txt}{col 49}Average RVI{col 67}= {res}    0.0001
{txt}{col 49}Largest FMI{col 67}= {res}    0.0013
{txt}{col 49}Complete DF{col 67}= {res}       113
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    110.94
{txt}{col 49}        avg{col 67}= {res}    111.03
{txt}{col 49}        max{col 67}= {res}    111.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}  111.1{txt}){col 67}= {res}      0.81
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.5835

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .5882311{col 26}{space 2} .8313572{col 37}{space 1}    0.71{col 46}{space 3}0.481{col 54}{space 4}-1.059151{col 67}{space 3} 2.235613
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0246735{col 26}{space 2} .9967414{col 37}{space 1}    0.02{col 46}{space 3}0.980{col 54}{space 4}-1.950426{col 67}{space 3} 1.999773
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0612427{col 26}{space 2} .0502319{col 37}{space 1}    1.22{col 46}{space 3}0.225{col 54}{space 4}-.0382947{col 67}{space 3} .1607801
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.344475{col 26}{space 2} .8993881{col 37}{space 1}    1.49{col 46}{space 3}0.138{col 54}{space 4} -.437714{col 67}{space 3} 3.126664
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0001243{col 26}{space 2} .0005579{col 37}{space 1}   -0.22{col 46}{space 3}0.824{col 54}{space 4}-.0012298{col 67}{space 3} .0009811
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0242082{col 26}{space 2} .0579379{col 37}{space 1}    0.42{col 46}{space 3}0.677{col 54}{space 4}-.0906004{col 67}{space 3} .1390167
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.72e-06{col 26}{space 2} 3.42e-06{col 37}{space 1}    0.80{col 46}{space 3}0.427{col 54}{space 4}-4.05e-06{col 67}{space 3} 9.49e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.684969{col 26}{space 2} 5.451645{col 37}{space 1}   -0.86{col 46}{space 3}0.392{col 54}{space 4}-15.48773{col 67}{space 3} 6.117792
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //INTERACTION by Race//
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0238
{txt}{col 49}Largest FMI{col 67}= {res}    0.1903
{txt}{col 49}Complete DF{col 67}= {res}       203
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     72.42
{txt}{col 49}        avg{col 67}= {res}    186.82
{txt}{col 49}        max{col 67}= {res}    200.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  200.1{txt}){col 67}= {res}     19.73
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-151.4473{col 28}{space 2} 56.47005{col 39}{space 1}   -2.68{col 48}{space 3}0.008{col 56}{space 4}-262.8022{col 69}{space 3}-40.09239
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} -202.503{col 28}{space 2} 161.7165{col 39}{space 1}   -1.25{col 48}{space 3}0.212{col 56}{space 4}-521.3827{col 69}{space 3} 116.3767
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 64.63203{col 28}{space 2} 70.65579{col 39}{space 1}    0.91{col 48}{space 3}0.361{col 56}{space 4} -74.6906{col 69}{space 3} 203.9547
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-32.25662{col 28}{space 2} 55.13015{col 39}{space 1}   -0.59{col 48}{space 3}0.559{col 56}{space 4}-140.9683{col 69}{space 3} 76.45506
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-3.598899{col 28}{space 2} 2.628181{col 39}{space 1}   -1.37{col 48}{space 3}0.172{col 56}{space 4}-8.781269{col 69}{space 3} 1.583471
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}  -98.133{col 28}{space 2} 47.69902{col 39}{space 1}   -2.06{col 48}{space 3}0.041{col 56}{space 4}-192.1879{col 69}{space 3} -4.07814
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0066589{col 28}{space 2} .0323769{col 39}{space 1}   -0.21{col 48}{space 3}0.837{col 56}{space 4}-.0705008{col 69}{space 3}  .057183
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}-.1049891{col 28}{space 2} 3.501388{col 39}{space 1}   -0.03{col 48}{space 3}0.976{col 56}{space 4}-7.084194{col 69}{space 3} 6.874215
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0017777{col 28}{space 2} .0002003{col 39}{space 1}    8.87{col 48}{space 3}0.000{col 56}{space 4} .0013826{col 69}{space 3} .0021727
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1897.544{col 28}{space 2} 312.1337{col 39}{space 1}    6.08{col 48}{space 3}0.000{col 56}{space 4} 1281.879{col 69}{space 3} 2513.208
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0255
{txt}{col 49}Largest FMI{col 67}= {res}    0.2019
{txt}{col 49}Complete DF{col 67}= {res}       203
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     67.47
{txt}{col 49}        avg{col 67}= {res}    186.24
{txt}{col 49}        max{col 67}= {res}    200.97
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  200.0{txt}){col 67}= {res}     22.41
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} -88.3631{col 28}{space 2} 58.75117{col 39}{space 1}   -1.50{col 48}{space 3}0.134{col 56}{space 4}-204.2167{col 69}{space 3} 27.49052
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-111.3803{col 28}{space 2}  168.206{col 39}{space 1}   -0.66{col 48}{space 3}0.509{col 56}{space 4}-443.0561{col 69}{space 3} 220.2954
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 24.85043{col 28}{space 2} 73.49349{col 39}{space 1}    0.34{col 48}{space 3}0.736{col 56}{space 4}-120.0677{col 69}{space 3} 169.7686
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-81.98062{col 28}{space 2} 57.35505{col 39}{space 1}   -1.43{col 48}{space 3}0.154{col 56}{space 4}  -195.08{col 69}{space 3} 31.11876
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-3.152741{col 28}{space 2}   2.7338{col 39}{space 1}   -1.15{col 48}{space 3}0.250{col 56}{space 4}-8.543376{col 69}{space 3} 2.237895
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-77.13457{col 28}{space 2} 49.61286{col 39}{space 1}   -1.55{col 48}{space 3}0.122{col 56}{space 4}-174.9632{col 69}{space 3} 20.69403
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0130215{col 28}{space 2} .0336776{col 39}{space 1}    0.39{col 48}{space 3}0.699{col 56}{space 4}-.0533852{col 69}{space 3} .0794282
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .5770315{col 28}{space 2} 3.664996{col 39}{space 1}    0.16{col 48}{space 3}0.875{col 56}{space 4}-6.737393{col 69}{space 3} 7.891456
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021497{col 28}{space 2} .0002084{col 39}{space 1}   10.31{col 48}{space 3}0.000{col 56}{space 4} .0017387{col 69}{space 3} .0025606
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1509.882{col 28}{space 2} 324.7975{col 39}{space 1}    4.65{col 48}{space 3}0.000{col 56}{space 4} 869.2287{col 69}{space 3} 2150.535
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       209
{txt}{col 49}Average RVI{col 67}= {res}    0.0489
{txt}{col 49}Largest FMI{col 67}= {res}    0.3374
{txt}{col 49}Complete DF{col 67}= {res}       199
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     32.72
{txt}{col 49}        avg{col 67}= {res}    177.24
{txt}{col 49}        max{col 67}= {res}    196.90
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  193.8{txt}){col 67}= {res}      0.99
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.4503

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} .4625488{col 28}{space 2} .7846582{col 39}{space 1}    0.59{col 48}{space 3}0.556{col 56}{space 4} -1.08499{col 69}{space 3} 2.010088
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} .9659175{col 28}{space 2} 2.225513{col 39}{space 1}    0.43{col 48}{space 3}0.665{col 56}{space 4}-3.422994{col 69}{space 3} 5.354829
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.1667832{col 28}{space 2} .9784023{col 39}{space 1}   -0.17{col 48}{space 3}0.865{col 56}{space 4}-2.096288{col 69}{space 3} 1.762722
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .1794058{col 28}{space 2} .7520854{col 39}{space 1}    0.24{col 48}{space 3}0.812{col 56}{space 4}-1.303896{col 69}{space 3} 1.662708
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0759393{col 28}{space 2} .0362378{col 39}{space 1}    2.10{col 48}{space 3}0.037{col 56}{space 4} .0044747{col 69}{space 3} .1474039
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .1385836{col 28}{space 2} .6539186{col 39}{space 1}    0.21{col 48}{space 3}0.832{col 56}{space 4}-1.151001{col 69}{space 3} 1.428168
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0001753{col 28}{space 2} .0004384{col 39}{space 1}   -0.40{col 48}{space 3}0.690{col 56}{space 4}-.0010398{col 69}{space 3} .0006892
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0197112{col 28}{space 2} .0517548{col 39}{space 1}    0.38{col 48}{space 3}0.706{col 56}{space 4}-.0856186{col 69}{space 3} .1250411
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 1.37e-06{col 28}{space 2} 2.71e-06{col 39}{space 1}    0.51{col 48}{space 3}0.613{col 56}{space 4}-3.98e-06{col 69}{space 3} 6.73e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-1.746124{col 28}{space 2} 4.277024{col 39}{space 1}   -0.41{col 48}{space 3}0.684{col 56}{space 4}-10.18884{col 69}{space 3} 6.696589
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. *********************LnNFLw3, MODELS 3-6***************************
. 
. ***********MODEL 3: MODEL 2+w1dxDiabetes w1Glucose******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.1524
{txt}{col 49}Largest FMI{col 67}= {res}    0.5001
{txt}{col 49}Complete DF{col 67}= {res}        80
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     13.73
{txt}{col 49}        avg{col 67}= {res}     58.71
{txt}{col 49}        max{col 67}= {res}     77.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   73.0{txt}){col 67}= {res}      7.96
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-111.9152{col 26}{space 2}  50.9332{col 37}{space 1}   -2.20{col 46}{space 3}0.031{col 54}{space 4}-213.3351{col 67}{space 3}-10.49531
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 31.94398{col 26}{space 2} 80.86162{col 37}{space 1}    0.40{col 46}{space 3}0.694{col 54}{space 4}-129.6578{col 67}{space 3} 193.5457
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-3.155386{col 26}{space 2} 3.875517{col 37}{space 1}   -0.81{col 46}{space 3}0.418{col 54}{space 4} -10.8802{col 67}{space 3} 4.569427
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-144.3797{col 26}{space 2} 68.82767{col 37}{space 1}   -2.10{col 46}{space 3}0.039{col 54}{space 4}-281.5405{col 67}{space 3}  -7.2189
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0076999{col 26}{space 2} .0497722{col 37}{space 1}   -0.15{col 46}{space 3}0.877{col 54}{space 4}-.1068079{col 67}{space 3} .0914082
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-6.648015{col 26}{space 2}  6.00803{col 37}{space 1}   -1.11{col 46}{space 3}0.288{col 54}{space 4}-19.55781{col 67}{space 3}  6.26178
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-53.16479{col 26}{space 2} 60.82632{col 37}{space 1}   -0.87{col 46}{space 3}0.391{col 54}{space 4}-178.7013{col 67}{space 3} 72.37168
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 3.359267{col 26}{space 2} 1.311113{col 37}{space 1}    2.56{col 46}{space 3}0.014{col 54}{space 4} .7090929{col 67}{space 3} 6.009441
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0015087{col 26}{space 2} .0003243{col 37}{space 1}    4.65{col 46}{space 3}0.000{col 54}{space 4} .0008624{col 67}{space 3} .0021549
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1928.408{col 26}{space 2} 423.8287{col 37}{space 1}    4.55{col 46}{space 3}0.000{col 54}{space 4} 1083.703{col 67}{space 3} 2773.113
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.2158
{txt}{col 49}Largest FMI{col 67}= {res}    0.5417
{txt}{col 49}Complete DF{col 67}= {res}        80
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     12.00
{txt}{col 49}        avg{col 67}= {res}     54.40
{txt}{col 49}        max{col 67}= {res}     75.75
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   69.7{txt}){col 67}= {res}      8.73
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} -85.7926{col 26}{space 2} 49.97602{col 37}{space 1}   -1.72{col 46}{space 3}0.090{col 54}{space 4}-185.3338{col 67}{space 3} 13.74862
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-2.088249{col 26}{space 2} 79.24424{col 37}{space 1}   -0.03{col 46}{space 3}0.979{col 54}{space 4}-160.5462{col 67}{space 3} 156.3698
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-3.760337{col 26}{space 2} 3.881799{col 37}{space 1}   -0.97{col 46}{space 3}0.336{col 54}{space 4}-11.51962{col 67}{space 3} 3.998946
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-133.2847{col 26}{space 2} 67.62835{col 37}{space 1}   -1.97{col 46}{space 3}0.053{col 54}{space 4} -268.131{col 67}{space 3}  1.56163
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0028982{col 26}{space 2} .0489457{col 37}{space 1}    0.06{col 46}{space 3}0.953{col 54}{space 4}-.0946039{col 67}{space 3} .1004003
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-7.478681{col 26}{space 2} 6.074917{col 37}{space 1}   -1.23{col 46}{space 3}0.242{col 54}{space 4}-20.71511{col 67}{space 3} 5.757745
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-31.56282{col 26}{space 2} 65.37209{col 37}{space 1}   -0.48{col 46}{space 3}0.636{col 54}{space 4}-171.1039{col 67}{space 3} 107.9783
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 3.657906{col 26}{space 2} 1.346355{col 37}{space 1}    2.72{col 46}{space 3}0.011{col 54}{space 4} .8995478{col 67}{space 3} 6.416263
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0017364{col 26}{space 2} .0003167{col 37}{space 1}    5.48{col 46}{space 3}0.000{col 54}{space 4} .0011053{col 67}{space 3} .0023674
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1876.253{col 26}{space 2} 416.2984{col 37}{space 1}    4.51{col 46}{space 3}0.000{col 54}{space 4}   1046.1{col 67}{space 3} 2706.406
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        88
{txt}{col 49}Average RVI{col 67}= {res}    0.1398
{txt}{col 49}Largest FMI{col 67}= {res}    0.5095
{txt}{col 49}Complete DF{col 67}= {res}        78
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     13.21
{txt}{col 49}        avg{col 67}= {res}     58.05
{txt}{col 49}        max{col 67}= {res}     75.79
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   71.7{txt}){col 67}= {res}      0.81
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.6112

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}  .081054{col 26}{space 2} .8088437{col 37}{space 1}    0.10{col 46}{space 3}0.920{col 54}{space 4}-1.534759{col 67}{space 3} 1.696867
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .2211166{col 26}{space 2}  1.18717{col 37}{space 1}    0.19{col 46}{space 3}0.853{col 54}{space 4}-2.143444{col 67}{space 3} 2.585677
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0872831{col 26}{space 2} .0609015{col 37}{space 1}    1.43{col 46}{space 3}0.157{col 54}{space 4}-.0346609{col 67}{space 3} .2092271
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-1.049784{col 26}{space 2} 1.034596{col 37}{space 1}   -1.01{col 46}{space 3}0.314{col 54}{space 4}-3.110663{col 67}{space 3} 1.011095
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0001879{col 26}{space 2} .0007522{col 37}{space 1}   -0.25{col 46}{space 3}0.803{col 54}{space 4}-.0016861{col 67}{space 3} .0013103
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0146452{col 26}{space 2} .0920319{col 37}{space 1}    0.16{col 46}{space 3}0.876{col 54}{space 4}-.1838496{col 67}{space 3} .2131401
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-.4665552{col 26}{space 2} .9068798{col 37}{space 1}   -0.51{col 46}{space 3}0.611{col 54}{space 4}-2.327126{col 67}{space 3} 1.394015
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} .0093166{col 26}{space 2} .0198867{col 37}{space 1}    0.47{col 46}{space 3}0.642{col 54}{space 4}-.0307982{col 67}{space 3} .0494315
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 6.42e-07{col 26}{space 2} 4.86e-06{col 37}{space 1}    0.13{col 46}{space 3}0.895{col 54}{space 4}-9.04e-06{col 67}{space 3} .0000103
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.181193{col 26}{space 2} 6.372724{col 37}{space 1}    0.19{col 46}{space 3}0.853{col 54}{space 4}-11.51774{col 67}{space 3} 13.88013
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITE//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0025
{txt}{col 49}Largest FMI{col 67}= {res}    0.0168
{txt}{col 49}Complete DF{col 67}= {res}       113
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    108.50
{txt}{col 49}        avg{col 67}= {res}    110.60
{txt}{col 49}        max{col 67}= {res}    111.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  111.0{txt}){col 67}= {res}     10.10
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-162.5385{col 26}{space 2} 64.95978{col 37}{space 1}   -2.50{col 46}{space 3}0.014{col 54}{space 4}-291.2612{col 67}{space 3}-33.81571
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-80.26945{col 26}{space 2} 76.88666{col 37}{space 1}   -1.04{col 46}{space 3}0.299{col 54}{space 4}-232.6256{col 67}{space 3} 72.08666
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2.104017{col 26}{space 2} 3.795301{col 37}{space 1}   -0.55{col 46}{space 3}0.580{col 54}{space 4}-9.624657{col 67}{space 3} 5.416624
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-41.73961{col 26}{space 2} 68.70901{col 37}{space 1}   -0.61{col 46}{space 3}0.545{col 54}{space 4}-177.8909{col 67}{space 3} 94.41166
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0050812{col 26}{space 2} .0435763{col 37}{space 1}    0.12{col 46}{space 3}0.907{col 54}{space 4}-.0812685{col 67}{space 3}  .091431
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 2.997608{col 26}{space 2} 4.608286{col 37}{space 1}    0.65{col 46}{space 3}0.517{col 54}{space 4}-6.134045{col 67}{space 3} 12.12926
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 22.48763{col 26}{space 2} 57.85161{col 37}{space 1}    0.39{col 46}{space 3}0.698{col 54}{space 4}-92.16491{col 67}{space 3} 137.1402
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} .3601163{col 26}{space 2} 1.324881{col 37}{space 1}    0.27{col 46}{space 3}0.786{col 54}{space 4}-2.265892{col 67}{space 3} 2.986124
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019254{col 26}{space 2} .0002641{col 37}{space 1}    7.29{col 46}{space 3}0.000{col 54}{space 4}  .001402{col 67}{space 3} .0024488
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   1484.8{col 26}{space 2} 434.1936{col 37}{space 1}    3.42{col 46}{space 3}0.001{col 54}{space 4} 624.4131{col 67}{space 3} 2345.187
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0043
{txt}{col 49}Largest FMI{col 67}= {res}    0.0197
{txt}{col 49}Complete DF{col 67}= {res}       113
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    107.89
{txt}{col 49}        avg{col 67}= {res}    110.42
{txt}{col 49}        max{col 67}= {res}    111.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  111.0{txt}){col 67}= {res}     11.93
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-99.47295{col 26}{space 2} 68.31826{col 37}{space 1}   -1.46{col 46}{space 3}0.148{col 54}{space 4}-234.8527{col 67}{space 3} 35.90682
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-137.5532{col 26}{space 2} 80.82045{col 37}{space 1}   -1.70{col 46}{space 3}0.092{col 54}{space 4}-297.7046{col 67}{space 3} 22.59829
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.1375941{col 26}{space 2} 3.989931{col 37}{space 1}   -0.03{col 46}{space 3}0.973{col 54}{space 4}-8.043942{col 67}{space 3} 7.768754
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.121959{col 26}{space 2} 72.21858{col 37}{space 1}    0.02{col 46}{space 3}0.988{col 54}{space 4}-141.9838{col 67}{space 3} 144.2277
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0241097{col 26}{space 2} .0458022{col 37}{space 1}    0.53{col 46}{space 3}0.600{col 54}{space 4}-.0666509{col 67}{space 3} .1148703
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 6.236047{col 26}{space 2} 4.860704{col 37}{space 1}    1.28{col 46}{space 3}0.202{col 54}{space 4}-3.396716{col 67}{space 3} 15.86881
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-30.19223{col 26}{space 2} 60.81726{col 37}{space 1}   -0.50{col 46}{space 3}0.621{col 54}{space 4}-150.7229{col 67}{space 3} 90.33849
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} .5414893{col 26}{space 2} 1.394596{col 37}{space 1}    0.39{col 46}{space 3}0.699{col 54}{space 4}-2.222873{col 67}{space 3} 3.305852
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}    .0024{col 26}{space 2} .0002776{col 37}{space 1}    8.64{col 46}{space 3}0.000{col 54}{space 4} .0018498{col 67}{space 3} .0029501
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 796.8773{col 26}{space 2}  456.392{col 37}{space 1}    1.75{col 46}{space 3}0.084{col 54}{space 4}-107.4981{col 67}{space 3} 1701.253
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       121
{txt}{col 49}Average RVI{col 67}= {res}    0.0012
{txt}{col 49}Largest FMI{col 67}= {res}    0.0093
{txt}{col 49}Complete DF{col 67}= {res}       111
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    107.86
{txt}{col 49}        avg{col 67}= {res}    108.87
{txt}{col 49}        max{col 67}= {res}    109.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  109.0{txt}){col 67}= {res}      0.62
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.7796

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .5708221{col 26}{space 2} .8809234{col 37}{space 1}    0.65{col 46}{space 3}0.518{col 54}{space 4}-1.175148{col 67}{space 3} 2.316793
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0256019{col 26}{space 2} 1.008645{col 37}{space 1}    0.03{col 46}{space 3}0.980{col 54}{space 4}-1.973489{col 67}{space 3} 2.024693
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0620431{col 26}{space 2} .0510772{col 37}{space 1}    1.21{col 46}{space 3}0.227{col 54}{space 4}-.0391898{col 67}{space 3}  .163276
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.346136{col 26}{space 2} .9116664{col 37}{space 1}    1.48{col 46}{space 3}0.143{col 54}{space 4}-.4607496{col 67}{space 3} 3.153021
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0001309{col 26}{space 2} .0005701{col 37}{space 1}   -0.23{col 46}{space 3}0.819{col 54}{space 4}-.0012608{col 67}{space 3}  .000999
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0252963{col 26}{space 2} .0606549{col 37}{space 1}    0.42{col 46}{space 3}0.677{col 54}{space 4}-.0949203{col 67}{space 3} .1455129
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-.0987849{col 26}{space 2} .7634077{col 37}{space 1}   -0.13{col 46}{space 3}0.897{col 54}{space 4}-1.611875{col 67}{space 3} 1.414306
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} .0017297{col 26}{space 2} .0175084{col 37}{space 1}    0.10{col 46}{space 3}0.921{col 54}{space 4}-.0329755{col 67}{space 3} .0364349
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.75e-06{col 26}{space 2} 3.45e-06{col 37}{space 1}    0.80{col 46}{space 3}0.428{col 54}{space 4}-4.10e-06{col 67}{space 3} 9.60e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.878964{col 26}{space 2} 5.694473{col 37}{space 1}   -0.86{col 46}{space 3}0.393{col 54}{space 4}-16.16525{col 67}{space 3}  6.40732
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //INTERACTION by Race//
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0373
{txt}{col 49}Largest FMI{col 67}= {res}    0.2218
{txt}{col 49}Complete DF{col 67}= {res}       201
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     59.80
{txt}{col 49}        avg{col 67}= {res}    175.80
{txt}{col 49}        max{col 67}= {res}    198.79
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  197.5{txt}){col 67}= {res}     16.73
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-181.9335{col 28}{space 2} 57.47664{col 39}{space 1}   -3.17{col 48}{space 3}0.002{col 56}{space 4}-295.2785{col 69}{space 3}-68.58863
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-256.3139{col 28}{space 2} 162.2805{col 39}{space 1}   -1.58{col 48}{space 3}0.116{col 56}{space 4}-576.3412{col 69}{space 3} 63.71335
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 89.79194{col 28}{space 2}  70.9852{col 39}{space 1}    1.26{col 48}{space 3}0.207{col 56}{space 4}-50.19544{col 69}{space 3} 229.7793
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-35.75052{col 28}{space 2} 54.98172{col 39}{space 1}   -0.65{col 48}{space 3}0.516{col 56}{space 4}-144.1883{col 69}{space 3} 72.68728
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-3.371734{col 28}{space 2} 2.651534{col 39}{space 1}   -1.27{col 48}{space 3}0.205{col 56}{space 4}-8.600585{col 69}{space 3} 1.857117
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-101.1394{col 28}{space 2} 47.31937{col 39}{space 1}   -2.14{col 48}{space 3}0.034{col 56}{space 4}-194.4518{col 69}{space 3}-7.827093
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0027402{col 28}{space 2} .0323313{col 39}{space 1}   -0.08{col 48}{space 3}0.933{col 56}{space 4}   -.0665{col 69}{space 3} .0610196
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}-1.388923{col 28}{space 2} 3.595699{col 39}{space 1}   -0.39{col 48}{space 3}0.701{col 56}{space 4}-8.581886{col 69}{space 3} 5.804039
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-7.280427{col 28}{space 2} 40.54681{col 39}{space 1}   -0.18{col 48}{space 3}0.858{col 56}{space 4}-87.58512{col 69}{space 3} 73.02427
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 1.716745{col 28}{space 2} .9015982{col 39}{space 1}    1.90{col 48}{space 3}0.059{col 56}{space 4}-.0627656{col 69}{space 3} 3.496255
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0017622{col 28}{space 2}  .000199{col 39}{space 1}    8.86{col 48}{space 3}0.000{col 56}{space 4} .0013699{col 69}{space 3} .0021546
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1843.053{col 28}{space 2} 316.6343{col 39}{space 1}    5.82{col 48}{space 3}0.000{col 56}{space 4} 1218.283{col 69}{space 3} 2467.824
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0419
{txt}{col 49}Largest FMI{col 67}= {res}    0.2270
{txt}{col 49}Complete DF{col 67}= {res}       201
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     58.02
{txt}{col 49}        avg{col 67}= {res}    172.83
{txt}{col 49}        max{col 67}= {res}    198.73
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  197.1{txt}){col 67}= {res}     18.79
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-119.7271{col 28}{space 2}  59.9511{col 39}{space 1}   -2.00{col 48}{space 3}0.047{col 56}{space 4}-237.9553{col 69}{space 3} -1.49898
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-164.0452{col 28}{space 2} 169.0113{col 39}{space 1}   -0.97{col 48}{space 3}0.333{col 56}{space 4}-497.3464{col 69}{space 3}  169.256
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 49.52696{col 28}{space 2} 73.94556{col 39}{space 1}    0.67{col 48}{space 3}0.504{col 56}{space 4}-96.29925{col 69}{space 3} 195.3532
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-84.39592{col 28}{space 2} 57.23404{col 39}{space 1}   -1.47{col 48}{space 3}0.142{col 56}{space 4}-197.2744{col 69}{space 3} 28.48257
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2.758916{col 28}{space 2} 2.764769{col 39}{space 1}   -1.00{col 48}{space 3}0.320{col 56}{space 4}-8.211189{col 69}{space 3} 2.693358
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -79.4835{col 28}{space 2} 49.28545{col 39}{space 1}   -1.61{col 48}{space 3}0.108{col 56}{space 4} -176.673{col 69}{space 3} 17.70606
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0159507{col 28}{space 2} .0336757{col 39}{space 1}    0.47{col 48}{space 3}0.636{col 56}{space 4}-.0504605{col 69}{space 3} .0823619
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}-.5923965{col 28}{space 2} 3.755539{col 39}{space 1}   -0.16{col 48}{space 3}0.875{col 56}{space 4}-8.109858{col 69}{space 3} 6.925065
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-21.65995{col 28}{space 2} 42.79646{col 39}{space 1}   -0.51{col 48}{space 3}0.614{col 56}{space 4}-106.5837{col 69}{space 3} 63.26383
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 1.880004{col 28}{space 2} .9491039{col 39}{space 1}    1.98{col 48}{space 3}0.049{col 56}{space 4} .0051907{col 69}{space 3} 3.754816
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021328{col 28}{space 2} .0002073{col 39}{space 1}   10.29{col 48}{space 3}0.000{col 56}{space 4}  .001724{col 69}{space 3} .0025416
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1437.188{col 28}{space 2} 328.7405{col 39}{space 1}    4.37{col 48}{space 3}0.000{col 56}{space 4} 788.6324{col 69}{space 3} 2085.744
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       209
{txt}{col 49}Average RVI{col 67}= {res}    0.0605
{txt}{col 49}Largest FMI{col 67}= {res}    0.2868
{txt}{col 49}Complete DF{col 67}= {res}       197
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     41.74
{txt}{col 49}        avg{col 67}= {res}    163.93
{txt}{col 49}        max{col 67}= {res}    194.92
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  191.4{txt}){col 67}= {res}      0.82
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.6200

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} .3810725{col 28}{space 2} .8214916{col 39}{space 1}    0.46{col 48}{space 3}0.643{col 56}{space 4} -1.23972{col 69}{space 3} 2.001865
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} .8944973{col 28}{space 2} 2.258831{col 39}{space 1}    0.40{col 48}{space 3}0.693{col 56}{space 4}-3.560491{col 69}{space 3} 5.349486
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.1268955{col 28}{space 2} .9951819{col 39}{space 1}   -0.13{col 48}{space 3}0.899{col 56}{space 4}-2.089679{col 69}{space 3} 1.835888
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .1970852{col 28}{space 2} .7546679{col 39}{space 1}    0.26{col 48}{space 3}0.794{col 56}{space 4}-1.291337{col 69}{space 3} 1.685507
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0795755{col 28}{space 2} .0372728{col 39}{space 1}    2.13{col 48}{space 3}0.034{col 56}{space 4} .0060508{col 69}{space 3} .1531002
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .1430401{col 28}{space 2} .6568549{col 39}{space 1}    0.22{col 48}{space 3}0.828{col 56}{space 4}-1.152415{col 69}{space 3} 1.438495
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} -.000184{col 28}{space 2} .0004425{col 39}{space 1}   -0.42{col 48}{space 3}0.678{col 56}{space 4}-.0010567{col 69}{space 3} .0006888
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0205247{col 28}{space 2} .0513996{col 39}{space 1}    0.40{col 48}{space 3}0.692{col 56}{space 4}-.0832234{col 69}{space 3} .1242728
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} -.273918{col 28}{space 2} .5746522{col 39}{space 1}   -0.48{col 48}{space 3}0.635{col 56}{space 4}-1.416799{col 69}{space 3} .8689632
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} .0058827{col 28}{space 2} .0129674{col 39}{space 1}    0.45{col 48}{space 3}0.651{col 56}{space 4}-.0198033{col 69}{space 3} .0315688
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 1.33e-06{col 28}{space 2} 2.73e-06{col 39}{space 1}    0.49{col 48}{space 3}0.627{col 56}{space 4}-4.05e-06{col 69}{space 3} 6.70e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-2.193782{col 28}{space 2} 4.298273{col 39}{space 1}   -0.51{col 48}{space 3}0.610{col 56}{space 4}-10.67242{col 69}{space 3} 6.284854
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 4: MODEL 2+liver/kidney disease******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.4249
{txt}{col 49}Largest FMI{col 67}= {res}    0.7774
{txt}{col 49}Complete DF{col 67}= {res}        77
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      5.68
{txt}{col 49}        avg{col 67}= {res}     39.75
{txt}{col 49}        max{col 67}= {res}     74.38
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   59.7{txt}){col 67}= {res}      4.16
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-92.96865{col 26}{space 2} 53.98921{col 37}{space 1}   -1.72{col 46}{space 3}0.089{col 54}{space 4}-200.5669{col 67}{space 3} 14.62958
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 27.40488{col 26}{space 2} 118.2398{col 37}{space 1}    0.23{col 46}{space 3}0.819{col 54}{space 4}-221.9364{col 67}{space 3} 276.7461
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-5.626789{col 26}{space 2} 4.203599{col 37}{space 1}   -1.34{col 46}{space 3}0.185{col 54}{space 4}-14.00911{col 67}{space 3} 2.755534
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-161.6179{col 26}{space 2} 70.55979{col 37}{space 1}   -2.29{col 46}{space 3}0.025{col 54}{space 4}-302.1996{col 67}{space 3}-21.03622
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0021665{col 26}{space 2} .0538505{col 37}{space 1}    0.04{col 46}{space 3}0.968{col 54}{space 4}-.1054008{col 67}{space 3} .1097337
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-2.848072{col 26}{space 2} 6.562023{col 37}{space 1}   -0.43{col 46}{space 3}0.670{col 54}{space 4}-16.82942{col 67}{space 3} 11.13328
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 104.9097{col 26}{space 2} 192.6299{col 37}{space 1}    0.54{col 46}{space 3}0.607{col 54}{space 4}-372.9689{col 67}{space 3} 582.7882
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-5243.858{col 26}{space 2} 5928.095{col 37}{space 1}   -0.88{col 46}{space 3}0.388{col 54}{space 4}-17708.62{col 67}{space 3} 7220.902
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 2.448843{col 26}{space 2} 10.72588{col 37}{space 1}    0.23{col 46}{space 3}0.821{col 54}{space 4}-19.46554{col 67}{space 3} 24.36323
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} .5264111{col 26}{space 2} 1.796854{col 37}{space 1}    0.29{col 46}{space 3}0.773{col 54}{space 4}-3.271983{col 67}{space 3} 4.324805
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-17.54674{col 26}{space 2} 24.49299{col 37}{space 1}   -0.72{col 46}{space 3}0.476{col 54}{space 4} -66.3812{col 67}{space 3} 31.28771
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0015478{col 26}{space 2} .0003654{col 37}{space 1}    4.24{col 46}{space 3}0.000{col 54}{space 4} .0008108{col 67}{space 3} .0022848
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  7433.31{col 26}{space 2} 6067.782{col 37}{space 1}    1.23{col 46}{space 3}0.236{col 54}{space 4}-5312.224{col 67}{space 3} 20178.84
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.4443
{txt}{col 49}Largest FMI{col 67}= {res}    0.7756
{txt}{col 49}Complete DF{col 67}= {res}        77
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      5.71
{txt}{col 49}        avg{col 67}= {res}     38.70
{txt}{col 49}        max{col 67}= {res}     73.94
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   58.9{txt}){col 67}= {res}      4.42
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-78.66985{col 26}{space 2} 53.71152{col 37}{space 1}   -1.46{col 46}{space 3}0.147{col 54}{space 4}-185.7149{col 67}{space 3} 28.37523
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-31.83598{col 26}{space 2} 121.7728{col 37}{space 1}   -0.26{col 46}{space 3}0.797{col 54}{space 4}-291.9476{col 67}{space 3} 228.2756
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-7.591517{col 26}{space 2}  4.26421{col 37}{space 1}   -1.78{col 46}{space 3}0.080{col 54}{space 4}-16.11095{col 67}{space 3} .9279139
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-163.3996{col 26}{space 2} 70.32936{col 37}{space 1}   -2.32{col 46}{space 3}0.023{col 54}{space 4}-303.5357{col 67}{space 3}-23.26343
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0283973{col 26}{space 2} .0531855{col 37}{space 1}    0.53{col 46}{space 3}0.595{col 54}{space 4}-.0777592{col 67}{space 3} .1345537
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-5.522049{col 26}{space 2} 6.726679{col 37}{space 1}   -0.82{col 46}{space 3}0.426{col 54}{space 4}-20.01961{col 67}{space 3} 8.975509
{txt}w1Creatinine {c |}{col 14}{res}{space 2}  86.6832{col 26}{space 2} 191.0209{col 37}{space 1}    0.45{col 46}{space 3}0.667{col 54}{space 4}-386.5001{col 67}{space 3} 559.8665
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-1999.021{col 26}{space 2} 5856.837{col 37}{space 1}   -0.34{col 46}{space 3}0.737{col 54}{space 4}-14285.83{col 67}{space 3} 10287.79
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 10.50057{col 26}{space 2} 10.65871{col 37}{space 1}    0.99{col 46}{space 3}0.332{col 54}{space 4} -11.2701{col 67}{space 3} 32.27125
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} .7243415{col 26}{space 2} 1.876581{col 37}{space 1}    0.39{col 46}{space 3}0.706{col 54}{space 4}-3.317221{col 67}{space 3} 4.765904
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-3.091847{col 26}{space 2} 24.72166{col 37}{space 1}   -0.13{col 46}{space 3}0.901{col 54}{space 4}-52.44846{col 67}{space 3} 46.26477
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0018544{col 26}{space 2} .0003611{col 37}{space 1}    5.14{col 46}{space 3}0.000{col 54}{space 4} .0011272{col 67}{space 3} .0025815
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 3994.797{col 26}{space 2} 6003.515{col 37}{space 1}    0.67{col 46}{space 3}0.514{col 54}{space 4}-8593.181{col 67}{space 3} 16582.78
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        88
{txt}{col 49}Average RVI{col 67}= {res}    0.7235
{txt}{col 49}Largest FMI{col 67}= {res}    0.8873
{txt}{col 49}Complete DF{col 67}= {res}        75
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      3.76
{txt}{col 49}        avg{col 67}= {res}     34.16
{txt}{col 49}        max{col 67}= {res}     69.85
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   48.5{txt}){col 67}= {res}      0.55
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.8597

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .2994173{col 26}{space 2} .7982659{col 37}{space 1}    0.38{col 46}{space 3}0.709{col 54}{space 4}-1.294193{col 67}{space 3} 1.893028
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .4957485{col 26}{space 2}  1.88954{col 37}{space 1}    0.26{col 46}{space 3}0.797{col 54}{space 4}-3.584047{col 67}{space 3} 4.575544
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0678047{col 26}{space 2} .0645797{col 37}{space 1}    1.05{col 46}{space 3}0.299{col 54}{space 4}-.0619723{col 67}{space 3} .1975818
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-1.137844{col 26}{space 2} 1.036661{col 37}{space 1}   -1.10{col 46}{space 3}0.276{col 54}{space 4}-3.205475{col 67}{space 3} .9297871
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0003115{col 26}{space 2} .0007882{col 37}{space 1}   -0.40{col 46}{space 3}0.694{col 54}{space 4}-.0018899{col 67}{space 3}  .001267
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0338678{col 26}{space 2} .1108144{col 37}{space 1}    0.31{col 46}{space 3}0.767{col 54}{space 4}-.2170493{col 67}{space 3} .2847849
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-.2641991{col 26}{space 2} 3.805459{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4}-11.09992{col 67}{space 3} 10.57153
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-51.57897{col 26}{space 2} 88.98922{col 37}{space 1}   -0.58{col 46}{space 3}0.571{col 54}{space 4}-241.0071{col 67}{space 3} 137.8491
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} .1058372{col 26}{space 2} .1849091{col 37}{space 1}    0.57{col 46}{space 3}0.576{col 54}{space 4}-.2918986{col 67}{space 3}  .503573
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0184986{col 26}{space 2} .0248091{col 37}{space 1}   -0.75{col 46}{space 3}0.464{col 54}{space 4}-.0700184{col 67}{space 3} .0330212
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-.2957771{col 26}{space 2} .3783823{col 37}{space 1}   -0.78{col 46}{space 3}0.437{col 54}{space 4}-1.050889{col 67}{space 3} .4593349
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 9.89e-07{col 26}{space 2} 5.32e-06{col 37}{space 1}    0.19{col 46}{space 3}0.853{col 54}{space 4}-9.75e-06{col 67}{space 3} .0000117
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 55.91937{col 26}{space 2} 91.21157{col 37}{space 1}    0.61{col 46}{space 3}0.549{col 54}{space 4}-138.2092{col 67}{space 3}  250.048
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0330
{txt}{col 49}Largest FMI{col 67}= {res}    0.2333
{txt}{col 49}Complete DF{col 67}= {res}       110
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     43.31
{txt}{col 49}        avg{col 67}= {res}     96.36
{txt}{col 49}        max{col 67}= {res}    107.74
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  107.5{txt}){col 67}= {res}      8.39
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-184.7849{col 26}{space 2} 66.89722{col 37}{space 1}   -2.76{col 46}{space 3}0.007{col 54}{space 4}-317.3982{col 67}{space 3}-52.17158
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-115.8388{col 26}{space 2} 95.22853{col 37}{space 1}   -1.22{col 46}{space 3}0.227{col 54}{space 4}-304.6898{col 67}{space 3} 73.01217
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.569111{col 26}{space 2} 3.808775{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}-9.118966{col 67}{space 3} 5.980745
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-28.15897{col 26}{space 2} 69.26289{col 37}{space 1}   -0.41{col 46}{space 3}0.685{col 54}{space 4}-165.4574{col 67}{space 3} 109.1395
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0016651{col 26}{space 2} .0449893{col 37}{space 1}   -0.04{col 46}{space 3}0.971{col 54}{space 4}-.0908545{col 67}{space 3} .0875243
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  1.99722{col 26}{space 2} 4.882583{col 37}{space 1}    0.41{col 46}{space 3}0.683{col 54}{space 4}-7.681638{col 67}{space 3} 11.67608
{txt}w1Creatinine {c |}{col 14}{res}{space 2} -15.3948{col 26}{space 2} 143.7113{col 37}{space 1}   -0.11{col 46}{space 3}0.915{col 54}{space 4}-305.1572{col 67}{space 3} 274.3676
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-580.6938{col 26}{space 2} 5760.134{col 37}{space 1}   -0.10{col 46}{space 3}0.920{col 54}{space 4}-12043.04{col 67}{space 3} 10881.65
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 12.30748{col 26}{space 2} 7.927091{col 37}{space 1}    1.55{col 46}{space 3}0.124{col 54}{space 4}-3.439205{col 67}{space 3} 28.05417
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-1.184798{col 26}{space 2} 1.378222{col 37}{space 1}   -0.86{col 46}{space 3}0.392{col 54}{space 4}-3.917474{col 67}{space 3} 1.547877
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} 9.634461{col 26}{space 2} 24.62941{col 37}{space 1}    0.39{col 46}{space 3}0.696{col 54}{space 4}-39.19646{col 67}{space 3} 58.46539
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019963{col 26}{space 2}  .000276{col 37}{space 1}    7.23{col 46}{space 3}0.000{col 54}{space 4} .0014492{col 67}{space 3} .0025434
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1997.169{col 26}{space 2}  5765.68{col 37}{space 1}    0.35{col 46}{space 3}0.730{col 54}{space 4}-9476.044{col 67}{space 3} 13470.38
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0985
{txt}{col 49}Largest FMI{col 67}= {res}    0.5287
{txt}{col 49}Complete DF{col 67}= {res}       110
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     13.58
{txt}{col 49}        avg{col 67}= {res}     85.84
{txt}{col 49}        max{col 67}= {res}    107.97
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  104.5{txt}){col 67}= {res}      9.08
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-133.2344{col 26}{space 2} 71.32147{col 37}{space 1}   -1.87{col 46}{space 3}0.065{col 54}{space 4}-274.6721{col 67}{space 3} 8.203437
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-195.4325{col 26}{space 2} 103.4624{col 37}{space 1}   -1.89{col 46}{space 3}0.062{col 54}{space 4}-401.1015{col 67}{space 3} 10.23658
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -.645116{col 26}{space 2} 4.020303{col 37}{space 1}   -0.16{col 46}{space 3}0.873{col 54}{space 4}-8.614106{col 67}{space 3} 7.323874
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-1.195291{col 26}{space 2} 73.02629{col 37}{space 1}   -0.02{col 46}{space 3}0.987{col 54}{space 4}-145.9465{col 67}{space 3}  143.556
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}  .029679{col 26}{space 2} .0485231{col 37}{space 1}    0.61{col 46}{space 3}0.542{col 54}{space 4} -.066635{col 67}{space 3}  .125993
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 3.586297{col 26}{space 2} 5.192638{col 37}{space 1}    0.69{col 46}{space 3}0.491{col 54}{space 4}-6.709847{col 67}{space 3} 13.88244
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-7.255572{col 26}{space 2} 185.5907{col 37}{space 1}   -0.04{col 46}{space 3}0.969{col 54}{space 4}-406.4631{col 67}{space 3} 391.9519
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 367.0535{col 26}{space 2} 6297.674{col 37}{space 1}    0.06{col 46}{space 3}0.954{col 54}{space 4} -12234.3{col 67}{space 3} 12968.41
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 7.348367{col 26}{space 2} 8.617389{col 37}{space 1}    0.85{col 46}{space 3}0.397{col 54}{space 4}-9.832385{col 67}{space 3} 24.52912
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} .6066126{col 26}{space 2} 1.457157{col 37}{space 1}    0.42{col 46}{space 3}0.678{col 54}{space 4}-2.282695{col 67}{space 3}  3.49592
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} 20.97633{col 26}{space 2} 26.53862{col 37}{space 1}    0.79{col 46}{space 3}0.431{col 54}{space 4}-31.70569{col 67}{space 3} 73.65835
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0024789{col 26}{space 2} .0002925{col 37}{space 1}    8.47{col 46}{space 3}0.000{col 54}{space 4} .0018989{col 67}{space 3} .0030589
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 349.2729{col 26}{space 2} 6308.184{col 37}{space 1}    0.06{col 46}{space 3}0.956{col 54}{space 4}-12274.54{col 67}{space 3} 12973.09
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       121
{txt}{col 49}Average RVI{col 67}= {res}    0.0089
{txt}{col 49}Largest FMI{col 67}= {res}    0.0462
{txt}{col 49}Complete DF{col 67}= {res}       108
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     96.58
{txt}{col 49}        avg{col 67}= {res}    104.04
{txt}{col 49}        max{col 67}= {res}    105.96
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  106.0{txt}){col 67}= {res}      0.79
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.6470

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .3976857{col 26}{space 2} .8810086{col 37}{space 1}    0.45{col 46}{space 3}0.653{col 54}{space 4}-1.349037{col 67}{space 3} 2.144409
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.6192232{col 26}{space 2} 1.251418{col 37}{space 1}   -0.49{col 46}{space 3}0.622{col 54}{space 4}-3.100597{col 67}{space 3} 1.862151
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0646094{col 26}{space 2} .0517258{col 37}{space 1}    1.25{col 46}{space 3}0.214{col 54}{space 4}-.0379481{col 67}{space 3}  .167167
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.174262{col 26}{space 2} .9229163{col 37}{space 1}    1.27{col 46}{space 3}0.206{col 54}{space 4}-.6555169{col 67}{space 3} 3.004041
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0002874{col 26}{space 2} .0005884{col 37}{space 1}   -0.49{col 46}{space 3}0.626{col 54}{space 4} -.001454{col 67}{space 3} .0008792
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-.0046488{col 26}{space 2} .0655011{col 37}{space 1}   -0.07{col 46}{space 3}0.944{col 54}{space 4}-.1345241{col 67}{space 3} .1252266
{txt}w1Creatinine {c |}{col 14}{res}{space 2} .3134429{col 26}{space 2} 1.735341{col 37}{space 1}    0.18{col 46}{space 3}0.857{col 54}{space 4}-3.130919{col 67}{space 3} 3.757805
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 110.5111{col 26}{space 2} 73.99869{col 37}{space 1}    1.49{col 46}{space 3}0.138{col 54}{space 4}-36.25404{col 67}{space 3} 257.2763
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} .0137195{col 26}{space 2} .1065327{col 37}{space 1}    0.13{col 46}{space 3}0.898{col 54}{space 4}-.1975629{col 67}{space 3}  .225002
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0049679{col 26}{space 2} .0181332{col 37}{space 1}   -0.27{col 46}{space 3}0.785{col 54}{space 4}-.0409284{col 67}{space 3} .0309927
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} .1403288{col 26}{space 2} .3270803{col 37}{space 1}    0.43{col 46}{space 3}0.669{col 54}{space 4}-.5081762{col 67}{space 3} .7888339
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.63e-06{col 26}{space 2} 3.62e-06{col 37}{space 1}    0.73{col 46}{space 3}0.469{col 54}{space 4}-4.54e-06{col 67}{space 3} 9.81e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -115.466{col 26}{space 2} 74.08147{col 37}{space 1}   -1.56{col 46}{space 3}0.122{col 54}{space 4}-262.3985{col 67}{space 3}  31.4664
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. **INTERACTION by Race**
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.2487
{txt}{col 49}Largest FMI{col 67}= {res}    0.7514
{txt}{col 49}Complete DF{col 67}= {res}       198
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      7.29
{txt}{col 49}        avg{col 67}= {res}    122.29
{txt}{col 49}        max{col 67}= {res}    193.63
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  162.2{txt}){col 67}= {res}     11.16
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-173.0177{col 28}{space 2} 60.18925{col 39}{space 1}   -2.87{col 48}{space 3}0.005{col 56}{space 4}-291.8727{col 69}{space 3}-54.16276
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-209.8847{col 28}{space 2}  167.952{col 39}{space 1}   -1.25{col 48}{space 3}0.213{col 56}{space 4}-541.5656{col 69}{space 3} 121.7963
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 73.76265{col 28}{space 2} 71.96131{col 39}{space 1}    1.03{col 48}{space 3}0.307{col 56}{space 4}-68.21947{col 69}{space 3} 215.7448
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-37.51981{col 28}{space 2} 69.28495{col 39}{space 1}   -0.54{col 48}{space 3}0.589{col 56}{space 4}-174.8342{col 69}{space 3} 99.79462
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-4.136693{col 28}{space 2} 2.702405{col 39}{space 1}   -1.53{col 48}{space 3}0.127{col 56}{space 4}-9.466623{col 69}{space 3} 1.193236
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-92.93651{col 28}{space 2} 48.19027{col 39}{space 1}   -1.93{col 48}{space 3}0.055{col 56}{space 4}-187.9883{col 69}{space 3} 2.115297
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0084496{col 28}{space 2} .0329709{col 39}{space 1}   -0.26{col 48}{space 3}0.798{col 56}{space 4}-.0734929{col 69}{space 3} .0565937
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}-.0039324{col 28}{space 2} 3.790649{col 39}{space 1}   -0.00{col 48}{space 3}0.999{col 56}{space 4}-7.552086{col 69}{space 3} 7.544221
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} 50.87117{col 28}{space 2} 141.2618{col 39}{space 1}    0.36{col 48}{space 3}0.729{col 56}{space 4}-280.5177{col 69}{space 3}   382.26
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-2276.795{col 28}{space 2}     3912{col 39}{space 1}   -0.58{col 48}{space 3}0.562{col 56}{space 4} -10083.1{col 69}{space 3} 5529.513
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 8.928807{col 28}{space 2} 6.398758{col 39}{space 1}    1.40{col 48}{space 3}0.168{col 56}{space 4}-3.872911{col 69}{space 3} 21.73053
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.1588815{col 28}{space 2}  1.16911{col 39}{space 1}   -0.14{col 48}{space 3}0.893{col 56}{space 4}-2.553609{col 69}{space 3} 2.235846
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-6.224255{col 28}{space 2} 17.31889{col 39}{space 1}   -0.36{col 48}{space 3}0.720{col 56}{space 4} -40.4365{col 69}{space 3} 27.98799
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0017647{col 28}{space 2}  .000207{col 39}{space 1}    8.52{col 48}{space 3}0.000{col 56}{space 4} .0013562{col 69}{space 3} .0021732
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 4182.111{col 28}{space 2} 3939.966{col 39}{space 1}    1.06{col 48}{space 3}0.292{col 56}{space 4}-3675.934{col 69}{space 3} 12040.16
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.2234
{txt}{col 49}Largest FMI{col 67}= {res}    0.7019
{txt}{col 49}Complete DF{col 67}= {res}       198
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      8.50
{txt}{col 49}        avg{col 67}= {res}    119.45
{txt}{col 49}        max{col 67}= {res}    193.95
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  166.7{txt}){col 67}= {res}     13.01
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-122.4457{col 28}{space 2} 62.49746{col 39}{space 1}   -1.96{col 48}{space 3}0.052{col 56}{space 4}-245.8409{col 69}{space 3} .9494516
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-134.6892{col 28}{space 2} 173.9717{col 39}{space 1}   -0.77{col 48}{space 3}0.440{col 56}{space 4}-478.1481{col 69}{space 3} 208.7698
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 38.85072{col 28}{space 2} 74.63599{col 39}{space 1}    0.52{col 48}{space 3}0.603{col 56}{space 4}-108.3889{col 69}{space 3} 186.0903
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-103.5457{col 28}{space 2} 72.13053{col 39}{space 1}   -1.44{col 48}{space 3}0.154{col 56}{space 4}-246.5163{col 69}{space 3} 39.42489
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-3.954329{col 28}{space 2} 2.817621{col 39}{space 1}   -1.40{col 48}{space 3}0.162{col 56}{space 4}-9.511821{col 69}{space 3} 1.603164
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-76.42826{col 28}{space 2} 49.97858{col 39}{space 1}   -1.53{col 48}{space 3}0.128{col 56}{space 4}-174.9995{col 69}{space 3} 22.14303
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0139083{col 28}{space 2} .0341959{col 39}{space 1}    0.41{col 48}{space 3}0.685{col 56}{space 4}-.0535442{col 69}{space 3} .0813608
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}-.3363971{col 28}{space 2} 3.983705{col 39}{space 1}   -0.08{col 48}{space 3}0.933{col 56}{space 4}-8.284536{col 69}{space 3} 7.611742
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} 48.21112{col 28}{space 2} 135.9237{col 39}{space 1}    0.35{col 48}{space 3}0.731{col 56}{space 4}-262.0198{col 69}{space 3}  358.442
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-63.00852{col 28}{space 2}  4241.67{col 39}{space 1}   -0.01{col 48}{space 3}0.988{col 56}{space 4}-8606.399{col 69}{space 3} 8480.382
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 7.696578{col 28}{space 2}  6.74232{col 39}{space 1}    1.14{col 48}{space 3}0.259{col 56}{space 4}-5.830896{col 69}{space 3} 21.22405
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}  .846844{col 28}{space 2} 1.204849{col 39}{space 1}    0.70{col 48}{space 3}0.488{col 56}{space 4}-1.614062{col 69}{space 3}  3.30775
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2} 6.005237{col 28}{space 2} 18.04426{col 39}{space 1}    0.33{col 48}{space 3}0.740{col 56}{space 4}-29.64445{col 69}{space 3} 41.65493
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2}  .002155{col 28}{space 2}  .000215{col 39}{space 1}   10.02{col 48}{space 3}0.000{col 56}{space 4} .0017307{col 69}{space 3} .0025792
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1485.517{col 28}{space 2} 4265.025{col 39}{space 1}    0.35{col 48}{space 3}0.729{col 56}{space 4} -7095.98{col 69}{space 3} 10067.01
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       209
{txt}{col 49}Average RVI{col 67}= {res}    0.2697
{txt}{col 49}Largest FMI{col 67}= {res}    0.7592
{txt}{col 49}Complete DF{col 67}= {res}       194
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      7.09
{txt}{col 49}        avg{col 67}= {res}    111.62
{txt}{col 49}        max{col 67}= {res}    189.23
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  155.9{txt}){col 67}= {res}      0.68
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.7802

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} .3463664{col 28}{space 2} .8326459{col 39}{space 1}    0.42{col 48}{space 3}0.678{col 56}{space 4}-1.298532{col 69}{space 3} 1.991265
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} .9312203{col 28}{space 2} 2.301496{col 39}{space 1}    0.40{col 48}{space 3}0.686{col 56}{space 4}-3.611168{col 69}{space 3} 5.473609
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.0735275{col 28}{space 2} .9952696{col 39}{space 1}   -0.07{col 48}{space 3}0.941{col 56}{space 4}-2.037017{col 69}{space 3} 1.889962
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .0257458{col 28}{space 2} 1.036413{col 39}{space 1}    0.02{col 48}{space 3}0.980{col 56}{space 4}-2.055347{col 69}{space 3} 2.106838
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0757717{col 28}{space 2} .0382004{col 39}{space 1}    1.98{col 48}{space 3}0.049{col 56}{space 4} .0003951{col 69}{space 3} .1511482
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .1256467{col 28}{space 2} .6656902{col 39}{space 1}    0.19{col 48}{space 3}0.850{col 56}{space 4}-1.187584{col 69}{space 3} 1.438877
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0002166{col 28}{space 2} .0004462{col 39}{space 1}   -0.49{col 48}{space 3}0.628{col 56}{space 4}-.0010967{col 69}{space 3} .0006635
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0041166{col 28}{space 2} .0572438{col 39}{space 1}    0.07{col 48}{space 3}0.943{col 56}{space 4}-.1122349{col 69}{space 3}  .120468
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-.2056474{col 28}{space 2} 1.995253{col 39}{space 1}   -0.10{col 48}{space 3}0.921{col 56}{space 4} -4.91121{col 69}{space 3} 4.499915
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} 33.05516{col 28}{space 2}  57.7414{col 39}{space 1}    0.57{col 48}{space 3}0.571{col 56}{space 4}-84.03173{col 69}{space 3}  150.142
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} .0650253{col 28}{space 2} .0916686{col 39}{space 1}    0.71{col 48}{space 3}0.481{col 56}{space 4}-.1187333{col 69}{space 3} .2487839
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.0083956{col 28}{space 2} .0151015{col 39}{space 1}   -0.56{col 48}{space 3}0.581{col 56}{space 4}-.0388072{col 69}{space 3} .0220159
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-.0025503{col 28}{space 2} .2462297{col 39}{space 1}   -0.01{col 48}{space 3}0.992{col 56}{space 4}-.4889459{col 69}{space 3} .4838453
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 1.68e-06{col 28}{space 2} 2.83e-06{col 39}{space 1}    0.59{col 48}{space 3}0.554{col 56}{space 4}-3.91e-06{col 69}{space 3} 7.27e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-34.91661{col 28}{space 2} 57.99396{col 39}{space 1}   -0.60{col 48}{space 3}0.551{col 56}{space 4}-152.3758{col 69}{space 3} 82.54261
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 5: MODEL2+OXIDATIVE STRESS******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.2277
{txt}{col 49}Largest FMI{col 67}= {res}    0.5065
{txt}{col 49}Complete DF{col 67}= {res}        79
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     13.39
{txt}{col 49}        avg{col 67}= {res}     49.65
{txt}{col 49}        max{col 67}= {res}     76.42
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   70.0{txt}){col 67}= {res}      5.45
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-91.75464{col 26}{space 2} 53.05646{col 37}{space 1}   -1.73{col 46}{space 3}0.088{col 54}{space 4}-197.4295{col 67}{space 3} 13.92023
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 7.966992{col 26}{space 2} 81.94806{col 37}{space 1}    0.10{col 46}{space 3}0.923{col 54}{space 4}-155.2321{col 67}{space 3} 171.1661
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-5.187935{col 26}{space 2} 3.941814{col 37}{space 1}   -1.32{col 46}{space 3}0.192{col 54}{space 4}-13.04138{col 67}{space 3}  2.66551
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-166.8549{col 26}{space 2} 72.14477{col 37}{space 1}   -2.31{col 46}{space 3}0.023{col 54}{space 4}-310.5883{col 67}{space 3}-23.12151
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0072259{col 26}{space 2} .0543917{col 37}{space 1}    0.13{col 46}{space 3}0.895{col 54}{space 4}-.1012269{col 67}{space 3} .1156787
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-4.057956{col 26}{space 2} 6.611119{col 37}{space 1}   -0.61{col 46}{space 3}0.550{col 54}{space 4}-18.29786{col 67}{space 3} 10.18195
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-.6560079{col 26}{space 2} 5.501604{col 37}{space 1}   -0.12{col 46}{space 3}0.907{col 54}{space 4}-12.34975{col 67}{space 3} 11.03773
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 72.78899{col 26}{space 2} 127.9652{col 37}{space 1}    0.57{col 46}{space 3}0.575{col 54}{space 4} -193.067{col 67}{space 3}  338.645
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 5.631971{col 26}{space 2} 20.18725{col 37}{space 1}    0.28{col 46}{space 3}0.783{col 54}{space 4}-36.09444{col 67}{space 3} 47.35838
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0016375{col 26}{space 2} .0003423{col 37}{space 1}    4.78{col 46}{space 3}0.000{col 54}{space 4} .0009553{col 67}{space 3} .0023196
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1763.726{col 26}{space 2} 773.0671{col 37}{space 1}    2.28{col 46}{space 3}0.031{col 54}{space 4} 178.5658{col 67}{space 3} 3348.886
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.2246
{txt}{col 49}Largest FMI{col 67}= {res}    0.5446
{txt}{col 49}Complete DF{col 67}= {res}        79
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     11.84
{txt}{col 49}        avg{col 67}= {res}     50.41
{txt}{col 49}        max{col 67}= {res}     75.58
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   70.2{txt}){col 67}= {res}      5.94
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-64.18527{col 26}{space 2}   52.944{col 37}{space 1}   -1.21{col 46}{space 3}0.229{col 54}{space 4}-169.6419{col 67}{space 3}  41.2714
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-26.73066{col 26}{space 2} 82.34018{col 37}{space 1}   -0.32{col 46}{space 3}0.746{col 54}{space 4}-190.7774{col 67}{space 3} 137.3161
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-5.350199{col 26}{space 2} 3.934493{col 37}{space 1}   -1.36{col 46}{space 3}0.178{col 54}{space 4}-13.18973{col 67}{space 3} 2.489332
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-165.0015{col 26}{space 2} 71.71984{col 37}{space 1}   -2.30{col 46}{space 3}0.024{col 54}{space 4}-307.8667{col 67}{space 3}-22.13643
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0113948{col 26}{space 2}  .053807{col 37}{space 1}    0.21{col 46}{space 3}0.833{col 54}{space 4}-.0958292{col 67}{space 3} .1186188
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-5.433676{col 26}{space 2} 6.810594{col 37}{space 1}   -0.80{col 46}{space 3}0.441{col 54}{space 4}-20.29475{col 67}{space 3} 9.427402
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-3.857931{col 26}{space 2} 4.846492{col 37}{space 1}   -0.80{col 46}{space 3}0.432{col 54}{space 4}-13.74592{col 67}{space 3} 6.030058
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 52.57338{col 26}{space 2} 128.8718{col 37}{space 1}    0.41{col 46}{space 3}0.688{col 54}{space 4}-216.0829{col 67}{space 3} 321.2296
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 6.728576{col 26}{space 2} 20.84761{col 37}{space 1}    0.32{col 46}{space 3}0.750{col 54}{space 4}-36.87499{col 67}{space 3} 50.33214
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0018963{col 26}{space 2} .0003388{col 37}{space 1}    5.60{col 46}{space 3}0.000{col 54}{space 4} .0012212{col 67}{space 3} .0025713
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1865.06{col 26}{space 2} 783.6185{col 37}{space 1}    2.38{col 46}{space 3}0.025{col 54}{space 4} 250.0629{col 67}{space 3} 3480.057
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        88
{txt}{col 49}Average RVI{col 67}= {res}    0.1831
{txt}{col 49}Largest FMI{col 67}= {res}    0.4423
{txt}{col 49}Complete DF{col 67}= {res}        77
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     16.45
{txt}{col 49}        avg{col 67}= {res}     54.26
{txt}{col 49}        max{col 67}= {res}     74.85
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   70.1{txt}){col 67}= {res}      0.82
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.6094

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .0896959{col 26}{space 2} .7714477{col 37}{space 1}    0.12{col 46}{space 3}0.908{col 54}{space 4}-1.447879{col 67}{space 3}  1.62727
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0472652{col 26}{space 2} 1.207239{col 37}{space 1}    0.04{col 46}{space 3}0.969{col 54}{space 4}-2.359389{col 67}{space 3} 2.453919
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0725272{col 26}{space 2} .0563743{col 37}{space 1}    1.29{col 46}{space 3}0.202{col 54}{space 4}-.0397908{col 67}{space 3} .1848452
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.9555829{col 26}{space 2} 1.033125{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-3.014037{col 67}{space 3} 1.102871
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0000543{col 26}{space 2} .0007747{col 37}{space 1}    0.07{col 46}{space 3}0.944{col 54}{space 4}-.0014899{col 67}{space 3} .0015984
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0378177{col 26}{space 2} .0907006{col 37}{space 1}    0.42{col 46}{space 3}0.682{col 54}{space 4}-.1540295{col 67}{space 3}  .229665
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}  .061598{col 26}{space 2} .0733501{col 37}{space 1}    0.84{col 46}{space 3}0.409{col 54}{space 4}-.0890414{col 67}{space 3} .2122374
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} .9027851{col 26}{space 2} 1.758466{col 37}{space 1}    0.51{col 46}{space 3}0.611{col 54}{space 4}-2.674317{col 67}{space 3} 4.479887
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} .1680118{col 26}{space 2} .2714438{col 37}{space 1}    0.62{col 46}{space 3}0.540{col 54}{space 4}-.3817682{col 67}{space 3} .7177918
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.75e-07{col 26}{space 2} 4.85e-06{col 37}{space 1}    0.08{col 46}{space 3}0.939{col 54}{space 4}-9.29e-06{col 67}{space 3}   .00001
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.426278{col 26}{space 2}  10.6201{col 37}{space 1}   -0.32{col 46}{space 3}0.749{col 54}{space 4}-24.84766{col 67}{space 3}  17.9951
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0264
{txt}{col 49}Largest FMI{col 67}= {res}    0.1151
{txt}{col 49}Complete DF{col 67}= {res}       112
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     76.31
{txt}{col 49}        avg{col 67}= {res}    103.69
{txt}{col 49}        max{col 67}= {res}    110.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  109.7{txt}){col 67}= {res}      8.75
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-148.2941{col 26}{space 2} 63.17118{col 37}{space 1}   -2.35{col 46}{space 3}0.021{col 54}{space 4}-273.4848{col 67}{space 3}-23.10351
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-85.88111{col 26}{space 2} 80.12936{col 37}{space 1}   -1.07{col 46}{space 3}0.286{col 54}{space 4}-244.6787{col 67}{space 3}  72.9165
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.651242{col 26}{space 2} 3.798191{col 37}{space 1}   -0.43{col 46}{space 3}0.665{col 54}{space 4}-9.178364{col 67}{space 3}  5.87588
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-34.84894{col 26}{space 2} 69.28068{col 37}{space 1}   -0.50{col 46}{space 3}0.616{col 54}{space 4}-172.1538{col 67}{space 3}  102.456
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0057101{col 26}{space 2} .0445763{col 37}{space 1}    0.13{col 46}{space 3}0.898{col 54}{space 4}-.0826309{col 67}{space 3}  .094051
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 4.487381{col 26}{space 2}   4.6521{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4} -4.73218{col 67}{space 3} 13.70694
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-.1991145{col 26}{space 2} 3.011364{col 37}{space 1}   -0.07{col 46}{space 3}0.947{col 54}{space 4}-6.193274{col 67}{space 3} 5.795045
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 67.67946{col 26}{space 2} 116.5703{col 37}{space 1}    0.58{col 46}{space 3}0.563{col 54}{space 4}-163.3955{col 67}{space 3} 298.7544
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-3.177737{col 26}{space 2} 15.23193{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-33.51279{col 67}{space 3} 27.15731
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019472{col 26}{space 2} .0002672{col 37}{space 1}    7.29{col 46}{space 3}0.000{col 54}{space 4} .0014176{col 67}{space 3} .0024768
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1122.167{col 26}{space 2} 736.9305{col 37}{space 1}    1.52{col 46}{space 3}0.131{col 54}{space 4}-338.4344{col 67}{space 3} 2582.769
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0225
{txt}{col 49}Largest FMI{col 67}= {res}    0.1025
{txt}{col 49}Complete DF{col 67}= {res}       112
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     80.74
{txt}{col 49}        avg{col 67}= {res}    104.33
{txt}{col 49}        max{col 67}= {res}    110.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  109.8{txt}){col 67}= {res}     10.54
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-95.20646{col 26}{space 2}  66.2453{col 37}{space 1}   -1.44{col 46}{space 3}0.154{col 54}{space 4}-226.4919{col 67}{space 3} 36.07895
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} -133.173{col 26}{space 2} 84.31339{col 37}{space 1}   -1.58{col 46}{space 3}0.117{col 54}{space 4} -300.282{col 67}{space 3} 33.93595
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.3349714{col 26}{space 2} 3.982356{col 37}{space 1}   -0.08{col 46}{space 3}0.933{col 54}{space 4}-8.227187{col 67}{space 3} 7.557245
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-6.017036{col 26}{space 2} 72.46596{col 37}{space 1}   -0.08{col 46}{space 3}0.934{col 54}{space 4}-149.6283{col 67}{space 3} 137.5943
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0198079{col 26}{space 2} .0466759{col 37}{space 1}    0.42{col 46}{space 3}0.672{col 54}{space 4}-.0726927{col 67}{space 3} .1123086
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 5.235073{col 26}{space 2} 4.908071{col 37}{space 1}    1.07{col 46}{space 3}0.289{col 54}{space 4}-4.494005{col 67}{space 3} 14.96415
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-1.935218{col 26}{space 2} 3.146601{col 37}{space 1}   -0.62{col 46}{space 3}0.540{col 54}{space 4}-8.196274{col 67}{space 3} 4.325839
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-41.49771{col 26}{space 2} 122.5583{col 37}{space 1}   -0.34{col 46}{space 3}0.736{col 54}{space 4}-284.4813{col 67}{space 3} 201.4858
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}  5.27367{col 26}{space 2} 15.70658{col 37}{space 1}    0.34{col 46}{space 3}0.738{col 54}{space 4}-25.94235{col 67}{space 3} 36.48969
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0023891{col 26}{space 2} .0002804{col 37}{space 1}    8.52{col 46}{space 3}0.000{col 54}{space 4} .0018334{col 67}{space 3} .0029448
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1111.331{col 26}{space 2} 774.5887{col 37}{space 1}    1.43{col 46}{space 3}0.154{col 54}{space 4}-424.0902{col 67}{space 3} 2646.752
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       121
{txt}{col 49}Average RVI{col 67}= {res}    0.0050
{txt}{col 49}Largest FMI{col 67}= {res}    0.0353
{txt}{col 49}Complete DF{col 67}= {res}       110
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    101.35
{txt}{col 49}        avg{col 67}= {res}    107.20
{txt}{col 49}        max{col 67}= {res}    108.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  108.0{txt}){col 67}= {res}      0.68
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.7442

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .6441998{col 26}{space 2} .8421386{col 37}{space 1}    0.76{col 46}{space 3}0.446{col 54}{space 4}-1.025068{col 67}{space 3} 2.313468
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.2868418{col 26}{space 2} 1.046655{col 37}{space 1}   -0.27{col 46}{space 3}0.785{col 54}{space 4}-2.361521{col 67}{space 3} 1.787838
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0671057{col 26}{space 2} .0509766{col 37}{space 1}    1.32{col 46}{space 3}0.191{col 54}{space 4}-.0339386{col 67}{space 3}   .16815
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.339998{col 26}{space 2} .9136191{col 37}{space 1}    1.47{col 46}{space 3}0.145{col 54}{space 4} -.470986{col 67}{space 3} 3.150981
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0000231{col 26}{space 2} .0005814{col 37}{space 1}    0.04{col 46}{space 3}0.968{col 54}{space 4}-.0011294{col 67}{space 3} .0011757
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0427979{col 26}{space 2} .0612694{col 37}{space 1}    0.70{col 46}{space 3}0.486{col 54}{space 4}-.0786528{col 67}{space 3} .1642487
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}  .003043{col 26}{space 2} .0378453{col 37}{space 1}    0.08{col 46}{space 3}0.936{col 54}{space 4}-.0720287{col 67}{space 3} .0781146
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 1.555542{col 26}{space 2} 1.529917{col 37}{space 1}    1.02{col 46}{space 3}0.312{col 54}{space 4}-1.477257{col 67}{space 3} 4.588342
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} .0746184{col 26}{space 2} .1881876{col 37}{space 1}    0.40{col 46}{space 3}0.693{col 54}{space 4}  -.29841{col 67}{space 3} .4476468
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.19e-06{col 26}{space 2} 3.48e-06{col 37}{space 1}    0.92{col 46}{space 3}0.361{col 54}{space 4}-3.70e-06{col 67}{space 3} .0000101
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-13.19194{col 26}{space 2} 9.694003{col 37}{space 1}   -1.36{col 46}{space 3}0.176{col 54}{space 4}-32.40815{col 67}{space 3}  6.02427
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. **********INTERACTION by Race***************
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0777
{txt}{col 49}Largest FMI{col 67}= {res}    0.2495
{txt}{col 49}Complete DF{col 67}= {res}       200
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     51.07
{txt}{col 49}        avg{col 67}= {res}    146.85
{txt}{col 49}        max{col 67}= {res}    197.89
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  192.7{txt}){col 67}= {res}     13.94
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-148.1326{col 28}{space 2} 57.23751{col 39}{space 1}   -2.59{col 48}{space 3}0.010{col 56}{space 4}-261.0204{col 69}{space 3}-35.24479
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-190.3188{col 28}{space 2} 167.2661{col 39}{space 1}   -1.14{col 48}{space 3}0.257{col 56}{space 4}-520.2095{col 69}{space 3}  139.572
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 58.09044{col 28}{space 2} 71.98682{col 39}{space 1}    0.81{col 48}{space 3}0.421{col 56}{space 4}-83.87781{col 69}{space 3} 200.0587
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-40.09592{col 28}{space 2} 56.72699{col 39}{space 1}   -0.71{col 48}{space 3}0.481{col 56}{space 4}  -151.97{col 69}{space 3} 71.77816
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-3.380375{col 28}{space 2} 2.665286{col 39}{space 1}   -1.27{col 48}{space 3}0.206{col 56}{space 4}-8.636613{col 69}{space 3} 1.875863
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-97.85626{col 28}{space 2} 48.38187{col 39}{space 1}   -2.02{col 48}{space 3}0.044{col 56}{space 4}-193.2707{col 69}{space 3}-2.441814
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0026237{col 28}{space 2} .0334381{col 39}{space 1}   -0.08{col 48}{space 3}0.938{col 56}{space 4}-.0685765{col 69}{space 3} .0633291
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .4548504{col 28}{space 2} 3.747677{col 39}{space 1}    0.12{col 48}{space 3}0.904{col 56}{space 4}-7.053217{col 69}{space 3} 7.962918
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2}-.3693844{col 28}{space 2} 2.603624{col 39}{space 1}   -0.14{col 48}{space 3}0.888{col 56}{space 4}-5.596214{col 69}{space 3} 4.857445
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 63.62493{col 28}{space 2} 86.60413{col 39}{space 1}    0.73{col 48}{space 3}0.465{col 56}{space 4}-109.5395{col 69}{space 3} 236.7893
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-.0996357{col 28}{space 2} 11.41915{col 39}{space 1}   -0.01{col 48}{space 3}0.993{col 56}{space 4}-22.74057{col 69}{space 3} 22.54129
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0017888{col 28}{space 2} .0002024{col 39}{space 1}    8.84{col 48}{space 3}0.000{col 56}{space 4} .0013897{col 69}{space 3} .0021879
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1584.182{col 28}{space 2} 560.0287{col 39}{space 1}    2.83{col 48}{space 3}0.006{col 56}{space 4} 467.8923{col 69}{space 3} 2700.471
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0696
{txt}{col 49}Largest FMI{col 67}= {res}    0.2571
{txt}{col 49}Complete DF{col 67}= {res}       200
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     49.02
{txt}{col 49}        avg{col 67}= {res}    149.31
{txt}{col 49}        max{col 67}= {res}    197.56
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  193.6{txt}){col 67}= {res}     16.08
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-86.54133{col 28}{space 2} 59.47469{col 39}{space 1}   -1.46{col 48}{space 3}0.147{col 56}{space 4}-203.8442{col 69}{space 3} 30.76154
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-133.9905{col 28}{space 2} 174.5668{col 39}{space 1}   -0.77{col 48}{space 3}0.444{col 56}{space 4}-478.3395{col 69}{space 3} 210.3586
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 23.64295{col 28}{space 2} 74.93432{col 39}{space 1}    0.32{col 48}{space 3}0.753{col 56}{space 4}-124.1477{col 69}{space 3} 171.4335
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-83.88428{col 28}{space 2} 59.17952{col 39}{space 1}   -1.42{col 48}{space 3}0.158{col 56}{space 4}-200.6106{col 69}{space 3}   32.842
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2.899276{col 28}{space 2} 2.761891{col 39}{space 1}   -1.05{col 48}{space 3}0.295{col 56}{space 4}-8.345848{col 69}{space 3} 2.547296
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-84.29094{col 28}{space 2} 50.13407{col 39}{space 1}   -1.68{col 48}{space 3}0.094{col 56}{space 4}-183.1576{col 69}{space 3} 14.57569
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0096711{col 28}{space 2} .0346045{col 39}{space 1}    0.28{col 48}{space 3}0.780{col 56}{space 4}-.0585758{col 69}{space 3} .0779181
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .1261101{col 28}{space 2}  3.94298{col 39}{space 1}    0.03{col 48}{space 3}0.975{col 56}{space 4}-7.797539{col 69}{space 3} 8.049759
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2}-2.676906{col 28}{space 2} 2.466681{col 39}{space 1}   -1.09{col 48}{space 3}0.280{col 56}{space 4}-7.551588{col 69}{space 3} 2.197775
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} .0331382{col 28}{space 2} 90.11204{col 39}{space 1}    0.00{col 48}{space 3}1.000{col 56}{space 4}-180.2259{col 69}{space 3} 180.2922
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} 4.727913{col 28}{space 2} 12.31299{col 39}{space 1}    0.38{col 48}{space 3}0.702{col 56}{space 4}-19.84707{col 69}{space 3}  29.3029
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2}  .002158{col 28}{space 2} .0002108{col 39}{space 1}   10.24{col 48}{space 3}0.000{col 56}{space 4} .0017423{col 69}{space 3} .0025737
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1571.443{col 28}{space 2} 588.6084{col 39}{space 1}    2.67{col 48}{space 3}0.010{col 56}{space 4} 395.3001{col 69}{space 3} 2747.586
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       209
{txt}{col 49}Average RVI{col 67}= {res}    0.0582
{txt}{col 49}Largest FMI{col 67}= {res}    0.3077
{txt}{col 49}Complete DF{col 67}= {res}       196
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     37.57
{txt}{col 49}        avg{col 67}= {res}    161.53
{txt}{col 49}        max{col 67}= {res}    193.52
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  190.9{txt}){col 67}= {res}      0.92
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.5252

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} .5008061{col 28}{space 2} .7880189{col 39}{space 1}    0.64{col 48}{space 3}0.526{col 56}{space 4}-1.053517{col 69}{space 3}  2.05513
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.594102{col 28}{space 2} 2.282194{col 39}{space 1}    0.70{col 48}{space 3}0.486{col 56}{space 4}-2.907397{col 69}{space 3} 6.095601
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.2972111{col 28}{space 2} .9876069{col 39}{space 1}   -0.30{col 48}{space 3}0.764{col 56}{space 4}-2.245119{col 69}{space 3} 1.650697
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-.0375505{col 28}{space 2} .7764759{col 39}{space 1}   -0.05{col 48}{space 3}0.961{col 56}{space 4}-1.569366{col 69}{space 3} 1.494265
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0787186{col 28}{space 2}  .036571{col 39}{space 1}    2.15{col 48}{space 3}0.033{col 56}{space 4} .0065894{col 69}{space 3} .1508478
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .1790051{col 28}{space 2} .6593589{col 39}{space 1}    0.27{col 48}{space 3}0.786{col 56}{space 4}-1.121452{col 69}{space 3} 1.479462
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0000502{col 28}{space 2} .0004483{col 39}{space 1}   -0.11{col 48}{space 3}0.911{col 56}{space 4}-.0009344{col 69}{space 3}  .000834
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0386314{col 28}{space 2} .0531442{col 39}{space 1}    0.73{col 48}{space 3}0.472{col 56}{space 4}-.0689942{col 69}{space 3} .1462571
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} .0202413{col 28}{space 2} .0319403{col 39}{space 1}    0.63{col 48}{space 3}0.527{col 56}{space 4}-.0428313{col 69}{space 3}  .083314
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 1.192804{col 28}{space 2} 1.130494{col 39}{space 1}    1.06{col 48}{space 3}0.294{col 56}{space 4}-1.047003{col 69}{space 3} 3.432611
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} .1345159{col 28}{space 2} .1515756{col 39}{space 1}    0.89{col 48}{space 3}0.376{col 56}{space 4} -.165242{col 69}{space 3} .4342737
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 1.53e-06{col 28}{space 2} 2.74e-06{col 39}{space 1}    0.56{col 48}{space 3}0.576{col 56}{space 4}-3.87e-06{col 69}{space 3} 6.93e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} -8.85183{col 28}{space 2} 7.346463{col 39}{space 1}   -1.20{col 48}{space 3}0.231{col 56}{space 4}-23.40102{col 69}{space 3} 5.697359
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. ***********MODEL 6: MODEL 2+lifestyle/health-related factors*******  
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.0814
{txt}{col 49}Largest FMI{col 67}= {res}    0.4809
{txt}{col 49}Complete DF{col 67}= {res}        80
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     14.63
{txt}{col 49}        avg{col 67}= {res}     69.77
{txt}{col 49}        max{col 67}= {res}     77.94
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   76.2{txt}){col 67}= {res}      6.96
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-87.19164{col 26}{space 2} 52.63951{col 37}{space 1}   -1.66{col 46}{space 3}0.102{col 54}{space 4}-192.0205{col 67}{space 3} 17.63719
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 15.25538{col 26}{space 2} 80.99892{col 37}{space 1}    0.19{col 46}{space 3}0.851{col 54}{space 4}-146.0364{col 67}{space 3} 176.5472
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -5.74178{col 26}{space 2} 3.845661{col 37}{space 1}   -1.49{col 46}{space 3}0.140{col 54}{space 4}-13.40054{col 67}{space 3} 1.916985
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-171.2276{col 26}{space 2} 70.42902{col 37}{space 1}   -2.43{col 46}{space 3}0.017{col 54}{space 4}-311.4428{col 67}{space 3} -31.0124
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0053489{col 26}{space 2} .0518262{col 37}{space 1}    0.10{col 46}{space 3}0.918{col 54}{space 4}-.0978325{col 67}{space 3} .1085302
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-5.413891{col 26}{space 2} 6.232742{col 37}{space 1}   -0.87{col 46}{space 3}0.399{col 54}{space 4}-18.72776{col 67}{space 3} 7.899981
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-61.61121{col 26}{space 2} 68.11587{col 37}{space 1}   -0.90{col 46}{space 3}0.369{col 54}{space 4}-197.4099{col 67}{space 3} 74.18749
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-14.38815{col 26}{space 2} 38.88681{col 37}{space 1}   -0.37{col 46}{space 3}0.712{col 54}{space 4}-91.81344{col 67}{space 3} 63.03713
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0016896{col 26}{space 2}  .000337{col 37}{space 1}    5.01{col 46}{space 3}0.000{col 54}{space 4} .0010186{col 67}{space 3} .0023606
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2119.997{col 26}{space 2} 444.1749{col 37}{space 1}    4.77{col 46}{space 3}0.000{col 54}{space 4} 1234.239{col 67}{space 3} 3005.756
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        90
{txt}{col 49}Average RVI{col 67}= {res}    0.0963
{txt}{col 49}Largest FMI{col 67}= {res}    0.5354
{txt}{col 49}Complete DF{col 67}= {res}        80
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     12.24
{txt}{col 49}        avg{col 67}= {res}     69.48
{txt}{col 49}        max{col 67}= {res}     77.91
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   75.6{txt}){col 67}= {res}      7.41
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-59.20969{col 26}{space 2} 52.56775{col 37}{space 1}   -1.13{col 46}{space 3}0.264{col 54}{space 4}-163.9005{col 67}{space 3} 45.48112
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-16.77893{col 26}{space 2} 80.92051{col 37}{space 1}   -0.21{col 46}{space 3}0.836{col 54}{space 4}-177.9246{col 67}{space 3} 144.3667
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.320528{col 26}{space 2}  3.84011{col 37}{space 1}   -1.65{col 46}{space 3}0.104{col 54}{space 4}-13.96858{col 67}{space 3} 1.327524
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-161.8429{col 26}{space 2} 70.27892{col 37}{space 1}   -2.30{col 46}{space 3}0.024{col 54}{space 4}  -301.76{col 67}{space 3}-21.92593
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0173355{col 26}{space 2} .0517173{col 37}{space 1}    0.34{col 46}{space 3}0.738{col 54}{space 4}-.0856297{col 67}{space 3} .1203006
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-6.155502{col 26}{space 2} 6.506755{col 37}{space 1}   -0.95{col 46}{space 3}0.362{col 54}{space 4}-20.30149{col 67}{space 3} 7.990486
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-74.37055{col 26}{space 2} 67.34404{col 37}{space 1}   -1.10{col 46}{space 3}0.273{col 54}{space 4}-208.5356{col 67}{space 3} 59.79455
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-1.139316{col 26}{space 2} 38.82785{col 37}{space 1}   -0.03{col 46}{space 3}0.977{col 54}{space 4}-78.44948{col 67}{space 3} 76.17085
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0018969{col 26}{space 2} .0003364{col 37}{space 1}    5.64{col 46}{space 3}0.000{col 54}{space 4} .0012272{col 67}{space 3} .0025665
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2095.943{col 26}{space 2} 446.0741{col 37}{space 1}    4.70{col 46}{space 3}0.000{col 54}{space 4} 1205.808{col 67}{space 3} 2986.078
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        88
{txt}{col 49}Average RVI{col 67}= {res}    0.1467
{txt}{col 49}Largest FMI{col 67}= {res}    0.5466
{txt}{col 49}Complete DF{col 67}= {res}        78
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     11.72
{txt}{col 49}        avg{col 67}= {res}     62.18
{txt}{col 49}        max{col 67}= {res}     75.85
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   71.3{txt}){col 67}= {res}      1.01
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.4384

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .0721262{col 26}{space 2} .7613145{col 37}{space 1}    0.09{col 46}{space 3}0.925{col 54}{space 4}-1.444987{col 67}{space 3}  1.58924
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .1762242{col 26}{space 2} 1.168247{col 37}{space 1}    0.15{col 46}{space 3}0.881{col 54}{space 4}-2.151167{col 67}{space 3} 2.503616
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0801304{col 26}{space 2} .0553385{col 37}{space 1}    1.45{col 46}{space 3}0.152{col 54}{space 4} -.030165{col 67}{space 3} .1904259
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-1.136665{col 26}{space 2} 1.012666{col 37}{space 1}   -1.12{col 46}{space 3}0.265{col 54}{space 4}-3.153628{col 67}{space 3} .8802986
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0001545{col 26}{space 2} .0007395{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-.0016275{col 67}{space 3} .0013184
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0235022{col 26}{space 2} .0940622{col 37}{space 1}    0.25{col 46}{space 3}0.807{col 54}{space 4}-.1819804{col 67}{space 3} .2289847
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-.1619498{col 26}{space 2} 1.199817{col 37}{space 1}   -0.13{col 46}{space 3}0.894{col 54}{space 4}-2.679275{col 67}{space 3} 2.355376
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-.8667919{col 26}{space 2} .5552508{col 37}{space 1}   -1.56{col 46}{space 3}0.123{col 54}{space 4}-1.972869{col 67}{space 3} .2392854
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.56e-06{col 26}{space 2} 4.87e-06{col 37}{space 1}    0.53{col 46}{space 3}0.601{col 54}{space 4}-7.14e-06{col 67}{space 3} .0000123
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.585352{col 26}{space 2} 6.313876{col 37}{space 1}    0.25{col 46}{space 3}0.802{col 54}{space 4} -11.0066{col 67}{space 3}  14.1773
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0051
{txt}{col 49}Largest FMI{col 67}= {res}    0.0430
{txt}{col 49}Complete DF{col 67}= {res}       113
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    101.86
{txt}{col 49}        avg{col 67}= {res}    110.00
{txt}{col 49}        max{col 67}= {res}    111.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  111.0{txt}){col 67}= {res}     10.09
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-148.3197{col 26}{space 2} 62.48762{col 37}{space 1}   -2.37{col 46}{space 3}0.019{col 54}{space 4}-272.1429{col 67}{space 3}-24.49656
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-72.40147{col 26}{space 2} 76.94867{col 37}{space 1}   -0.94{col 46}{space 3}0.349{col 54}{space 4}-224.8818{col 67}{space 3} 80.07886
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.559473{col 26}{space 2} 3.789944{col 37}{space 1}   -0.41{col 46}{space 3}0.682{col 54}{space 4}-9.069509{col 67}{space 3} 5.950564
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-20.69627{col 26}{space 2} 70.87215{col 37}{space 1}   -0.29{col 46}{space 3}0.771{col 54}{space 4}-161.1354{col 67}{space 3} 119.7429
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0089965{col 26}{space 2} .0442792{col 37}{space 1}   -0.20{col 46}{space 3}0.839{col 54}{space 4}-.0967397{col 67}{space 3} .0787466
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 4.731178{col 26}{space 2} 4.537579{col 37}{space 1}    1.04{col 46}{space 3}0.299{col 54}{space 4} -4.26058{col 67}{space 3} 13.72294
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}  49.0725{col 26}{space 2} 84.76209{col 37}{space 1}    0.58{col 46}{space 3}0.564{col 54}{space 4}-119.0555{col 67}{space 3} 217.2005
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 22.53357{col 26}{space 2} 38.13462{col 37}{space 1}    0.59{col 46}{space 3}0.556{col 54}{space 4}-53.03244{col 67}{space 3} 98.09959
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019429{col 26}{space 2} .0002657{col 37}{space 1}    7.31{col 46}{space 3}0.000{col 54}{space 4} .0014163{col 67}{space 3} .0024695
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1330.61{col 26}{space 2} 444.5569{col 37}{space 1}    2.99{col 46}{space 3}0.003{col 54}{space 4} 449.6651{col 67}{space 3} 2211.555
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       123
{txt}{col 49}Average RVI{col 67}= {res}    0.0060
{txt}{col 49}Largest FMI{col 67}= {res}    0.0447
{txt}{col 49}Complete DF{col 67}= {res}       113
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    101.34
{txt}{col 49}        avg{col 67}= {res}    109.71
{txt}{col 49}        max{col 67}= {res}    111.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  111.0{txt}){col 67}= {res}     11.90
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-92.80683{col 26}{space 2} 65.72525{col 37}{space 1}   -1.41{col 46}{space 3}0.161{col 54}{space 4}-223.0461{col 67}{space 3} 37.43248
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-134.8862{col 26}{space 2} 80.91626{col 37}{space 1}   -1.67{col 46}{space 3}0.098{col 54}{space 4}-295.2285{col 67}{space 3} 25.45604
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.1573398{col 26}{space 2} 3.985997{col 37}{space 1}   -0.04{col 46}{space 3}0.969{col 54}{space 4} -8.05589{col 67}{space 3} 7.741211
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 7.171321{col 26}{space 2} 74.53982{col 37}{space 1}    0.10{col 46}{space 3}0.924{col 54}{space 4}-140.5361{col 67}{space 3} 154.8788
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0221674{col 26}{space 2} .0465525{col 37}{space 1}    0.48{col 46}{space 3}0.635{col 54}{space 4}  -.07008{col 67}{space 3} .1144148
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 6.375049{col 26}{space 2} 4.795875{col 37}{space 1}    1.33{col 46}{space 3}0.187{col 54}{space 4}-3.130069{col 67}{space 3} 15.88017
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 38.40138{col 26}{space 2} 89.21136{col 37}{space 1}    0.43{col 46}{space 3}0.668{col 54}{space 4}-138.5627{col 67}{space 3} 215.3655
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 4.670899{col 26}{space 2} 40.10404{col 37}{space 1}    0.12{col 46}{space 3}0.907{col 54}{space 4}-74.79769{col 67}{space 3} 84.13949
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0024046{col 26}{space 2} .0002795{col 37}{space 1}    8.60{col 46}{space 3}0.000{col 54}{space 4} .0018507{col 67}{space 3} .0029585
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   790.12{col 26}{space 2} 468.6843{col 37}{space 1}    1.69{col 46}{space 3}0.095{col 54}{space 4}-138.7042{col 67}{space 3} 1718.944
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       121
{txt}{col 49}Average RVI{col 67}= {res}    0.0042
{txt}{col 49}Largest FMI{col 67}= {res}    0.0338
{txt}{col 49}Complete DF{col 67}= {res}       111
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    102.66
{txt}{col 49}        avg{col 67}= {res}    108.35
{txt}{col 49}        max{col 67}= {res}    109.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  109.0{txt}){col 67}= {res}      0.68
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.7220

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .5446115{col 26}{space 2}  .838675{col 37}{space 1}    0.65{col 46}{space 3}0.517{col 54}{space 4}-1.117608{col 67}{space 3} 2.206831
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.0179147{col 26}{space 2} 1.006461{col 37}{space 1}   -0.02{col 46}{space 3}0.986{col 54}{space 4}-2.012682{col 67}{space 3} 1.976853
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0594003{col 26}{space 2} .0510621{col 37}{space 1}    1.16{col 46}{space 3}0.247{col 54}{space 4}-.0418033{col 67}{space 3}  .160604
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.175133{col 26}{space 2}  .932822{col 37}{space 1}    1.26{col 46}{space 3}0.210{col 54}{space 4} -.673681{col 67}{space 3} 3.023946
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0000297{col 26}{space 2} .0005777{col 37}{space 1}   -0.05{col 46}{space 3}0.959{col 54}{space 4}-.0011747{col 67}{space 3} .0011152
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0152453{col 26}{space 2} .0596018{col 37}{space 1}    0.26{col 46}{space 3}0.799{col 54}{space 4}-.1028839{col 67}{space 3} .1333745
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-.5275723{col 26}{space 2} 1.102852{col 37}{space 1}   -0.48{col 46}{space 3}0.633{col 54}{space 4}-2.714906{col 67}{space 3} 1.659762
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-.2913732{col 26}{space 2} .5026866{col 37}{space 1}   -0.58{col 46}{space 3}0.563{col 54}{space 4}-1.287679{col 67}{space 3} .7049329
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.62e-06{col 26}{space 2} 3.47e-06{col 37}{space 1}    0.76{col 46}{space 3}0.451{col 54}{space 4}-4.25e-06{col 67}{space 3} 9.50e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.289228{col 26}{space 2} 5.807622{col 37}{space 1}   -0.57{col 46}{space 3}0.572{col 54}{space 4}    -14.8{col 67}{space 3} 8.221543
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. ******************INTERACTION by Race***********************
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0248
{txt}{col 49}Largest FMI{col 67}= {res}    0.2012
{txt}{col 49}Complete DF{col 67}= {res}       201
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     67.49
{txt}{col 49}        avg{col 67}= {res}    183.44
{txt}{col 49}        max{col 67}= {res}    199.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  198.3{txt}){col 67}= {res}     15.97
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-151.8493{col 28}{space 2} 56.87893{col 39}{space 1}   -2.67{col 48}{space 3}0.008{col 56}{space 4}-264.0186{col 69}{space 3}-39.67995
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-204.1951{col 28}{space 2} 162.7964{col 39}{space 1}   -1.25{col 48}{space 3}0.211{col 56}{space 4} -525.224{col 69}{space 3} 116.8339
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 65.63982{col 28}{space 2} 71.22578{col 39}{space 1}    0.92{col 48}{space 3}0.358{col 56}{space 4}-74.81597{col 69}{space 3} 206.0956
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} -32.3671{col 28}{space 2} 55.40964{col 39}{space 1}   -0.58{col 48}{space 3}0.560{col 56}{space 4}-141.6367{col 69}{space 3} 76.90255
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-3.645663{col 28}{space 2} 2.654481{col 39}{space 1}   -1.37{col 48}{space 3}0.171{col 56}{space 4}  -8.8802{col 69}{space 3} 1.588875
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-98.19598{col 28}{space 2} 48.57639{col 39}{space 1}   -2.02{col 48}{space 3}0.045{col 56}{space 4}-193.9871{col 69}{space 3} -2.40488
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0068093{col 28}{space 2} .0328918{col 39}{space 1}   -0.21{col 48}{space 3}0.836{col 56}{space 4}-.0716706{col 69}{space 3}  .058052
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}-.1890762{col 28}{space 2} 3.583792{col 39}{space 1}   -0.05{col 48}{space 3}0.958{col 56}{space 4}-7.341405{col 69}{space 3} 6.963253
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-7.372719{col 28}{space 2}  53.5105{col 39}{space 1}   -0.14{col 48}{space 3}0.891{col 56}{space 4}-113.0372{col 69}{space 3} 98.29172
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 2.036576{col 28}{space 2} 26.70682{col 39}{space 1}    0.08{col 48}{space 3}0.939{col 56}{space 4}-50.62812{col 69}{space 3} 54.70127
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0017742{col 28}{space 2} .0002029{col 39}{space 1}    8.74{col 48}{space 3}0.000{col 56}{space 4} .0013741{col 69}{space 3} .0021743
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1905.243{col 28}{space 2} 321.8969{col 39}{space 1}    5.92{col 48}{space 3}0.000{col 56}{space 4} 1270.163{col 69}{space 3} 2540.323
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       213
{txt}{col 49}Average RVI{col 67}= {res}    0.0245
{txt}{col 49}Largest FMI{col 67}= {res}    0.2183
{txt}{col 49}Complete DF{col 67}= {res}       201
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     61.01
{txt}{col 49}        avg{col 67}= {res}    184.84
{txt}{col 49}        max{col 67}= {res}    199.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  198.3{txt}){col 67}= {res}     18.21
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-90.05859{col 28}{space 2} 59.16448{col 39}{space 1}   -1.52{col 48}{space 3}0.130{col 56}{space 4}-206.7363{col 69}{space 3} 26.61913
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-112.6749{col 28}{space 2} 169.2704{col 39}{space 1}   -0.67{col 48}{space 3}0.506{col 56}{space 4}-446.4706{col 69}{space 3} 221.1208
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 26.65382{col 28}{space 2} 74.06117{col 39}{space 1}    0.36{col 48}{space 3}0.719{col 56}{space 4}-119.3935{col 69}{space 3} 172.7012
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-82.09158{col 28}{space 2} 57.61156{col 39}{space 1}   -1.42{col 48}{space 3}0.156{col 56}{space 4}-195.7035{col 69}{space 3} 31.52039
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-3.273106{col 28}{space 2} 2.759585{col 39}{space 1}   -1.19{col 48}{space 3}0.237{col 56}{space 4}-8.714897{col 69}{space 3} 2.168685
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-80.03161{col 28}{space 2} 50.48973{col 39}{space 1}   -1.59{col 48}{space 3}0.115{col 56}{space 4}-179.5954{col 69}{space 3} 19.53214
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}  .014484{col 28}{space 2} .0342094{col 39}{space 1}    0.42{col 48}{space 3}0.672{col 56}{space 4}-.0529757{col 69}{space 3} .0819437
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .3261312{col 28}{space 2} 3.761042{col 39}{space 1}    0.09{col 48}{space 3}0.931{col 56}{space 4}  -7.1945{col 69}{space 3} 7.846762
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-23.96903{col 28}{space 2} 54.76901{col 39}{space 1}   -0.44{col 48}{space 3}0.662{col 56}{space 4}-132.0135{col 69}{space 3} 84.07545
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-4.568413{col 28}{space 2} 27.76623{col 39}{space 1}   -0.16{col 48}{space 3}0.869{col 56}{space 4}-59.32219{col 69}{space 3} 50.18536
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2}  .002149{col 28}{space 2}  .000211{col 39}{space 1}   10.19{col 48}{space 3}0.000{col 56}{space 4}  .001733{col 69}{space 3} .0025651
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1542.423{col 28}{space 2} 334.8339{col 39}{space 1}    4.61{col 48}{space 3}0.000{col 56}{space 4} 881.8041{col 69}{space 3} 2203.042
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       209
{txt}{col 49}Average RVI{col 67}= {res}    0.0718
{txt}{col 49}Largest FMI{col 67}= {res}    0.3382
{txt}{col 49}Complete DF{col 67}= {res}       197
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     32.51
{txt}{col 49}        avg{col 67}= {res}    164.04
{txt}{col 49}        max{col 67}= {res}    194.78
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  190.0{txt}){col 67}= {res}      1.03
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.4186

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} .4119713{col 28}{space 2} .7839072{col 39}{space 1}    0.53{col 48}{space 3}0.600{col 56}{space 4}-1.134198{col 69}{space 3} 1.958141
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.118762{col 28}{space 2} 2.223193{col 39}{space 1}    0.50{col 48}{space 3}0.615{col 56}{space 4}-3.265859{col 69}{space 3} 5.503384
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.2019185{col 28}{space 2} .9792897{col 39}{space 1}   -0.21{col 48}{space 3}0.837{col 56}{space 4}-2.133328{col 69}{space 3} 1.729491
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .1844201{col 28}{space 2}  .751004{col 39}{space 1}    0.25{col 48}{space 3}0.806{col 56}{space 4}-1.296884{col 69}{space 3} 1.665724
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0765423{col 28}{space 2}   .03641{col 39}{space 1}    2.10{col 48}{space 3}0.037{col 56}{space 4}  .004732{col 69}{space 3} .1483525
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-.0028986{col 28}{space 2} .6605833{col 39}{space 1}   -0.00{col 48}{space 3}0.997{col 56}{space 4}-1.305747{col 69}{space 3}  1.29995
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0000766{col 28}{space 2} .0004418{col 39}{space 1}   -0.17{col 48}{space 3}0.863{col 56}{space 4} -.000948{col 69}{space 3} .0007948
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0150887{col 28}{space 2} .0523412{col 39}{space 1}    0.29{col 48}{space 3}0.775{col 56}{space 4} -.091461{col 69}{space 3} .1216384
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-.2839534{col 28}{space 2} .8268681{col 39}{space 1}   -0.34{col 48}{space 3}0.733{col 56}{space 4}-1.959491{col 69}{space 3} 1.391584
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-.5899437{col 28}{space 2}  .360704{col 39}{space 1}   -1.64{col 48}{space 3}0.104{col 56}{space 4}-1.301334{col 69}{space 3} .1214463
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 1.84e-06{col 28}{space 2} 2.73e-06{col 39}{space 1}    0.67{col 48}{space 3}0.501{col 56}{space 4}-3.54e-06{col 69}{space 3} 7.22e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-.8541706{col 28}{space 2} 4.396429{col 39}{space 1}   -0.19{col 48}{space 3}0.846{col 56}{space 4} -9.53904{col 69}{space 3} 7.830699
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
.   
. 
. capture log close
{smcl}
{com}{sf}{ul off}