{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. /////////////////////////////////////////////////TABLE S6: TOTAL AND GM/WM VOLUMES VS. NFL exposures by Race***********************
> ////////////////////////////////////////LnNFLw1 EXPOSURE/////////////////////////////////////////////
> 
. 
. ***********************LnNFLw1, MODELS 1 AND 2*********************
. 
. *********************AFRICAN-AMERICAN*******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(5, 68)        = {res}     9.53
{txt}       Model {c |} {res} 3.4822e+11         5  6.9645e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 4.9710e+11        68  7.3103e+09   {txt}R-squared       ={res}    0.4119
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3687
{txt}       Total {c |} {res} 8.4533e+11        73  1.1580e+10   {txt}Root MSE        =   {res}  85501

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-42535.45{col 26}{space 2} 23258.38{col 37}{space 1}   -1.83{col 46}{space 3}0.072{col 67}{space 3}-.2105178
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}   120983{col 26}{space 2} 20208.33{col 37}{space 1}    5.99{col 46}{space 3}0.000{col 67}{space 3} .5641121
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1306.639{col 26}{space 2} 1352.385{col 37}{space 1}   -0.97{col 46}{space 3}0.337{col 67}{space 3}-.1186214
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 16052.84{col 26}{space 2} 24304.45{col 37}{space 1}    0.66{col 46}{space 3}0.511{col 67}{space 3} .0733211
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-25.32543{col 26}{space 2} 19.42361{col 37}{space 1}   -1.30{col 46}{space 3}0.197{col 67}{space 3}-.1353998
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1097427{col 26}{space 2} 78208.34{col 37}{space 1}   14.03{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(5, 68)        = {res}     9.94
{txt}       Model {c |} {res} 1.1791e+11         5  2.3583e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.6127e+11        68  2.3716e+09   {txt}R-squared       ={res}    0.4223
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3799
{txt}       Total {c |} {res} 2.7919e+11        73  3.8245e+09   {txt}Root MSE        =   {res}  48700

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-25503.28{col 26}{space 2} 13247.54{col 37}{space 1}   -1.93{col 46}{space 3}0.058{col 67}{space 3}-.2196344
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 61754.34{col 26}{space 2} 11510.29{col 37}{space 1}    5.37{col 46}{space 3}0.000{col 67}{space 3} .5010429
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1488.963{col 26}{space 2} 770.2936{col 37}{space 1}   -1.93{col 46}{space 3}0.057{col 67}{space 3} -.235211
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 8509.668{col 26}{space 2} 13843.37{col 37}{space 1}    0.61{col 46}{space 3}0.541{col 67}{space 3} .0676326
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-13.25984{col 26}{space 2} 11.06333{col 37}{space 1}   -1.20{col 46}{space 3}0.235{col 67}{space 3}-.1233577
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 658339.5{col 26}{space 2} 44546.02{col 37}{space 1}   14.78{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(5, 68)        = {res}     6.70
{txt}       Model {c |} {res} 5.2557e+10         5  1.0511e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.0668e+11        68  1.5688e+09   {txt}R-squared       ={res}    0.3301
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2808
{txt}       Total {c |} {res} 1.5924e+11        73  2.1813e+09   {txt}Root MSE        =   {res}  39609

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-15747.37{col 26}{space 2} 10774.57{col 37}{space 1}   -1.46{col 46}{space 3}0.148{col 67}{space 3}-.1795703
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  48701.5{col 26}{space 2} 9361.622{col 37}{space 1}    5.20{col 46}{space 3}0.000{col 67}{space 3} .5232051
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-355.5624{col 26}{space 2} 626.5001{col 37}{space 1}   -0.57{col 46}{space 3}0.572{col 67}{space 3}-.0743724
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 439.4448{col 26}{space 2} 11259.17{col 37}{space 1}    0.04{col 46}{space 3}0.969{col 67}{space 3} .0046246
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-9.002087{col 26}{space 2} 8.998096{col 37}{space 1}   -1.00{col 46}{space 3}0.321{col 67}{space 3}-.1108902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 439051.2{col 26}{space 2} 36230.45{col 37}{space 1}   12.12{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        67
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     65.09
{txt}{col 49}        avg{col 67}= {res}     65.09
{txt}{col 49}        max{col 67}= {res}     65.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   65.1{txt}){col 67}= {res}      7.85
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-47310.55{col 26}{space 2} 27614.78{col 37}{space 1}   -1.71{col 46}{space 3}0.091{col 54}{space 4}-102459.7{col 67}{space 3} 7838.593
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 120096.8{col 26}{space 2} 20523.17{col 37}{space 1}    5.85{col 46}{space 3}0.000{col 54}{space 4}  79110.2{col 67}{space 3} 161083.4
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1054.518{col 26}{space 2} 1565.582{col 37}{space 1}   -0.67{col 46}{space 3}0.503{col 54}{space 4}-4181.124{col 67}{space 3} 2072.087
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}  17039.7{col 26}{space 2} 24652.21{col 37}{space 1}    0.69{col 46}{space 3}0.492{col 54}{space 4}-32192.92{col 67}{space 3} 66272.33
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-25.66434{col 26}{space 2} 19.58012{col 37}{space 1}   -1.31{col 46}{space 3}0.195{col 54}{space 4}-64.76756{col 67}{space 3} 13.43887
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-623.7501{col 26}{space 2} 1912.759{col 37}{space 1}   -0.33{col 46}{space 3}0.745{col 54}{space 4}-4443.699{col 67}{space 3} 3196.199
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1113610{col 26}{space 2} 93062.34{col 37}{space 1}   11.97{col 46}{space 3}0.000{col 54}{space 4}   927756{col 67}{space 3}  1299463
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        67
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     65.09
{txt}{col 49}        avg{col 67}= {res}     65.09
{txt}{col 49}        max{col 67}= {res}     65.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   65.1{txt}){col 67}= {res}      8.19
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-27732.84{col 26}{space 2} 15732.96{col 37}{space 1}   -1.76{col 46}{space 3}0.083{col 54}{space 4}-59152.95{col 67}{space 3} 3687.264
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 61340.55{col 26}{space 2} 11692.66{col 37}{space 1}    5.25{col 46}{space 3}0.000{col 54}{space 4} 37989.27{col 67}{space 3} 84691.82
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1371.244{col 26}{space 2} 891.9587{col 37}{space 1}   -1.54{col 46}{space 3}0.129{col 54}{space 4}-3152.564{col 67}{space 3} 410.0759
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 8970.449{col 26}{space 2} 14045.09{col 37}{space 1}    0.64{col 46}{space 3}0.525{col 54}{space 4}-19078.84{col 67}{space 3} 37019.74
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-13.41809{col 26}{space 2} 11.15537{col 37}{space 1}   -1.20{col 46}{space 3}0.233{col 54}{space 4}-35.69635{col 67}{space 3} 8.860178
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-291.2374{col 26}{space 2} 1089.756{col 37}{space 1}   -0.27{col 46}{space 3}0.790{col 54}{space 4}-2467.576{col 67}{space 3} 1885.101
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 665895.3{col 26}{space 2} 53020.38{col 37}{space 1}   12.56{col 46}{space 3}0.000{col 54}{space 4}   560009{col 67}{space 3} 771781.7
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        67
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     65.09
{txt}{col 49}        avg{col 67}= {res}     65.09
{txt}{col 49}        max{col 67}= {res}     65.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   65.1{txt}){col 67}= {res}      5.59
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-19733.88{col 26}{space 2} 12769.86{col 37}{space 1}   -1.55{col 46}{space 3}0.127{col 54}{space 4}-45236.42{col 67}{space 3}  5768.66
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 47961.63{col 26}{space 2}   9490.5{col 37}{space 1}    5.05{col 46}{space 3}0.000{col 54}{space 4} 29008.27{col 67}{space 3}    66915
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-145.0789{col 26}{space 2} 723.9699{col 37}{space 1}   -0.20{col 46}{space 3}0.842{col 54}{space 4} -1590.91{col 67}{space 3} 1300.753
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1263.332{col 26}{space 2} 11399.88{col 37}{space 1}    0.11{col 46}{space 3}0.912{col 54}{space 4}-21503.24{col 67}{space 3}  24029.9
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-9.285027{col 26}{space 2} 9.054405{col 37}{space 1}   -1.03{col 46}{space 3}0.309{col 54}{space 4}-27.36747{col 67}{space 3} 8.797416
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-520.7392{col 26}{space 2} 884.5145{col 37}{space 1}   -0.59{col 46}{space 3}0.558{col 54}{space 4}-2287.193{col 67}{space 3} 1245.714
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 452561.2{col 26}{space 2} 43034.68{col 37}{space 1}   10.52{col 46}{space 3}0.000{col 54}{space 4} 366617.2{col 67}{space 3} 538505.3
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. *********************WHITES******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       105
{txt}{hline 13}{c +}{hline 34}   F(5, 99)        = {res}    16.43
{txt}       Model {c |} {res} 6.5411e+11         5  1.3082e+11   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 7.8841e+11        99  7.9637e+09   {txt}R-squared       ={res}    0.4535
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4258
{txt}       Total {c |} {res} 1.4425e+12       104  1.3870e+10   {txt}Root MSE        =   {res}  89240

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 30269.82{col 26}{space 2} 21335.91{col 37}{space 1}    1.42{col 46}{space 3}0.159{col 67}{space 3} .1277089
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 148834.3{col 26}{space 2} 17744.24{col 37}{space 1}    8.39{col 46}{space 3}0.000{col 67}{space 3} .6300177
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2633.023{col 26}{space 2} 1252.269{col 37}{space 1}   -2.10{col 46}{space 3}0.038{col 67}{space 3}-.1883295
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-17278.76{col 26}{space 2} 21094.65{col 37}{space 1}   -0.82{col 46}{space 3}0.415{col 67}{space 3}-.0644298
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-24.90174{col 26}{space 2} 14.01322{col 37}{space 1}   -1.78{col 46}{space 3}0.079{col 67}{space 3}-.1381031
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1089676{col 26}{space 2} 70300.81{col 37}{space 1}   15.50{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       105
{txt}{hline 13}{c +}{hline 34}   F(5, 99)        = {res}    17.22
{txt}       Model {c |} {res} 1.8270e+11         5  3.6540e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.1009e+11        99  2.1221e+09   {txt}R-squared       ={res}    0.4651
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4381
{txt}       Total {c |} {res} 3.9279e+11       104  3.7768e+09   {txt}Root MSE        =   {res}  46066

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 8545.001{col 26}{space 2} 11013.76{col 37}{space 1}    0.78{col 46}{space 3}0.440{col 67}{space 3} .0690884
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  77822.2{col 26}{space 2}  9159.71{col 37}{space 1}    8.50{col 46}{space 3}0.000{col 67}{space 3} .6312983
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1987.115{col 26}{space 2} 646.4307{col 37}{space 1}   -3.07{col 46}{space 3}0.003{col 67}{space 3}-.2723755
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-10696.16{col 26}{space 2} 10889.22{col 37}{space 1}   -0.98{col 46}{space 3}0.328{col 67}{space 3}-.0764334
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.323755{col 26}{space 2} 7.233728{col 37}{space 1}   -1.15{col 46}{space 3}0.253{col 67}{space 3}-.0884656
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 657112.3{col 26}{space 2}  36289.8{col 37}{space 1}   18.11{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       105
{txt}{hline 13}{c +}{hline 34}   F(5, 99)        = {res}    11.92
{txt}       Model {c |} {res} 1.2119e+11         5  2.4238e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.0136e+11        99  2.0340e+09   {txt}R-squared       ={res}    0.3757
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3442
{txt}       Total {c |} {res} 3.2255e+11       104  3.1015e+09   {txt}Root MSE        =   {res}  45100

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 16599.21{col 26}{space 2} 10782.65{col 37}{space 1}    1.54{col 46}{space 3}0.127{col 67}{space 3} .1481011
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 61565.09{col 26}{space 2} 8967.506{col 37}{space 1}    6.87{col 46}{space 3}0.000{col 67}{space 3}  .551117
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-978.9634{col 26}{space 2} 632.8663{col 37}{space 1}   -1.55{col 46}{space 3}0.125{col 67}{space 3}-.1480777
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-9448.082{col 26}{space 2} 10660.72{col 37}{space 1}   -0.89{col 46}{space 3}0.378{col 67}{space 3}-.0745036
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.33888{col 26}{space 2} 7.081938{col 37}{space 1}   -2.17{col 46}{space 3}0.033{col 67}{space 3}-.1798983
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 429947.3{col 26}{space 2} 35528.31{col 37}{space 1}   12.10{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        98
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     96.06
{txt}{col 49}        avg{col 67}= {res}     96.06
{txt}{col 49}        max{col 67}= {res}     96.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   96.1{txt}){col 67}= {res}     13.63
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  31171.1{col 26}{space 2} 21487.72{col 37}{space 1}    1.45{col 46}{space 3}0.150{col 54}{space 4}-11481.36{col 67}{space 3} 73823.56
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 150016.5{col 26}{space 2} 17959.15{col 37}{space 1}    8.35{col 46}{space 3}0.000{col 54}{space 4} 114368.1{col 67}{space 3} 185664.8
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2598.791{col 26}{space 2} 1258.727{col 37}{space 1}   -2.06{col 46}{space 3}0.042{col 54}{space 4}-5097.324{col 67}{space 3}-100.2582
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-17428.11{col 26}{space 2}  21175.6{col 37}{space 1}   -0.82{col 46}{space 3}0.413{col 54}{space 4}-59461.02{col 67}{space 3}  24604.8
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-23.84633{col 26}{space 2} 14.21536{col 37}{space 1}   -1.68{col 46}{space 3}0.097{col 54}{space 4}-52.06338{col 67}{space 3} 4.370726
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 721.8563{col 26}{space 2} 1407.298{col 37}{space 1}    0.51{col 46}{space 3}0.609{col 54}{space 4}-2071.586{col 67}{space 3} 3515.299
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1061405{col 26}{space 2} 89537.78{col 37}{space 1}   11.85{col 46}{space 3}0.000{col 54}{space 4}   883675{col 67}{space 3}  1239134
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        98
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     96.06
{txt}{col 49}        avg{col 67}= {res}     96.06
{txt}{col 49}        max{col 67}= {res}     96.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   96.1{txt}){col 67}= {res}     14.46
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 9369.849{col 26}{space 2} 11060.16{col 37}{space 1}    0.85{col 46}{space 3}0.399{col 54}{space 4}-12584.23{col 67}{space 3} 31323.93
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  78904.1{col 26}{space 2} 9243.934{col 37}{space 1}    8.54{col 46}{space 3}0.000{col 54}{space 4} 60555.18{col 67}{space 3} 97253.02
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1955.785{col 26}{space 2} 647.8919{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4}-3241.831{col 67}{space 3}-669.7404
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-10832.85{col 26}{space 2} 10899.51{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4}-32468.03{col 67}{space 3} 10802.34
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-7.357847{col 26}{space 2} 7.316934{col 37}{space 1}   -1.01{col 46}{space 3}0.317{col 54}{space 4}-21.88173{col 67}{space 3} 7.166039
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 660.6392{col 26}{space 2} 724.3646{col 37}{space 1}    0.91{col 46}{space 3}0.364{col 54}{space 4}-777.2018{col 67}{space 3}  2098.48
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 631238.8{col 26}{space 2}  46086.9{col 37}{space 1}   13.70{col 46}{space 3}0.000{col 54}{space 4} 539757.8{col 67}{space 3} 722719.9
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        98
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     96.06
{txt}{col 49}        avg{col 67}= {res}     96.06
{txt}{col 49}        max{col 67}= {res}     96.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   96.1{txt}){col 67}= {res}      9.85
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 16860.33{col 26}{space 2} 10869.15{col 37}{space 1}    1.55{col 46}{space 3}0.124{col 54}{space 4}-4714.596{col 67}{space 3} 38435.26
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 61907.58{col 26}{space 2} 9084.288{col 37}{space 1}    6.81{col 46}{space 3}0.000{col 54}{space 4} 43875.55{col 67}{space 3} 79939.61
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-969.0457{col 26}{space 2} 636.7026{col 37}{space 1}   -1.52{col 46}{space 3}0.131{col 54}{space 4} -2232.88{col 67}{space 3}  294.789
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-9491.351{col 26}{space 2} 10711.27{col 37}{space 1}   -0.89{col 46}{space 3}0.378{col 54}{space 4}-30752.89{col 67}{space 3} 11770.19
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.03311{col 26}{space 2} 7.190569{col 37}{space 1}   -2.09{col 46}{space 3}0.039{col 54}{space 4}-29.30617{col 67}{space 3}-.7600587
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  209.134{col 26}{space 2} 711.8546{col 37}{space 1}    0.29{col 46}{space 3}0.770{col 54}{space 4}-1203.875{col 67}{space 3} 1622.143
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 421756.7{col 26}{space 2} 45290.96{col 37}{space 1}    9.31{col 46}{space 3}0.000{col 54}{space 4} 331855.5{col 67}{space 3} 511657.8
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //INTERACTION BY Race//
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       170
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    168.03
{txt}{col 49}        avg{col 67}= {res}    168.03
{txt}{col 49}        max{col 67}= {res}    168.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  168.0{txt}){col 67}= {res}     19.16
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 29355.07{col 28}{space 2} 19561.82{col 39}{space 1}    1.50{col 48}{space 3}0.135{col 56}{space 4}-9263.516{col 69}{space 3} 67973.67
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 59839.12{col 28}{space 2} 53449.99{col 39}{space 1}    1.12{col 48}{space 3}0.265{col 56}{space 4}-45680.89{col 69}{space 3} 165359.1
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-65906.15{col 28}{space 2} 26053.81{col 39}{space 1}   -2.53{col 48}{space 3}0.012{col 56}{space 4}-117341.1{col 69}{space 3}-14471.19
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 137808.4{col 28}{space 2} 13443.94{col 39}{space 1}   10.25{col 48}{space 3}0.000{col 56}{space 4} 111267.6{col 69}{space 3} 164349.2
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2181.779{col 28}{space 2} 920.5235{col 39}{space 1}   -2.37{col 48}{space 3}0.019{col 56}{space 4} -3999.06{col 69}{space 3}-364.4979
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4146.352{col 28}{space 2} 15679.75{col 39}{space 1}   -0.26{col 48}{space 3}0.792{col 56}{space 4}-35101.03{col 69}{space 3} 26808.33
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-22.78562{col 28}{space 2} 11.23047{col 39}{space 1}   -2.03{col 48}{space 3}0.044{col 56}{space 4}-44.95662{col 69}{space 3}-.6146245
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 470.7591{col 28}{space 2} 1081.776{col 39}{space 1}    0.44{col 48}{space 3}0.664{col 56}{space 4}-1664.864{col 69}{space 3} 2606.383
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1051063{col 28}{space 2} 67305.51{col 39}{space 1}   15.62{col 48}{space 3}0.000{col 56}{space 4} 918189.9{col 69}{space 3}  1183937
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       170
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    168.03
{txt}{col 49}        avg{col 67}= {res}    168.03
{txt}{col 49}        max{col 67}= {res}    168.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  168.0{txt}){col 67}= {res}     21.48
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 9897.194{col 28}{space 2}  10505.5{col 39}{space 1}    0.94{col 48}{space 3}0.347{col 56}{space 4}-10842.59{col 69}{space 3} 30636.97
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 14113.37{col 28}{space 2} 28704.85{col 39}{space 1}    0.49{col 48}{space 3}0.624{col 56}{space 4}-42555.24{col 69}{space 3} 70781.98
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-32586.44{col 28}{space 2} 13991.97{col 39}{space 1}   -2.33{col 48}{space 3}0.021{col 56}{space 4}-60209.14{col 69}{space 3}-4963.736
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 71793.75{col 28}{space 2} 7219.951{col 39}{space 1}    9.94{col 48}{space 3}0.000{col 56}{space 4} 57540.26{col 69}{space 3} 86047.25
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1889.226{col 28}{space 2} 494.3592{col 39}{space 1}   -3.82{col 48}{space 3}0.000{col 56}{space 4}-2865.181{col 69}{space 3}-913.2706
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3260.019{col 28}{space 2} 8420.673{col 39}{space 1}   -0.39{col 48}{space 3}0.699{col 56}{space 4}-19883.96{col 69}{space 3} 13363.92
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-8.808594{col 28}{space 2} 6.031228{col 39}{space 1}   -1.46{col 48}{space 3}0.146{col 56}{space 4}-20.71534{col 69}{space 3}  3.09815
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}  386.437{col 28}{space 2} 580.9586{col 39}{space 1}    0.67{col 48}{space 3}0.507{col 56}{space 4}-760.4811{col 69}{space 3} 1533.355
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 638324.8{col 28}{space 2} 36145.84{col 39}{space 1}   17.66{col 48}{space 3}0.000{col 56}{space 4} 566966.3{col 69}{space 3} 709683.3
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       170
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    168.03
{txt}{col 49}        avg{col 67}= {res}    168.03
{txt}{col 49}        max{col 67}= {res}    168.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  168.0{txt}){col 67}= {res}     12.56
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 14835.63{col 28}{space 2} 9573.658{col 39}{space 1}    1.55{col 48}{space 3}0.123{col 56}{space 4}-4064.511{col 69}{space 3} 33735.78
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 38050.77{col 28}{space 2} 26158.71{col 39}{space 1}    1.45{col 48}{space 3}0.148{col 56}{space 4}-13591.29{col 69}{space 3} 89692.83
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} -28382.9{col 28}{space 2} 12750.87{col 39}{space 1}   -2.23{col 48}{space 3}0.027{col 56}{space 4}-53555.45{col 69}{space 3}-3210.354
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 56138.37{col 28}{space 2} 6579.535{col 39}{space 1}    8.53{col 48}{space 3}0.000{col 56}{space 4} 43149.16{col 69}{space 3} 69127.57
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-698.9086{col 28}{space 2} 450.5091{col 39}{space 1}   -1.55{col 48}{space 3}0.123{col 56}{space 4}-1588.296{col 69}{space 3} 190.4785
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -5262.94{col 28}{space 2} 7673.753{col 39}{space 1}   -0.69{col 48}{space 3}0.494{col 56}{space 4}-20412.33{col 69}{space 3} 9886.446
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} -12.3208{col 28}{space 2} 5.496254{col 39}{space 1}   -2.24{col 48}{space 3}0.026{col 56}{space 4}-23.17141{col 69}{space 3}-1.470194
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 90.17333{col 28}{space 2} 529.4271{col 39}{space 1}    0.17{col 48}{space 3}0.865{col 56}{space 4}-955.0123{col 69}{space 3} 1135.359
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}   414212{col 28}{space 2} 32939.68{col 39}{space 1}   12.57{col 48}{space 3}0.000{col 56}{space 4}   349183{col 69}{space 3} 479240.9
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. *********************LnNFLw1, MODELS 3-6***************************
. 
. ***********MODEL 3: MODEL 2+w1dxDiabetes w1Glucose******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0055
{txt}{col 49}Largest FMI{col 67}= {res}    0.0260
{txt}{col 49}Complete DF{col 67}= {res}        65
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     61.02
{txt}{col 49}        avg{col 67}= {res}     62.49
{txt}{col 49}        max{col 67}= {res}     63.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   63.1{txt}){col 67}= {res}      6.72
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-62323.03{col 26}{space 2} 28270.93{col 37}{space 1}   -2.20{col 46}{space 3}0.031{col 54}{space 4}-118826.7{col 67}{space 3}-5819.333
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}   115589{col 26}{space 2} 20488.35{col 37}{space 1}    5.64{col 46}{space 3}0.000{col 54}{space 4} 74643.68{col 67}{space 3} 156534.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-53.03331{col 26}{space 2} 1613.447{col 37}{space 1}   -0.03{col 46}{space 3}0.974{col 54}{space 4}-3277.844{col 67}{space 3} 3171.778
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 16288.99{col 26}{space 2} 24163.42{col 37}{space 1}    0.67{col 46}{space 3}0.503{col 54}{space 4}-31998.55{col 67}{space 3} 64576.54
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-29.18114{col 26}{space 2} 19.24647{col 37}{space 1}   -1.52{col 46}{space 3}0.134{col 54}{space 4} -67.6418{col 67}{space 3} 9.279519
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-1179.793{col 26}{space 2}  1900.44{col 37}{space 1}   -0.62{col 46}{space 3}0.537{col 54}{space 4}-4978.084{col 67}{space 3} 2618.499
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} -41416.8{col 26}{space 2} 19419.36{col 37}{space 1}   -2.13{col 46}{space 3}0.037{col 54}{space 4}   -80248{col 67}{space 3}-2585.602
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 935.5128{col 26}{space 2} 564.2083{col 37}{space 1}    1.66{col 46}{space 3}0.102{col 54}{space 4} -192.154{col 67}{space 3}  2063.18
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1051780{col 26}{space 2} 100165.5{col 37}{space 1}   10.50{col 46}{space 3}0.000{col 54}{space 4} 851595.3{col 67}{space 3}  1251965
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0091
{txt}{col 49}Largest FMI{col 67}= {res}    0.0453
{txt}{col 49}Complete DF{col 67}= {res}        65
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     58.81
{txt}{col 49}        avg{col 67}= {res}     61.71
{txt}{col 49}        max{col 67}= {res}     62.95
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   63.0{txt}){col 67}= {res}      7.53
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-38761.57{col 26}{space 2} 15912.16{col 37}{space 1}   -2.44{col 46}{space 3}0.018{col 54}{space 4}-70576.74{col 67}{space 3}-6946.392
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 58616.01{col 26}{space 2} 11482.26{col 37}{space 1}    5.10{col 46}{space 3}0.000{col 54}{space 4} 35666.54{col 67}{space 3} 81565.48
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-652.1942{col 26}{space 2}  908.058{col 37}{space 1}   -0.72{col 46}{space 3}0.475{col 54}{space 4}-2467.852{col 67}{space 3} 1163.463
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 8558.768{col 26}{space 2} 13516.27{col 37}{space 1}    0.63{col 46}{space 3}0.529{col 54}{space 4} -18452.3{col 67}{space 3} 35569.84
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.93979{col 26}{space 2} 10.76728{col 37}{space 1}   -1.48{col 46}{space 3}0.144{col 54}{space 4}-37.45679{col 67}{space 3} 5.577213
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-667.9231{col 26}{space 2} 1066.981{col 37}{space 1}   -0.63{col 46}{space 3}0.534{col 54}{space 4}-2800.913{col 67}{space 3} 1465.067
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-29339.43{col 26}{space 2} 10957.15{col 37}{space 1}   -2.68{col 46}{space 3}0.010{col 54}{space 4}-51266.11{col 67}{space 3}-7412.747
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}  596.514{col 26}{space 2} 317.5405{col 37}{space 1}    1.88{col 46}{space 3}0.065{col 54}{space 4}-38.39401{col 67}{space 3} 1231.422
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 627412.2{col 26}{space 2} 55991.57{col 37}{space 1}   11.21{col 46}{space 3}0.000{col 54}{space 4} 515511.8{col 67}{space 3} 739312.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0079
{txt}{col 49}Largest FMI{col 67}= {res}    0.0598
{txt}{col 49}Complete DF{col 67}= {res}        65
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     56.90
{txt}{col 49}        avg{col 67}= {res}     62.12
{txt}{col 49}        max{col 67}= {res}     63.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   63.0{txt}){col 67}= {res}      4.46
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0003

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-24109.64{col 26}{space 2} 13284.52{col 37}{space 1}   -1.81{col 46}{space 3}0.074{col 54}{space 4}-50657.03{col 67}{space 3} 2437.751
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  46293.3{col 26}{space 2} 9641.543{col 37}{space 1}    4.80{col 46}{space 3}0.000{col 54}{space 4} 27026.29{col 67}{space 3} 65560.31
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 157.0021{col 26}{space 2} 758.3479{col 37}{space 1}    0.21{col 46}{space 3}0.837{col 54}{space 4}-1358.512{col 67}{space 3} 1672.516
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 954.7555{col 26}{space 2} 11383.02{col 37}{space 1}    0.08{col 46}{space 3}0.933{col 54}{space 4}-21792.29{col 67}{space 3}  23701.8
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-10.34793{col 26}{space 2} 9.068936{col 37}{space 1}   -1.14{col 46}{space 3}0.258{col 54}{space 4}-28.47039{col 67}{space 3} 7.774533
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-701.6054{col 26}{space 2} 893.0585{col 37}{space 1}   -0.79{col 46}{space 3}0.435{col 54}{space 4}-2486.262{col 67}{space 3} 1083.051
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-12761.24{col 26}{space 2} 9306.526{col 37}{space 1}   -1.37{col 46}{space 3}0.176{col 54}{space 4}-31397.91{col 67}{space 3} 5875.434
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 328.1024{col 26}{space 2} 267.1452{col 37}{space 1}    1.23{col 46}{space 3}0.224{col 54}{space 4}-205.9672{col 67}{space 3}  862.172
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 430293.8{col 26}{space 2} 47234.32{col 37}{space 1}    9.11{col 46}{space 3}0.000{col 54}{space 4} 335891.7{col 67}{space 3} 524695.8
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        96
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     94.06
{txt}{col 49}        avg{col 67}= {res}     94.06
{txt}{col 49}        max{col 67}= {res}     94.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   94.1{txt}){col 67}= {res}     10.53
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  38651.3{col 26}{space 2} 23191.73{col 37}{space 1}    1.67{col 46}{space 3}0.099{col 54}{space 4}-7396.047{col 67}{space 3} 84698.64
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}   147830{col 26}{space 2} 18443.73{col 37}{space 1}    8.02{col 46}{space 3}0.000{col 54}{space 4} 111209.9{col 67}{space 3} 184450.2
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2861.515{col 26}{space 2} 1269.678{col 37}{space 1}   -2.25{col 46}{space 3}0.027{col 54}{space 4}-5382.469{col 67}{space 3}-340.5602
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-17893.37{col 26}{space 2} 21300.72{col 37}{space 1}   -0.84{col 46}{space 3}0.403{col 54}{space 4} -60186.1{col 67}{space 3} 24399.36
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-22.32934{col 26}{space 2} 14.52159{col 37}{space 1}   -1.54{col 46}{space 3}0.127{col 54}{space 4}-51.16205{col 67}{space 3} 6.503377
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  672.284{col 26}{space 2} 1467.509{col 37}{space 1}    0.46{col 46}{space 3}0.648{col 54}{space 4}-2241.465{col 67}{space 3} 3586.033
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 25661.14{col 26}{space 2} 19415.75{col 37}{space 1}    1.32{col 46}{space 3}0.189{col 54}{space 4}-12888.96{col 67}{space 3} 64211.24
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-589.3121{col 26}{space 2} 422.7667{col 37}{space 1}   -1.39{col 46}{space 3}0.167{col 54}{space 4}-1428.718{col 67}{space 3} 250.0941
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1110575{col 26}{space 2} 96173.27{col 37}{space 1}   11.55{col 46}{space 3}0.000{col 54}{space 4} 919622.1{col 67}{space 3}  1301527
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        96
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     94.06
{txt}{col 49}        avg{col 67}= {res}     94.06
{txt}{col 49}        max{col 67}= {res}     94.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   94.1{txt}){col 67}= {res}     10.93
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 11453.03{col 26}{space 2} 11994.82{col 37}{space 1}    0.95{col 46}{space 3}0.342{col 54}{space 4}-12362.76{col 67}{space 3} 35268.82
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 77610.84{col 26}{space 2} 9539.138{col 37}{space 1}    8.14{col 46}{space 3}0.000{col 54}{space 4} 58670.82{col 67}{space 3} 96550.87
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2059.443{col 26}{space 2} 656.6804{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-3363.287{col 67}{space 3}-755.6002
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-11291.32{col 26}{space 2} 11016.78{col 37}{space 1}   -1.02{col 46}{space 3}0.308{col 54}{space 4}-33165.21{col 67}{space 3} 10582.58
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-6.452356{col 26}{space 2} 7.510598{col 37}{space 1}   -0.86{col 46}{space 3}0.392{col 54}{space 4} -21.3647{col 67}{space 3} 8.459988
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 594.6667{col 26}{space 2} 758.9989{col 37}{space 1}    0.78{col 46}{space 3}0.435{col 54}{space 4}-912.3307{col 67}{space 3} 2101.664
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 10912.24{col 26}{space 2} 10041.87{col 37}{space 1}    1.09{col 46}{space 3}0.280{col 54}{space 4}-9025.962{col 67}{space 3} 30850.44
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} -210.634{col 26}{space 2} 218.6559{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4}-644.7768{col 67}{space 3} 223.5087
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 651656.5{col 26}{space 2} 49741.03{col 37}{space 1}   13.10{col 46}{space 3}0.000{col 54}{space 4} 552895.3{col 67}{space 3} 750417.6
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        96
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     94.06
{txt}{col 49}        avg{col 67}= {res}     94.06
{txt}{col 49}        max{col 67}= {res}     94.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   94.1{txt}){col 67}= {res}      7.55
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 20509.41{col 26}{space 2} 11772.82{col 37}{space 1}    1.74{col 46}{space 3}0.085{col 54}{space 4} -2865.61{col 67}{space 3} 43884.43
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  61283.4{col 26}{space 2} 9362.592{col 37}{space 1}    6.55{col 46}{space 3}0.000{col 54}{space 4} 42693.91{col 67}{space 3} 79872.89
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1077.498{col 26}{space 2} 644.5269{col 37}{space 1}   -1.67{col 46}{space 3}0.098{col 54}{space 4} -2357.21{col 67}{space 3} 202.2146
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-9505.683{col 26}{space 2} 10812.89{col 37}{space 1}   -0.88{col 46}{space 3}0.382{col 54}{space 4}-30974.75{col 67}{space 3} 11963.38
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.60535{col 26}{space 2} 7.371596{col 37}{space 1}   -1.98{col 46}{space 3}0.050{col 54}{space 4} -29.2417{col 67}{space 3} .0310044
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 218.6773{col 26}{space 2} 744.9517{col 37}{space 1}    0.29{col 46}{space 3}0.770{col 54}{space 4}-1260.429{col 67}{space 3} 1697.784
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 10083.72{col 26}{space 2}  9856.02{col 37}{space 1}    1.02{col 46}{space 3}0.309{col 54}{space 4}-9485.476{col 67}{space 3} 29652.91
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-257.4132{col 26}{space 2} 214.6091{col 37}{space 1}   -1.20{col 46}{space 3}0.233{col 54}{space 4}-683.5211{col 67}{space 3} 168.6946
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 441396.3{col 26}{space 2} 48820.45{col 37}{space 1}    9.04{col 46}{space 3}0.000{col 54}{space 4} 344462.9{col 67}{space 3} 538329.6
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //INTERACTION BY Race//
. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0041
{txt}{col 49}Largest FMI{col 67}= {res}    0.0444
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    148.10
{txt}{col 49}        avg{col 67}= {res}    163.83
{txt}{col 49}        max{col 67}= {res}    166.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  166.0{txt}){col 67}= {res}     15.11
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}  30933.4{col 28}{space 2} 20872.12{col 39}{space 1}    1.48{col 48}{space 3}0.140{col 56}{space 4}-10275.68{col 69}{space 3} 72142.49
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 64225.31{col 28}{space 2} 55245.36{col 39}{space 1}    1.16{col 48}{space 3}0.247{col 56}{space 4}-44848.69{col 69}{space 3} 173299.3
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-68149.47{col 28}{space 2} 27065.78{col 39}{space 1}   -2.52{col 48}{space 3}0.013{col 56}{space 4}-121586.9{col 69}{space 3}-14712.01
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 138706.4{col 28}{space 2} 13729.98{col 39}{space 1}   10.10{col 48}{space 3}0.000{col 56}{space 4} 111598.5{col 69}{space 3} 165814.3
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -2149.36{col 28}{space 2} 945.1775{col 39}{space 1}   -2.27{col 48}{space 3}0.024{col 56}{space 4}-4015.499{col 69}{space 3}-283.2202
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3785.737{col 28}{space 2} 15804.26{col 39}{space 1}   -0.24{col 48}{space 3}0.811{col 56}{space 4}-34988.96{col 69}{space 3} 27417.49
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} -23.4277{col 28}{space 2} 11.42605{col 39}{space 1}   -2.05{col 48}{space 3}0.042{col 56}{space 4}-45.98685{col 69}{space 3}-.8685498
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 557.9641{col 28}{space 2} 1114.421{col 39}{space 1}    0.50{col 48}{space 3}0.617{col 56}{space 4}-1642.304{col 69}{space 3} 2758.232
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-3098.474{col 28}{space 2}  13872.4{col 39}{space 1}   -0.22{col 48}{space 3}0.824{col 56}{space 4}-30511.88{col 69}{space 3} 24314.93
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2}-30.14004{col 28}{space 2} 337.2179{col 39}{space 1}   -0.09{col 48}{space 3}0.929{col 56}{space 4}-696.0737{col 69}{space 3} 635.7936
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1047415{col 28}{space 2} 71503.81{col 39}{space 1}   14.65{col 48}{space 3}0.000{col 56}{space 4} 906235.4{col 69}{space 3}  1188595
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0014
{txt}{col 49}Largest FMI{col 67}= {res}    0.0147
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    162.32
{txt}{col 49}        avg{col 67}= {res}    165.53
{txt}{col 49}        max{col 67}= {res}    166.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  166.0{txt}){col 67}= {res}     17.12
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 9178.906{col 28}{space 2}  11186.3{col 39}{space 1}    0.82{col 48}{space 3}0.413{col 56}{space 4}-12906.85{col 69}{space 3} 31264.66
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 15927.58{col 28}{space 2} 29610.75{col 39}{space 1}    0.54{col 48}{space 3}0.591{col 56}{space 4}-42534.57{col 69}{space 3} 74389.72
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-33331.32{col 28}{space 2}  14507.4{col 39}{space 1}   -2.30{col 48}{space 3}0.023{col 56}{space 4}-61974.08{col 69}{space 3}-4688.564
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 72318.82{col 28}{space 2} 7359.192{col 39}{space 1}    9.83{col 48}{space 3}0.000{col 56}{space 4} 57789.13{col 69}{space 3} 86848.51
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1800.777{col 28}{space 2} 506.3874{col 39}{space 1}   -3.56{col 48}{space 3}0.000{col 56}{space 4}-2800.571{col 69}{space 3}-800.9832
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3137.733{col 28}{space 2} 8471.225{col 39}{space 1}   -0.37{col 48}{space 3}0.712{col 56}{space 4}-19862.94{col 69}{space 3} 13587.47
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-9.459234{col 28}{space 2} 6.123193{col 39}{space 1}   -1.54{col 48}{space 3}0.124{col 56}{space 4} -21.5486{col 69}{space 3} 2.630131
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 427.1143{col 28}{space 2} 597.3463{col 39}{space 1}    0.72{col 48}{space 3}0.476{col 56}{space 4}-752.2628{col 69}{space 3} 1606.491
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-6559.831{col 28}{space 2} 7326.923{col 39}{space 1}   -0.90{col 48}{space 3}0.372{col 56}{space 4}-21028.21{col 69}{space 3} 7908.548
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 93.13862{col 28}{space 2} 179.6835{col 39}{space 1}    0.52{col 48}{space 3}0.605{col 56}{space 4}-261.6381{col 69}{space 3} 447.9154
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 627802.2{col 28}{space 2} 38274.07{col 39}{space 1}   16.40{col 48}{space 3}0.000{col 56}{space 4} 552234.4{col 69}{space 3} 703369.9
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0065
{txt}{col 49}Largest FMI{col 67}= {res}    0.0698
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    132.07
{txt}{col 49}        avg{col 67}= {res}    161.87
{txt}{col 49}        max{col 67}= {res}    166.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  166.0{txt}){col 67}= {res}      9.88
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 15856.43{col 28}{space 2} 10217.45{col 39}{space 1}    1.55{col 48}{space 3}0.123{col 56}{space 4}-4316.541{col 69}{space 3} 36029.39
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 39489.28{col 28}{space 2} 27041.65{col 39}{space 1}    1.46{col 48}{space 3}0.146{col 56}{space 4} -13900.6{col 69}{space 3} 92879.16
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-29181.86{col 28}{space 2} 13248.07{col 39}{space 1}   -2.20{col 48}{space 3}0.029{col 56}{space 4}-55338.26{col 69}{space 3}-3025.452
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 56384.21{col 28}{space 2} 6720.276{col 39}{space 1}    8.39{col 48}{space 3}0.000{col 56}{space 4} 43115.97{col 69}{space 3} 69652.45
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-715.6058{col 28}{space 2} 462.8865{col 39}{space 1}   -1.55{col 48}{space 3}0.124{col 56}{space 4}-1629.529{col 69}{space 3} 198.3168
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-5137.462{col 28}{space 2}  7735.58{col 39}{space 1}   -0.66{col 48}{space 3}0.508{col 56}{space 4}-20410.24{col 69}{space 3} 10135.32
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} -12.3926{col 28}{space 2} 5.593531{col 39}{space 1}   -2.22{col 48}{space 3}0.028{col 56}{space 4}-23.43628{col 69}{space 3}-1.348912
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 117.7539{col 28}{space 2} 545.4562{col 39}{space 1}    0.22{col 48}{space 3}0.829{col 56}{space 4}-959.1727{col 69}{space 3} 1194.681
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} 891.1086{col 28}{space 2} 6876.606{col 39}{space 1}    0.13{col 48}{space 3}0.897{col 56}{space 4}-12711.43{col 69}{space 3} 14493.65
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2}-48.27876{col 28}{space 2} 165.9473{col 39}{space 1}   -0.29{col 48}{space 3}0.771{col 56}{space 4}-376.0635{col 69}{space 3}  279.506
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 416265.8{col 28}{space 2} 35039.58{col 39}{space 1}   11.88{col 48}{space 3}0.000{col 56}{space 4} 347080.6{col 69}{space 3} 485450.9
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 4: MODEL 2+liver/kidney disease******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0709
{txt}{col 49}Largest FMI{col 67}= {res}    0.4894
{txt}{col 49}Complete DF{col 67}= {res}        62
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     13.04
{txt}{col 49}        avg{col 67}= {res}     53.04
{txt}{col 49}        max{col 67}= {res}     59.42
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   59.2{txt}){col 67}= {res}      4.58
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-56097.93{col 26}{space 2} 28426.64{col 37}{space 1}   -1.97{col 46}{space 3}0.053{col 54}{space 4}-112980.6{col 67}{space 3} 784.7358
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 156367.1{col 26}{space 2} 27726.36{col 37}{space 1}    5.64{col 46}{space 3}0.000{col 54}{space 4} 100348.8{col 67}{space 3} 212385.4
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-243.1768{col 26}{space 2} 1785.182{col 37}{space 1}   -0.14{col 46}{space 3}0.892{col 54}{space 4}-3816.554{col 67}{space 3}   3330.2
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 21184.21{col 26}{space 2} 24868.57{col 37}{space 1}    0.85{col 46}{space 3}0.398{col 54}{space 4}-28570.27{col 67}{space 3}  70938.7
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-29.59852{col 26}{space 2} 19.95935{col 37}{space 1}   -1.48{col 46}{space 3}0.143{col 54}{space 4}-69.53834{col 67}{space 3} 10.34129
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1144.943{col 26}{space 2} 2088.442{col 37}{space 1}    0.55{col 46}{space 3}0.586{col 54}{space 4}-3037.551{col 67}{space 3} 5327.437
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-53675.83{col 26}{space 2} 64063.98{col 37}{space 1}   -0.84{col 46}{space 3}0.417{col 54}{space 4}-192031.4{col 67}{space 3} 84679.76
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} -1031744{col 26}{space 2}  1657107{col 37}{space 1}   -0.62{col 46}{space 3}0.536{col 54}{space 4} -4347528{col 67}{space 3}  2284040
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-495.4556{col 26}{space 2} 3496.275{col 37}{space 1}   -0.14{col 46}{space 3}0.888{col 54}{space 4}-7503.618{col 67}{space 3} 6512.707
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 552.5237{col 26}{space 2} 523.4726{col 37}{space 1}    1.06{col 46}{space 3}0.295{col 54}{space 4} -494.795{col 67}{space 3} 1599.842
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-13500.93{col 26}{space 2} 9288.001{col 37}{space 1}   -1.45{col 46}{space 3}0.151{col 54}{space 4}-32087.26{col 67}{space 3} 5085.405
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  2131896{col 26}{space 2}  1680506{col 37}{space 1}    1.27{col 46}{space 3}0.210{col 54}{space 4} -1230642{col 67}{space 3}  5494434
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0567
{txt}{col 49}Largest FMI{col 67}= {res}    0.4475
{txt}{col 49}Complete DF{col 67}= {res}        62
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     14.92
{txt}{col 49}        avg{col 67}= {res}     54.32
{txt}{col 49}        max{col 67}= {res}     60.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   59.5{txt}){col 67}= {res}      4.38
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-32887.78{col 26}{space 2} 16460.87{col 37}{space 1}   -2.00{col 46}{space 3}0.050{col 54}{space 4}-65814.47{col 67}{space 3} 38.91043
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 74875.15{col 26}{space 2} 15847.79{col 37}{space 1}    4.72{col 46}{space 3}0.000{col 54}{space 4} 42975.52{col 67}{space 3} 106774.8
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1140.816{col 26}{space 2} 1036.145{col 37}{space 1}   -1.10{col 46}{space 3}0.275{col 54}{space 4}-3214.201{col 67}{space 3} 932.5684
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 11633.09{col 26}{space 2}  14507.9{col 37}{space 1}    0.80{col 46}{space 3}0.426{col 54}{space 4}-17393.57{col 67}{space 3} 40659.75
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.76938{col 26}{space 2}  11.5868{col 37}{space 1}   -1.36{col 46}{space 3}0.179{col 54}{space 4} -38.9495{col 67}{space 3} 7.410734
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 350.4271{col 26}{space 2} 1205.305{col 37}{space 1}    0.29{col 46}{space 3}0.772{col 54}{space 4}-2061.522{col 67}{space 3} 2762.377
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-7736.111{col 26}{space 2} 36111.55{col 37}{space 1}   -0.21{col 46}{space 3}0.833{col 54}{space 4}-84743.51{col 67}{space 3} 69271.28
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-914152.3{col 26}{space 2} 960748.2{col 37}{space 1}   -0.95{col 46}{space 3}0.345{col 54}{space 4} -2835976{col 67}{space 3}  1007672
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 967.1255{col 26}{space 2} 2024.946{col 37}{space 1}    0.48{col 46}{space 3}0.635{col 54}{space 4}-3089.026{col 67}{space 3} 5023.277
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 256.9696{col 26}{space 2} 304.7705{col 37}{space 1}    0.84{col 46}{space 3}0.403{col 54}{space 4}-352.7368{col 67}{space 3} 866.6759
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-6889.645{col 26}{space 2} 5424.591{col 37}{space 1}   -1.27{col 46}{space 3}0.209{col 54}{space 4}-17746.01{col 67}{space 3} 3966.719
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1574289{col 26}{space 2} 974662.6{col 37}{space 1}    1.62{col 46}{space 3}0.112{col 54}{space 4}-375368.8{col 67}{space 3}  3523946
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0839
{txt}{col 49}Largest FMI{col 67}= {res}    0.5045
{txt}{col 49}Complete DF{col 67}= {res}        62
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     12.44
{txt}{col 49}        avg{col 67}= {res}     51.75
{txt}{col 49}        max{col 67}= {res}     59.17
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   59.0{txt}){col 67}= {res}      3.63
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0006

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-23458.49{col 26}{space 2} 13058.91{col 37}{space 1}   -1.80{col 46}{space 3}0.078{col 54}{space 4}-49608.23{col 67}{space 3} 2691.246
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  66878.2{col 26}{space 2} 12696.05{col 37}{space 1}    5.27{col 46}{space 3}0.000{col 54}{space 4} 41192.96{col 67}{space 3} 92563.45
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 252.2825{col 26}{space 2} 819.4386{col 37}{space 1}    0.31{col 46}{space 3}0.759{col 54}{space 4}-1389.203{col 67}{space 3} 1893.768
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}   2546.2{col 26}{space 2} 11332.66{col 37}{space 1}    0.22{col 46}{space 3}0.823{col 54}{space 4}-20129.03{col 67}{space 3} 25221.43
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-10.75656{col 26}{space 2} 9.162583{col 37}{space 1}   -1.17{col 46}{space 3}0.245{col 54}{space 4}-29.10319{col 67}{space 3} 7.590074
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 377.0965{col 26}{space 2} 963.9835{col 37}{space 1}    0.39{col 46}{space 3}0.697{col 54}{space 4}-1556.383{col 67}{space 3} 2310.576
{txt}w1Creatinine {c |}{col 14}{res}{space 2} -37305.7{col 26}{space 2} 29537.98{col 37}{space 1}   -1.26{col 46}{space 3}0.230{col 54}{space 4}-101412.7{col 67}{space 3} 26801.34
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-248425.5{col 26}{space 2} 759308.5{col 37}{space 1}   -0.33{col 46}{space 3}0.745{col 54}{space 4} -1768499{col 67}{space 3}  1271648
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-541.7345{col 26}{space 2} 1592.878{col 37}{space 1}   -0.34{col 46}{space 3}0.735{col 54}{space 4}-3735.087{col 67}{space 3} 2651.618
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 251.2515{col 26}{space 2} 239.4179{col 37}{space 1}    1.05{col 46}{space 3}0.298{col 54}{space 4}-227.9117{col 67}{space 3} 730.4146
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-5738.348{col 26}{space 2} 4220.961{col 37}{space 1}   -1.36{col 46}{space 3}0.179{col 54}{space 4}-14184.36{col 67}{space 3} 2707.664
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 696062.3{col 26}{space 2}   769571{col 37}{space 1}    0.90{col 46}{space 3}0.369{col 54}{space 4}-844448.3{col 67}{space 3}  2236573
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0204
{txt}{col 49}Largest FMI{col 67}= {res}    0.2012
{txt}{col 49}Complete DF{col 67}= {res}        93
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     45.56
{txt}{col 49}        avg{col 67}= {res}     85.79
{txt}{col 49}        max{col 67}= {res}     90.97
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   90.9{txt}){col 67}= {res}      8.57
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  21520.1{col 26}{space 2} 21771.65{col 37}{space 1}    0.99{col 46}{space 3}0.326{col 54}{space 4}-21728.62{col 67}{space 3} 64768.83
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 173970.8{col 26}{space 2} 23621.21{col 37}{space 1}    7.37{col 46}{space 3}0.000{col 54}{space 4}   127004{col 67}{space 3} 220937.6
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2068.506{col 26}{space 2} 1270.519{col 37}{space 1}   -1.63{col 46}{space 3}0.107{col 54}{space 4}-4592.267{col 67}{space 3} 455.2542
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-15167.42{col 26}{space 2} 20876.77{col 37}{space 1}   -0.73{col 46}{space 3}0.469{col 54}{space 4}-56636.76{col 67}{space 3} 26301.91
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-27.76062{col 26}{space 2} 14.28246{col 37}{space 1}   -1.94{col 46}{space 3}0.055{col 54}{space 4}-56.13269{col 67}{space 3} .6114566
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 2320.895{col 26}{space 2} 1510.977{col 37}{space 1}    1.54{col 46}{space 3}0.128{col 54}{space 4}-680.5506{col 67}{space 3}  5322.34
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 27374.46{col 26}{space 2} 59909.44{col 37}{space 1}    0.46{col 46}{space 3}0.650{col 54}{space 4}-93248.54{col 67}{space 3} 147997.5
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}  1199048{col 26}{space 2}  1672042{col 37}{space 1}    0.72{col 46}{space 3}0.475{col 54}{space 4} -2123121{col 67}{space 3}  4521217
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-328.6274{col 26}{space 2} 2580.815{col 37}{space 1}   -0.13{col 46}{space 3}0.899{col 54}{space 4}-5459.896{col 67}{space 3} 4802.641
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 214.9609{col 26}{space 2} 430.8753{col 37}{space 1}    0.50{col 46}{space 3}0.619{col 54}{space 4}-640.9241{col 67}{space 3} 1070.846
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-22168.46{col 26}{space 2} 7585.707{col 37}{space 1}   -2.92{col 46}{space 3}0.004{col 54}{space 4}-37237.35{col 67}{space 3}-7099.574
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-157451.1{col 26}{space 2}  1679934{col 37}{space 1}   -0.09{col 46}{space 3}0.926{col 54}{space 4} -3495346{col 67}{space 3}  3180443
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0325
{txt}{col 49}Largest FMI{col 67}= {res}    0.2959
{txt}{col 49}Complete DF{col 67}= {res}        93
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     30.51
{txt}{col 49}        avg{col 67}= {res}     84.30
{txt}{col 49}        max{col 67}= {res}     91.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   90.6{txt}){col 67}= {res}      8.49
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 4643.188{col 26}{space 2} 11362.28{col 37}{space 1}    0.41{col 46}{space 3}0.684{col 54}{space 4}-17928.47{col 67}{space 3} 27214.85
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 89620.86{col 26}{space 2} 12387.64{col 37}{space 1}    7.23{col 46}{space 3}0.000{col 54}{space 4} 64978.34{col 67}{space 3} 114263.4
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -1803.54{col 26}{space 2} 662.4048{col 37}{space 1}   -2.72{col 46}{space 3}0.008{col 54}{space 4}-3119.345{col 67}{space 3}-487.7342
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -9554.49{col 26}{space 2} 10878.92{col 37}{space 1}   -0.88{col 46}{space 3}0.382{col 54}{space 4}   -31164{col 67}{space 3} 12055.02
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.925459{col 26}{space 2} 7.451901{col 37}{space 1}   -1.20{col 46}{space 3}0.234{col 54}{space 4}-23.72907{col 67}{space 3} 5.878154
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1381.248{col 26}{space 2}  788.431{col 37}{space 1}    1.75{col 46}{space 3}0.083{col 54}{space 4}-184.9588{col 67}{space 3} 2947.455
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 16490.81{col 26}{space 2} 32941.06{col 37}{space 1}    0.50{col 46}{space 3}0.620{col 54}{space 4}-50737.06{col 67}{space 3} 83718.68
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 296983.8{col 26}{space 2} 867872.6{col 37}{space 1}    0.34{col 46}{space 3}0.733{col 54}{space 4} -1427087{col 67}{space 3}  2021055
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 112.5219{col 26}{space 2} 1349.646{col 37}{space 1}    0.08{col 46}{space 3}0.934{col 54}{space 4}-2571.532{col 67}{space 3} 2796.576
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 207.5406{col 26}{space 2}  224.831{col 37}{space 1}    0.92{col 46}{space 3}0.358{col 54}{space 4}-239.0728{col 67}{space 3} 654.1541
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-9965.201{col 26}{space 2} 3960.832{col 37}{space 1}   -2.52{col 46}{space 3}0.014{col 54}{space 4}-17833.76{col 67}{space 3}-2096.639
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 318379.2{col 26}{space 2} 872005.1{col 37}{space 1}    0.37{col 46}{space 3}0.716{col 54}{space 4} -1413921{col 67}{space 3}  2050680
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0050
{txt}{col 49}Largest FMI{col 67}= {res}    0.0477
{txt}{col 49}Complete DF{col 67}= {res}        93
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     83.21
{txt}{col 49}        avg{col 67}= {res}     90.21
{txt}{col 49}        max{col 67}= {res}     91.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   91.0{txt}){col 67}= {res}      6.46
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 12833.36{col 26}{space 2} 11032.62{col 37}{space 1}    1.16{col 46}{space 3}0.248{col 54}{space 4}-9081.676{col 67}{space 3}  34748.4
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 74294.51{col 26}{space 2} 11789.29{col 37}{space 1}    6.30{col 46}{space 3}0.000{col 54}{space 4} 50874.61{col 67}{space 3} 97714.41
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-673.5984{col 26}{space 2}  644.611{col 37}{space 1}   -1.04{col 46}{space 3}0.299{col 54}{space 4}-1954.046{col 67}{space 3} 606.8493
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-8514.883{col 26}{space 2} 10590.39{col 37}{space 1}   -0.80{col 46}{space 3}0.423{col 54}{space 4}-29551.27{col 67}{space 3} 12521.51
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-16.80246{col 26}{space 2} 7.233638{col 37}{space 1}   -2.32{col 46}{space 3}0.022{col 54}{space 4}-31.17121{col 67}{space 3}-2.433706
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 989.4247{col 26}{space 2} 766.3372{col 37}{space 1}    1.29{col 46}{space 3}0.200{col 54}{space 4}-532.8228{col 67}{space 3} 2511.672
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 7683.116{col 26}{space 2} 28106.75{col 37}{space 1}    0.27{col 46}{space 3}0.785{col 54}{space 4}-48217.96{col 67}{space 3} 63584.19
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 671382.3{col 26}{space 2}   843754{col 37}{space 1}    0.80{col 46}{space 3}0.428{col 54}{space 4} -1004707{col 67}{space 3}  2347472
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-384.5869{col 26}{space 2}  1287.84{col 37}{space 1}   -0.30{col 46}{space 3}0.766{col 54}{space 4}-2942.854{col 67}{space 3}  2173.68
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 62.13378{col 26}{space 2} 218.5625{col 37}{space 1}    0.28{col 46}{space 3}0.777{col 54}{space 4}-372.0113{col 67}{space 3} 496.2789
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-10568.23{col 26}{space 2}   3844.2{col 37}{space 1}   -2.75{col 46}{space 3}0.007{col 54}{space 4}-18204.35{col 67}{space 3}-2932.116
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-255084.2{col 26}{space 2} 847505.4{col 37}{space 1}   -0.30{col 46}{space 3}0.764{col 54}{space 4} -1938627{col 67}{space 3}  1428459
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. **INTERACTION BY Race**
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0205
{txt}{col 49}Largest FMI{col 67}= {res}    0.2289
{txt}{col 49}Complete DF{col 67}= {res}       165
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     53.24
{txt}{col 49}        avg{col 67}= {res}    153.14
{txt}{col 49}        max{col 67}= {res}    162.94
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  162.7{txt}){col 67}= {res}     12.98
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 22179.21{col 28}{space 2} 19716.44{col 39}{space 1}    1.12{col 48}{space 3}0.262{col 56}{space 4}-16753.93{col 69}{space 3} 61112.34
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 58297.98{col 28}{space 2} 54058.05{col 39}{space 1}    1.08{col 48}{space 3}0.282{col 56}{space 4}-48454.32{col 69}{space 3} 165050.3
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-63171.32{col 28}{space 2} 26066.49{col 39}{space 1}   -2.42{col 48}{space 3}0.016{col 56}{space 4}-114644.8{col 69}{space 3}-11697.89
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 168593.3{col 28}{space 2} 17123.68{col 39}{space 1}    9.85{col 48}{space 3}0.000{col 56}{space 4} 134754.3{col 69}{space 3} 202432.2
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1520.028{col 28}{space 2} 955.2987{col 39}{space 1}   -1.59{col 48}{space 3}0.114{col 56}{space 4}-3406.414{col 69}{space 3} 366.3583
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2164.023{col 28}{space 2} 15460.85{col 39}{space 1}   -0.14{col 48}{space 3}0.889{col 56}{space 4}-32693.48{col 69}{space 3} 28365.44
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-22.64316{col 28}{space 2} 11.08549{col 39}{space 1}   -2.04{col 48}{space 3}0.043{col 56}{space 4}-44.53328{col 69}{space 3}-.7530416
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1939.764{col 28}{space 2} 1161.192{col 39}{space 1}    1.67{col 48}{space 3}0.097{col 56}{space 4}-353.2233{col 69}{space 3} 4232.752
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} -27812.4{col 28}{space 2} 38460.19{col 39}{space 1}   -0.72{col 48}{space 3}0.473{col 56}{space 4}-104945.8{col 69}{space 3} 49321.01
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}  -139936{col 28}{space 2}  1133450{col 39}{space 1}   -0.12{col 48}{space 3}0.902{col 56}{space 4} -2378104{col 69}{space 3}  2098232
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 310.2264{col 28}{space 2}  1982.37{col 39}{space 1}    0.16{col 48}{space 3}0.876{col 56}{space 4}-3605.576{col 69}{space 3} 4226.029
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 317.7966{col 28}{space 2} 322.8952{col 39}{space 1}    0.98{col 48}{space 3}0.326{col 56}{space 4} -319.806{col 69}{space 3} 955.3991
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-17162.74{col 28}{space 2} 5702.166{col 39}{space 1}   -3.01{col 48}{space 3}0.003{col 56}{space 4}-28422.75{col 69}{space 3}-5902.726
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1175583{col 28}{space 2}  1141216{col 39}{space 1}    1.03{col 48}{space 3}0.304{col 56}{space 4} -1077921{col 69}{space 3}  3429087
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0144
{txt}{col 49}Largest FMI{col 67}= {res}    0.1773
{txt}{col 49}Complete DF{col 67}= {res}       165
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     70.90
{txt}{col 49}        avg{col 67}= {res}    154.90
{txt}{col 49}        max{col 67}= {res}    163.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  162.8{txt}){col 67}= {res}     13.92
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 5536.841{col 28}{space 2} 10716.06{col 39}{space 1}    0.52{col 48}{space 3}0.606{col 56}{space 4} -15623.8{col 69}{space 3} 26697.48
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 14086.23{col 28}{space 2} 29358.13{col 39}{space 1}    0.48{col 48}{space 3}0.632{col 56}{space 4}-43888.78{col 69}{space 3} 72061.24
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-31239.98{col 28}{space 2} 14161.13{col 39}{space 1}   -2.21{col 48}{space 3}0.029{col 56}{space 4}-59203.88{col 69}{space 3}-3276.077
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 84708.47{col 28}{space 2} 9273.341{col 39}{space 1}    9.13{col 48}{space 3}0.000{col 56}{space 4} 66386.41{col 69}{space 3} 103030.5
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1683.741{col 28}{space 2} 518.5268{col 39}{space 1}   -3.25{col 48}{space 3}0.001{col 56}{space 4}-2707.637{col 69}{space 3} -659.845
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-1859.511{col 28}{space 2} 8398.474{col 39}{space 1}   -0.22{col 48}{space 3}0.825{col 56}{space 4}-18443.34{col 69}{space 3} 14724.32
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} -9.00908{col 28}{space 2} 6.020694{col 39}{space 1}   -1.50{col 48}{space 3}0.136{col 56}{space 4}-20.89785{col 69}{space 3} 2.879688
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1020.647{col 28}{space 2} 630.0741{col 39}{space 1}    1.62{col 48}{space 3}0.107{col 56}{space 4}-223.5212{col 69}{space 3} 2264.816
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-3520.718{col 28}{space 2} 20317.02{col 39}{space 1}   -0.17{col 48}{space 3}0.863{col 56}{space 4}-44032.68{col 69}{space 3} 36991.24
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-351466.8{col 28}{space 2} 616658.8{col 39}{space 1}   -0.57{col 48}{space 3}0.569{col 56}{space 4} -1569185{col 69}{space 3}   866251
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 700.6281{col 28}{space 2} 1073.208{col 39}{space 1}    0.65{col 48}{space 3}0.515{col 56}{space 4}-1418.994{col 69}{space 3}  2820.25
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 227.6045{col 28}{space 2} 175.3793{col 39}{space 1}    1.30{col 48}{space 3}0.196{col 56}{space 4}-118.7053{col 69}{space 3} 573.9143
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-7981.018{col 28}{space 2} 3094.469{col 39}{space 1}   -2.58{col 48}{space 3}0.011{col 56}{space 4}-14091.51{col 69}{space 3}-1870.531
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 976062.3{col 28}{space 2} 620947.8{col 39}{space 1}    1.57{col 48}{space 3}0.118{col 56}{space 4}-250127.3{col 69}{space 3}  2202252
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0354
{txt}{col 49}Largest FMI{col 67}= {res}    0.3340
{txt}{col 49}Complete DF{col 67}= {res}       165
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     31.71
{txt}{col 49}        avg{col 67}= {res}    148.00
{txt}{col 49}        max{col 67}= {res}    162.80
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  162.1{txt}){col 67}= {res}      8.82
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 12376.34{col 28}{space 2} 9635.311{col 39}{space 1}    1.28{col 48}{space 3}0.201{col 56}{space 4}-6650.692{col 69}{space 3} 31403.37
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 38288.93{col 28}{space 2} 26459.57{col 39}{space 1}    1.45{col 48}{space 3}0.150{col 56}{space 4}-13967.51{col 69}{space 3} 90545.37
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} -27714.1{col 28}{space 2} 12745.62{col 39}{space 1}   -2.17{col 48}{space 3}0.031{col 56}{space 4}-52884.14{col 69}{space 3}-2544.057
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 72074.39{col 28}{space 2} 8484.454{col 39}{space 1}    8.49{col 48}{space 3}0.000{col 56}{space 4} 55287.58{col 69}{space 3} 88861.21
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-348.9702{col 28}{space 2} 467.6728{col 39}{space 1}   -0.75{col 48}{space 3}0.457{col 56}{space 4}-1272.533{col 69}{space 3} 574.5925
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4603.443{col 28}{space 2} 7545.607{col 39}{space 1}   -0.61{col 48}{space 3}0.543{col 56}{space 4}-19503.32{col 69}{space 3} 10296.43
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-11.99938{col 28}{space 2} 5.415389{col 39}{space 1}   -2.22{col 48}{space 3}0.028{col 56}{space 4}-22.69322{col 69}{space 3}-1.305529
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 818.8763{col 28}{space 2} 569.4967{col 39}{space 1}    1.44{col 48}{space 3}0.152{col 56}{space 4}-305.8533{col 69}{space 3} 1943.606
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-21594.11{col 28}{space 2} 19958.84{col 39}{space 1}   -1.08{col 48}{space 3}0.287{col 56}{space 4}-62263.54{col 69}{space 3} 19075.33
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} 39193.15{col 28}{space 2} 556703.1{col 39}{space 1}    0.07{col 48}{space 3}0.944{col 56}{space 4} -1060289{col 69}{space 3}  1138676
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2}-119.1172{col 28}{space 2} 980.1034{col 39}{space 1}   -0.12{col 48}{space 3}0.903{col 56}{space 4}-2056.636{col 69}{space 3} 1818.402
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 116.9836{col 28}{space 2} 157.7209{col 39}{space 1}    0.74{col 48}{space 3}0.459{col 56}{space 4}-194.4656{col 69}{space 3} 428.4329
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-7904.068{col 28}{space 2} 2787.314{col 39}{space 1}   -2.84{col 48}{space 3}0.005{col 56}{space 4}-13408.39{col 69}{space 3}-2399.747
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 371529.8{col 28}{space 2} 560490.9{col 39}{space 1}    0.66{col 48}{space 3}0.508{col 56}{space 4}  -735431{col 69}{space 3}  1478491
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0241
{txt}{col 49}Largest FMI{col 67}= {res}    0.2570
{txt}{col 49}Complete DF{col 67}= {res}       166
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     46.03
{txt}{col 49}        avg{col 67}= {res}    152.79
{txt}{col 49}        max{col 67}= {res}    163.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  163.5{txt}){col 67}= {res}     13.14
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-4751.979{col 26}{space 2} 16520.04{col 37}{space 1}   -0.29{col 46}{space 3}0.774{col 54}{space 4}-37371.43{col 67}{space 3} 27867.47
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}   167380{col 26}{space 2} 17397.09{col 37}{space 1}    9.62{col 46}{space 3}0.000{col 54}{space 4} 132998.5{col 67}{space 3} 201761.5
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1548.696{col 26}{space 2} 968.2607{col 37}{space 1}   -1.60{col 46}{space 3}0.112{col 54}{space 4}-3460.561{col 67}{space 3} 363.1693
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-67546.09{col 26}{space 2} 14959.43{col 37}{space 1}   -4.52{col 46}{space 3}0.000{col 54}{space 4}-97087.17{col 67}{space 3}-38005.01
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-1677.909{col 26}{space 2} 15686.37{col 37}{space 1}   -0.11{col 46}{space 3}0.915{col 54}{space 4}-32651.29{col 67}{space 3} 29295.48
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-21.62704{col 26}{space 2}  11.2405{col 37}{space 1}   -1.92{col 46}{space 3}0.056{col 54}{space 4}-43.82226{col 67}{space 3} .5681882
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 2179.533{col 26}{space 2} 1172.238{col 37}{space 1}    1.86{col 46}{space 3}0.065{col 54}{space 4}-135.1039{col 67}{space 3}  4494.17
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-15312.28{col 26}{space 2} 39173.08{col 37}{space 1}   -0.39{col 46}{space 3}0.698{col 54}{space 4}-94162.22{col 67}{space 3} 63537.67
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 85270.45{col 26}{space 2}  1145779{col 37}{space 1}    0.07{col 46}{space 3}0.941{col 54}{space 4} -2177129{col 67}{space 3}  2347670
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 102.7434{col 26}{space 2} 2006.968{col 37}{space 1}    0.05{col 46}{space 3}0.959{col 54}{space 4}-3861.259{col 67}{space 3} 4066.746
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 282.3003{col 26}{space 2} 327.1091{col 37}{space 1}    0.86{col 46}{space 3}0.389{col 54}{space 4}-363.5886{col 67}{space 3} 928.1891
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-18425.71{col 26}{space 2} 5760.565{col 37}{space 1}   -3.20{col 46}{space 3}0.002{col 54}{space 4}-29800.49{col 67}{space 3} -7050.93
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1066173{col 26}{space 2}  1153682{col 37}{space 1}    0.92{col 46}{space 3}0.357{col 54}{space 4} -1211831{col 67}{space 3}  3344176
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0183
{txt}{col 49}Largest FMI{col 67}= {res}    0.2032
{txt}{col 49}Complete DF{col 67}= {res}       166
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     61.43
{txt}{col 49}        avg{col 67}= {res}    154.48
{txt}{col 49}        max{col 67}= {res}    163.96
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  163.7{txt}){col 67}= {res}     14.28
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-7780.391{col 26}{space 2} 8952.369{col 37}{space 1}   -0.87{col 46}{space 3}0.386{col 54}{space 4}-25457.29{col 67}{space 3} 9896.508
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 84108.98{col 26}{space 2} 9388.764{col 37}{space 1}    8.96{col 46}{space 3}0.000{col 54}{space 4} 65558.42{col 67}{space 3} 102659.5
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1698.034{col 26}{space 2} 524.8685{col 37}{space 1}   -3.24{col 46}{space 3}0.001{col 54}{space 4}-2734.417{col 67}{space 3}-661.6515
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-48147.63{col 26}{space 2} 8086.544{col 37}{space 1}   -5.95{col 46}{space 3}0.000{col 54}{space 4}-64115.66{col 67}{space 3}-32179.59
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-1619.735{col 26}{space 2} 8496.585{col 37}{space 1}   -0.19{col 46}{space 3}0.849{col 54}{space 4}-18396.57{col 67}{space 3}  15157.1
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.506388{col 26}{space 2} 6.091325{col 37}{space 1}   -1.40{col 46}{space 3}0.164{col 54}{space 4}-20.53426{col 67}{space 3} 3.521483
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1139.392{col 26}{space 2} 635.6278{col 37}{space 1}    1.79{col 46}{space 3}0.075{col 54}{space 4}-115.7058{col 67}{space 3} 2394.489
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 2651.925{col 26}{space 2} 20592.24{col 37}{space 1}    0.13{col 46}{space 3}0.898{col 54}{space 4}-38519.02{col 67}{space 3} 43822.87
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-240002.2{col 26}{space 2} 621046.4{col 37}{space 1}   -0.39{col 46}{space 3}0.700{col 54}{space 4} -1466303{col 67}{space 3} 986298.2
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}   597.93{col 26}{space 2} 1083.398{col 37}{space 1}    0.55{col 46}{space 3}0.582{col 54}{space 4}-1541.636{col 67}{space 3} 2737.496
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 210.0734{col 26}{space 2} 177.2852{col 37}{space 1}    1.18{col 46}{space 3}0.238{col 54}{space 4}-139.9855{col 67}{space 3} 560.1324
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-8605.049{col 26}{space 2}  3118.54{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 54}{space 4}-14762.83{col 67}{space 3} -2447.27
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 936607.7{col 26}{space 2} 625419.1{col 37}{space 1}    1.50{col 46}{space 3}0.136{col 54}{space 4}-298330.1{col 67}{space 3}  2171545
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0376
{txt}{col 49}Largest FMI{col 67}= {res}    0.3486
{txt}{col 49}Complete DF{col 67}= {res}       166
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     29.75
{txt}{col 49}        avg{col 67}= {res}    148.24
{txt}{col 49}        max{col 67}= {res}    163.90
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  162.8{txt}){col 67}= {res}      8.94
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  560.899{col 26}{space 2} 8038.086{col 37}{space 1}    0.07{col 46}{space 3}0.944{col 54}{space 4}-15310.77{col 67}{space 3} 16432.57
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  71541.9{col 26}{space 2}  8588.87{col 37}{space 1}    8.33{col 46}{space 3}0.000{col 54}{space 4} 54546.91{col 67}{space 3} 88536.88
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-361.4605{col 26}{space 2} 471.8383{col 37}{space 1}   -0.77{col 46}{space 3}0.445{col 54}{space 4}-1293.158{col 67}{space 3} 570.2368
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-16920.32{col 26}{space 2}  7306.22{col 37}{space 1}   -2.32{col 46}{space 3}0.022{col 54}{space 4}-31350.33{col 67}{space 3}-2490.317
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-4390.043{col 26}{space 2} 7628.078{col 37}{space 1}   -0.58{col 46}{space 3}0.566{col 54}{space 4}-19452.01{col 67}{space 3} 10671.93
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-11.55318{col 26}{space 2} 5.470612{col 37}{space 1}   -2.11{col 46}{space 3}0.036{col 54}{space 4} -22.3555{col 67}{space 3}-.7508534
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 923.8859{col 26}{space 2} 572.2014{col 37}{space 1}    1.61{col 46}{space 3}0.108{col 54}{space 4}-206.0422{col 67}{space 3} 2053.814
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-16102.98{col 26}{space 2} 20128.06{col 37}{space 1}   -0.80{col 46}{space 3}0.430{col 54}{space 4}-57224.52{col 67}{space 3} 25018.56
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 137889.7{col 26}{space 2} 559626.4{col 37}{space 1}    0.25{col 46}{space 3}0.806{col 54}{space 4}-967228.3{col 67}{space 3}  1243008
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-210.1024{col 26}{space 2} 988.2262{col 37}{space 1}   -0.21{col 46}{space 3}0.832{col 54}{space 4} -2163.31{col 67}{space 3} 1743.105
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 101.3754{col 26}{space 2} 159.1191{col 37}{space 1}    0.64{col 46}{space 3}0.525{col 54}{space 4}-212.8129{col 67}{space 3} 415.5637
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-8458.523{col 26}{space 2} 2803.493{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4}-13994.38{col 67}{space 3}-2922.663
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 310922.2{col 26}{space 2} 563512.1{col 37}{space 1}    0.55{col 46}{space 3}0.582{col 54}{space 4}-801870.5{col 67}{space 3}  1423715
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. ***********MODEL 5: MODEL2+OXIDATIVE STRESS******
. 
. //Overall//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0125
{txt}{col 49}Largest FMI{col 67}= {res}    0.1063
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    108.38
{txt}{col 49}        avg{col 67}= {res}    159.25
{txt}{col 49}        max{col 67}= {res}    165.93
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  165.8{txt}){col 67}= {res}     14.02
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-2779.111{col 26}{space 2} 17176.94{col 37}{space 1}   -0.16{col 46}{space 3}0.872{col 54}{space 4}-36694.58{col 67}{space 3} 31136.36
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 139676.5{col 26}{space 2} 14209.93{col 37}{space 1}    9.83{col 46}{space 3}0.000{col 54}{space 4} 111619.9{col 67}{space 3}   167733
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2287.513{col 26}{space 2}  938.798{col 37}{space 1}   -2.44{col 46}{space 3}0.016{col 54}{space 4}-4141.052{col 67}{space 3}-433.9744
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-65204.13{col 26}{space 2} 16574.32{col 37}{space 1}   -3.93{col 46}{space 3}0.000{col 54}{space 4}-97941.41{col 67}{space 3}-32466.85
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-1857.318{col 26}{space 2} 16088.83{col 37}{space 1}   -0.12{col 46}{space 3}0.908{col 54}{space 4}-33622.83{col 67}{space 3}  29908.2
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-19.84112{col 26}{space 2} 11.78951{col 37}{space 1}   -1.68{col 46}{space 3}0.094{col 54}{space 4}-43.11851{col 67}{space 3} 3.436271
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 663.6866{col 26}{space 2} 1158.842{col 37}{space 1}    0.57{col 46}{space 3}0.568{col 54}{space 4}-1624.301{col 67}{space 3} 2951.675
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 785.0093{col 26}{space 2} 816.4853{col 37}{space 1}    0.96{col 46}{space 3}0.338{col 54}{space 4}-833.3427{col 67}{space 3} 2403.361
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-5145.254{col 26}{space 2} 27481.76{col 37}{space 1}   -0.19{col 46}{space 3}0.852{col 54}{space 4}-59404.25{col 67}{space 3} 49113.74
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-2425.682{col 26}{space 2} 3533.221{col 37}{space 1}   -0.69{col 46}{space 3}0.493{col 54}{space 4}-9402.651{col 67}{space 3} 4551.286
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1181464{col 26}{space 2} 153605.8{col 37}{space 1}    7.69{col 46}{space 3}0.000{col 54}{space 4} 878184.3{col 67}{space 3}  1484745
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0072
{txt}{col 49}Largest FMI{col 67}= {res}    0.0643
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    135.64
{txt}{col 49}        avg{col 67}= {res}    162.53
{txt}{col 49}        max{col 67}= {res}    165.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  165.9{txt}){col 67}= {res}     15.85
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-4428.886{col 26}{space 2}  9213.59{col 37}{space 1}   -0.48{col 46}{space 3}0.631{col 54}{space 4}-22620.31{col 67}{space 3} 13762.54
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 71394.66{col 26}{space 2} 7625.658{col 37}{space 1}    9.36{col 46}{space 3}0.000{col 54}{space 4} 56338.64{col 67}{space 3} 86450.68
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1950.052{col 26}{space 2} 504.1572{col 37}{space 1}   -3.87{col 46}{space 3}0.000{col 54}{space 4}-2945.441{col 67}{space 3}-954.6634
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-47412.05{col 26}{space 2} 8853.027{col 37}{space 1}   -5.36{col 46}{space 3}0.000{col 54}{space 4}-64894.32{col 67}{space 3}-29929.77
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-2680.073{col 26}{space 2} 8639.521{col 37}{space 1}   -0.31{col 46}{space 3}0.757{col 54}{space 4}-19737.67{col 67}{space 3} 14377.52
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-7.086875{col 26}{space 2} 6.328869{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-19.58251{col 67}{space 3} 5.408762
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  588.946{col 26}{space 2} 622.3618{col 37}{space 1}    0.95{col 46}{space 3}0.345{col 54}{space 4}-639.8234{col 67}{space 3} 1817.715
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 264.2693{col 26}{space 2} 429.4673{col 37}{space 1}    0.62{col 46}{space 3}0.539{col 54}{space 4}-585.0484{col 67}{space 3} 1113.587
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 3124.707{col 26}{space 2} 14761.92{col 37}{space 1}    0.21{col 46}{space 3}0.833{col 54}{space 4}-26020.63{col 67}{space 3} 32270.05
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 409.8111{col 26}{space 2} 1892.812{col 37}{space 1}    0.22{col 46}{space 3}0.829{col 54}{space 4}-3327.582{col 67}{space 3} 4147.204
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 687814.1{col 26}{space 2} 82464.12{col 37}{space 1}    8.34{col 46}{space 3}0.000{col 54}{space 4} 524998.5{col 67}{space 3} 850629.7
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0143
{txt}{col 49}Largest FMI{col 67}= {res}    0.1145
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    103.40
{txt}{col 49}        avg{col 67}= {res}    158.28
{txt}{col 49}        max{col 67}= {res}    165.88
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  165.8{txt}){col 67}= {res}      9.50
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 43.59935{col 26}{space 2} 8336.053{col 37}{space 1}    0.01{col 46}{space 3}0.996{col 54}{space 4}-16416.11{col 67}{space 3} 16503.31
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 57111.78{col 26}{space 2} 6897.494{col 37}{space 1}    8.28{col 46}{space 3}0.000{col 54}{space 4} 43492.83{col 67}{space 3} 70730.73
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}  -733.86{col 26}{space 2} 455.3875{col 37}{space 1}   -1.61{col 46}{space 3}0.109{col 54}{space 4}-1632.972{col 67}{space 3} 165.2524
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-14939.33{col 26}{space 2} 8058.579{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4}-30858.71{col 67}{space 3}  980.044
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-3870.435{col 26}{space 2} 7802.985{col 37}{space 1}   -0.50{col 46}{space 3}0.621{col 54}{space 4}-19276.59{col 67}{space 3} 11535.72
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-10.59031{col 26}{space 2} 5.717619{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4}-21.87931{col 67}{space 3} .6987009
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  183.462{col 26}{space 2} 562.0921{col 37}{space 1}    0.33{col 46}{space 3}0.745{col 54}{space 4}-926.3261{col 67}{space 3}  1293.25
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}  499.862{col 26}{space 2} 397.5201{col 37}{space 1}    1.26{col 46}{space 3}0.211{col 54}{space 4}-288.4892{col 67}{space 3} 1288.213
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} -243.924{col 26}{space 2} 13326.39{col 37}{space 1}   -0.02{col 46}{space 3}0.985{col 54}{space 4}-26555.13{col 67}{space 3} 26067.28
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-2059.328{col 26}{space 2}  1715.73{col 37}{space 1}   -1.20{col 46}{space 3}0.232{col 54}{space 4}-5447.513{col 67}{space 3} 1328.858
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 446903.5{col 26}{space 2} 74502.92{col 37}{space 1}    6.00{col 46}{space 3}0.000{col 54}{space 4} 299803.6{col 67}{space 3} 594003.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //AFRICAN-AMERICAN//
. 
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0463
{txt}{col 49}Largest FMI{col 67}= {res}    0.2815
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     26.67
{txt}{col 49}        avg{col 67}= {res}     56.81
{txt}{col 49}        max{col 67}= {res}     61.23
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   61.5{txt}){col 67}= {res}      5.27
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-51588.17{col 26}{space 2} 28474.58{col 37}{space 1}   -1.81{col 46}{space 3}0.075{col 54}{space 4}  -108527{col 67}{space 3} 5350.669
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 117081.5{col 26}{space 2} 21515.17{col 37}{space 1}    5.44{col 46}{space 3}0.000{col 54}{space 4} 74043.66{col 67}{space 3} 160119.4
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1382.073{col 26}{space 2} 1616.932{col 37}{space 1}   -0.85{col 46}{space 3}0.396{col 54}{space 4}-4617.907{col 67}{space 3} 1853.762
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 20271.04{col 26}{space 2} 24943.13{col 37}{space 1}    0.81{col 46}{space 3}0.420{col 54}{space 4}-29603.71{col 67}{space 3} 70145.78
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.80886{col 26}{space 2} 20.95179{col 37}{space 1}   -0.75{col 46}{space 3}0.453{col 54}{space 4}-57.72061{col 67}{space 3} 26.10289
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-139.0496{col 26}{space 2} 2003.349{col 37}{space 1}   -0.07{col 46}{space 3}0.945{col 54}{space 4}-4145.668{col 67}{space 3} 3867.569
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 2524.622{col 26}{space 2} 1763.672{col 37}{space 1}    1.43{col 46}{space 3}0.164{col 54}{space 4}-1096.236{col 67}{space 3} 6145.479
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}  14215.4{col 26}{space 2} 40113.46{col 37}{space 1}    0.35{col 46}{space 3}0.724{col 54}{space 4}-66027.65{col 67}{space 3} 94458.44
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 1188.644{col 26}{space 2} 6049.703{col 37}{space 1}    0.20{col 46}{space 3}0.845{col 54}{space 4}-10907.56{col 67}{space 3} 13284.85
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 997594.7{col 26}{space 2} 219495.5{col 37}{space 1}    4.54{col 46}{space 3}0.000{col 54}{space 4} 558419.6{col 67}{space 3}  1436770
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0320
{txt}{col 49}Largest FMI{col 67}= {res}    0.2300
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     32.12
{txt}{col 49}        avg{col 67}= {res}     58.24
{txt}{col 49}        max{col 67}= {res}     61.63
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   61.8{txt}){col 67}= {res}      5.37
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-28054.73{col 26}{space 2} 16299.95{col 37}{space 1}   -1.72{col 46}{space 3}0.090{col 54}{space 4}-60643.07{col 67}{space 3} 4533.608
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 58638.83{col 26}{space 2} 12281.37{col 37}{space 1}    4.77{col 46}{space 3}0.000{col 54}{space 4}  34081.4{col 67}{space 3} 83196.27
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1536.472{col 26}{space 2} 920.4758{col 37}{space 1}   -1.67{col 46}{space 3}0.100{col 54}{space 4}-3377.342{col 67}{space 3} 304.3974
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 9991.302{col 26}{space 2} 14281.93{col 37}{space 1}    0.70{col 46}{space 3}0.487{col 54}{space 4}-18561.45{col 67}{space 3} 38544.05
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.607369{col 26}{space 2}  11.9837{col 37}{space 1}   -0.72{col 46}{space 3}0.475{col 54}{space 4}-32.57287{col 67}{space 3} 15.35813
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 5.655725{col 26}{space 2} 1145.025{col 37}{space 1}    0.00{col 46}{space 3}0.996{col 54}{space 4}-2283.699{col 67}{space 3} 2295.011
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 974.1069{col 26}{space 2} 984.1327{col 37}{space 1}    0.99{col 46}{space 3}0.330{col 54}{space 4} -1030.21{col 67}{space 3} 2978.424
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 8330.035{col 26}{space 2} 22867.83{col 37}{space 1}    0.36{col 46}{space 3}0.717{col 54}{space 4}-37393.34{col 67}{space 3} 54053.41
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 2315.204{col 26}{space 2} 3465.699{col 37}{space 1}    0.67{col 46}{space 3}0.507{col 54}{space 4}-4613.461{col 67}{space 3} 9243.869
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   600969{col 26}{space 2} 125200.5{col 37}{space 1}    4.80{col 46}{space 3}0.000{col 54}{space 4} 350585.2{col 67}{space 3} 851352.9
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0419
{txt}{col 49}Largest FMI{col 67}= {res}    0.2204
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     33.25
{txt}{col 49}        avg{col 67}= {res}     57.20
{txt}{col 49}        max{col 67}= {res}     61.21
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   61.6{txt}){col 67}= {res}      3.99
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0005

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-23157.71{col 26}{space 2} 13112.84{col 37}{space 1}   -1.77{col 46}{space 3}0.082{col 54}{space 4}-49382.08{col 67}{space 3} 3066.654
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 47574.83{col 26}{space 2}  9906.56{col 37}{space 1}    4.80{col 46}{space 3}0.000{col 54}{space 4}  27755.3{col 67}{space 3} 67394.36
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-279.5338{col 26}{space 2} 744.3423{col 37}{space 1}   -0.38{col 46}{space 3}0.709{col 54}{space 4}-1769.347{col 67}{space 3} 1210.279
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 3160.981{col 26}{space 2} 11485.09{col 37}{space 1}    0.28{col 46}{space 3}0.784{col 54}{space 4}-19806.67{col 67}{space 3} 26128.63
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-4.836492{col 26}{space 2} 9.599981{col 37}{space 1}   -0.50{col 46}{space 3}0.616{col 54}{space 4}-24.03632{col 67}{space 3} 14.36334
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-353.3756{col 26}{space 2} 922.6603{col 37}{space 1}   -0.38{col 46}{space 3}0.703{col 54}{space 4}-2198.941{col 67}{space 3}  1492.19
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 1343.326{col 26}{space 2} 783.3947{col 37}{space 1}    1.71{col 46}{space 3}0.096{col 54}{space 4}-250.0453{col 67}{space 3} 2936.697
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 5391.079{col 26}{space 2} 18526.51{col 37}{space 1}    0.29{col 46}{space 3}0.772{col 54}{space 4}-31684.11{col 67}{space 3} 42466.27
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-830.8979{col 26}{space 2} 2780.272{col 37}{space 1}   -0.30{col 46}{space 3}0.766{col 54}{space 4}-6390.002{col 67}{space 3} 4728.206
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 406275.6{col 26}{space 2}   100866{col 37}{space 1}    4.03{col 46}{space 3}0.000{col 54}{space 4} 204459.1{col 67}{space 3} 608092.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0065
{txt}{col 49}Largest FMI{col 67}= {res}    0.0464
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     85.24
{txt}{col 49}        avg{col 67}= {res}     92.01
{txt}{col 49}        max{col 67}= {res}     93.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.0{txt}){col 67}= {res}      8.91
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 28969.73{col 26}{space 2} 22939.81{col 37}{space 1}    1.26{col 46}{space 3}0.210{col 54}{space 4}-16585.52{col 67}{space 3} 74524.98
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 151972.9{col 26}{space 2} 19046.26{col 37}{space 1}    7.98{col 46}{space 3}0.000{col 54}{space 4} 114151.1{col 67}{space 3} 189794.7
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2594.943{col 26}{space 2} 1279.745{col 37}{space 1}   -2.03{col 46}{space 3}0.045{col 54}{space 4}-5136.259{col 67}{space 3}-53.62713
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-15943.47{col 26}{space 2} 21497.67{col 37}{space 1}   -0.74{col 46}{space 3}0.460{col 54}{space 4}-58633.37{col 67}{space 3} 26746.44
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-23.82796{col 26}{space 2} 14.77994{col 37}{space 1}   -1.61{col 46}{space 3}0.110{col 54}{space 4} -53.1781{col 67}{space 3} 5.522182
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 510.8234{col 26}{space 2} 1515.553{col 37}{space 1}    0.34{col 46}{space 3}0.737{col 54}{space 4}-2498.763{col 67}{space 3}  3520.41
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 83.96754{col 26}{space 2} 946.9125{col 37}{space 1}    0.09{col 46}{space 3}0.930{col 54}{space 4}-1798.673{col 67}{space 3} 1966.608
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-6588.006{col 26}{space 2} 38541.04{col 37}{space 1}   -0.17{col 46}{space 3}0.865{col 54}{space 4}-83123.36{col 67}{space 3} 69947.35
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-4155.301{col 26}{space 2} 4409.449{col 37}{space 1}   -0.94{col 46}{space 3}0.349{col 54}{space 4}-12914.13{col 67}{space 3} 4603.531
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1106324{col 26}{space 2} 206772.4{col 37}{space 1}    5.35{col 46}{space 3}0.000{col 54}{space 4} 695716.4{col 67}{space 3}  1516933
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0060
{txt}{col 49}Largest FMI{col 67}= {res}    0.0499
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     84.42
{txt}{col 49}        avg{col 67}= {res}     92.02
{txt}{col 49}        max{col 67}= {res}     93.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.0{txt}){col 67}= {res}      9.28
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 10038.86{col 26}{space 2} 11861.32{col 37}{space 1}    0.85{col 46}{space 3}0.400{col 54}{space 4}-13516.17{col 67}{space 3}  33593.9
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 78167.48{col 26}{space 2} 9846.311{col 37}{space 1}    7.94{col 46}{space 3}0.000{col 54}{space 4} 58614.81{col 67}{space 3} 97720.15
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1958.861{col 26}{space 2} 661.5763{col 37}{space 1}   -2.96{col 46}{space 3}0.004{col 54}{space 4}-3272.617{col 67}{space 3}-645.1042
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-10822.88{col 26}{space 2}  11113.9{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-32892.77{col 67}{space 3} 11247.01
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-6.971624{col 26}{space 2} 7.639874{col 37}{space 1}   -0.91{col 46}{space 3}0.364{col 54}{space 4} -22.1429{col 67}{space 3} 8.199649
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 706.0009{col 26}{space 2} 783.5282{col 37}{space 1}    0.90{col 46}{space 3}0.370{col 54}{space 4}-849.9316{col 67}{space 3} 2261.933
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-31.14697{col 26}{space 2} 490.3557{col 37}{space 1}   -0.06{col 46}{space 3}0.950{col 54}{space 4}-1006.201{col 67}{space 3} 943.9075
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 5639.132{col 26}{space 2} 19924.59{col 37}{space 1}    0.28{col 46}{space 3}0.778{col 54}{space 4}-33927.39{col 67}{space 3} 45205.66
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-522.5021{col 26}{space 2} 2272.549{col 37}{space 1}   -0.23{col 46}{space 3}0.819{col 54}{space 4} -5036.05{col 67}{space 3} 3991.046
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 606779.8{col 26}{space 2} 106876.7{col 37}{space 1}    5.68{col 46}{space 3}0.000{col 54}{space 4} 394545.5{col 67}{space 3} 819014.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0074
{txt}{col 49}Largest FMI{col 67}= {res}    0.0507
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     84.24
{txt}{col 49}        avg{col 67}= {res}     91.84
{txt}{col 49}        max{col 67}= {res}     93.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.0{txt}){col 67}= {res}      6.59
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 15429.23{col 26}{space 2} 11564.01{col 37}{space 1}    1.33{col 46}{space 3}0.185{col 54}{space 4}-7535.364{col 67}{space 3} 38393.83
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 62300.12{col 26}{space 2} 9602.127{col 37}{space 1}    6.49{col 46}{space 3}0.000{col 54}{space 4} 43232.24{col 67}{space 3} 81368.01
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-950.0488{col 26}{space 2} 645.1159{col 37}{space 1}   -1.47{col 46}{space 3}0.144{col 54}{space 4}-2231.123{col 67}{space 3} 331.0257
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-8455.374{col 26}{space 2} 10836.04{col 37}{space 1}   -0.78{col 46}{space 3}0.437{col 54}{space 4}-29973.51{col 67}{space 3} 13062.76
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.32544{col 26}{space 2} 7.451684{col 37}{space 1}   -1.92{col 46}{space 3}0.058{col 54}{space 4}-29.12317{col 67}{space 3} .4722931
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 170.9499{col 26}{space 2} 764.0054{col 37}{space 1}    0.22{col 46}{space 3}0.823{col 54}{space 4}-1346.219{col 67}{space 3} 1688.118
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 160.3296{col 26}{space 2} 478.2809{col 37}{space 1}    0.34{col 46}{space 3}0.738{col 54}{space 4}-790.7449{col 67}{space 3} 1111.404
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 1541.715{col 26}{space 2} 19430.58{col 37}{space 1}    0.08{col 46}{space 3}0.937{col 54}{space 4}-37044.07{col 67}{space 3}  40127.5
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-2648.836{col 26}{space 2} 2225.443{col 37}{space 1}   -1.19{col 46}{space 3}0.237{col 54}{space 4}-7069.683{col 67}{space 3}  1772.01
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 418721.7{col 26}{space 2}   104255{col 37}{space 1}    4.02{col 46}{space 3}0.000{col 54}{space 4} 211690.6{col 67}{space 3} 625752.9
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. **********INTERACTION BY Race***************
. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0164
{txt}{col 49}Largest FMI{col 67}= {res}    0.1558
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     80.86
{txt}{col 49}        avg{col 67}= {res}    157.18
{txt}{col 49}        max{col 67}= {res}    164.91
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  164.7{txt}){col 67}= {res}     13.64
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 25188.86{col 28}{space 2}  20318.7{col 39}{space 1}    1.24{col 48}{space 3}0.217{col 56}{space 4}-14931.25{col 69}{space 3} 65308.96
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 63569.71{col 28}{space 2} 54368.52{col 39}{space 1}    1.17{col 48}{space 3}0.244{col 56}{space 4}-43785.19{col 69}{space 3} 170924.6
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-65390.83{col 28}{space 2} 26289.04{col 39}{space 1}   -2.49{col 48}{space 3}0.014{col 56}{space 4}-117297.7{col 69}{space 3}-13483.95
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 138602.8{col 28}{space 2} 14004.33{col 39}{space 1}    9.90{col 48}{space 3}0.000{col 56}{space 4} 110950.9{col 69}{space 3} 166254.7
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2154.685{col 28}{space 2} 925.9735{col 39}{space 1}   -2.33{col 48}{space 3}0.021{col 56}{space 4}-3982.979{col 69}{space 3}-326.3911
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -2459.86{col 28}{space 2} 15853.66{col 39}{space 1}   -0.16{col 48}{space 3}0.877{col 56}{space 4}-33762.67{col 69}{space 3} 28842.95
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-21.29882{col 28}{space 2} 11.63585{col 39}{space 1}   -1.83{col 48}{space 3}0.069{col 56}{space 4}-44.27423{col 69}{space 3} 1.676583
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 471.1598{col 28}{space 2} 1143.952{col 39}{space 1}    0.41{col 48}{space 3}0.681{col 56}{space 4}-1787.531{col 69}{space 3}  2729.85
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 700.9735{col 28}{space 2} 826.1941{col 39}{space 1}    0.85{col 48}{space 3}0.399{col 56}{space 4}-942.9379{col 69}{space 3} 2344.885
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2}-602.6388{col 28}{space 2} 27129.12{col 39}{space 1}   -0.02{col 48}{space 3}0.982{col 56}{space 4}-54167.81{col 69}{space 3} 52962.54
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-2534.914{col 28}{space 2} 3480.428{col 39}{space 1}   -0.73{col 48}{space 3}0.467{col 56}{space 4}-9407.965{col 69}{space 3} 4338.137
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1043828{col 28}{space 2} 150335.7{col 39}{space 1}    6.94{col 48}{space 3}0.000{col 56}{space 4}   746992{col 69}{space 3}  1340665
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0104
{txt}{col 49}Largest FMI{col 67}= {res}    0.1050
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    108.71
{txt}{col 49}        avg{col 67}= {res}    159.92
{txt}{col 49}        max{col 67}= {res}    164.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  164.9{txt}){col 67}= {res}     15.21
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 9550.001{col 28}{space 2} 10929.87{col 39}{space 1}    0.87{col 48}{space 3}0.384{col 56}{space 4}-12030.96{col 69}{space 3} 31130.96
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 16947.33{col 28}{space 2} 29231.86{col 39}{space 1}    0.58{col 48}{space 3}0.563{col 56}{space 4}-40771.18{col 69}{space 3} 74665.84
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-32682.11{col 28}{space 2} 14151.39{col 39}{space 1}   -2.31{col 48}{space 3}0.022{col 56}{space 4}-60623.36{col 69}{space 3}-4740.865
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 70858.08{col 28}{space 2} 7533.398{col 39}{space 1}    9.41{col 48}{space 3}0.000{col 56}{space 4} 55983.53{col 69}{space 3} 85732.63
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1883.668{col 28}{space 2} 498.5511{col 39}{space 1}   -3.78{col 48}{space 3}0.000{col 56}{space 4} -2868.03{col 69}{space 3}-899.3048
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2981.499{col 28}{space 2} 8533.561{col 39}{space 1}   -0.35{col 48}{space 3}0.727{col 56}{space 4}-19830.72{col 69}{space 3} 13867.72
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-7.815753{col 28}{space 2} 6.260659{col 39}{space 1}   -1.25{col 48}{space 3}0.214{col 56}{space 4}-20.17741{col 69}{space 3} 4.545901
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 492.7056{col 28}{space 2} 615.9102{col 39}{space 1}    0.80{col 48}{space 3}0.425{col 56}{space 4}-723.3805{col 69}{space 3} 1708.792
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 222.1268{col 28}{space 2} 433.4874{col 39}{space 1}    0.51{col 48}{space 3}0.609{col 56}{space 4}-637.0564{col 69}{space 3}  1081.31
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 5395.427{col 28}{space 2} 14608.88{col 39}{space 1}    0.37{col 48}{space 3}0.712{col 56}{space 4}-23449.06{col 69}{space 3} 34239.91
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} 355.2043{col 28}{space 2} 1869.059{col 39}{space 1}    0.19{col 48}{space 3}0.850{col 56}{space 4}-3335.458{col 69}{space 3} 4045.867
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 604203.4{col 28}{space 2}  80912.9{col 39}{space 1}    7.47{col 48}{space 3}0.000{col 56}{space 4} 444443.6{col 69}{space 3} 763963.3
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0174
{txt}{col 49}Largest FMI{col 67}= {res}    0.1557
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     80.86
{txt}{col 49}        avg{col 67}= {res}    156.89
{txt}{col 49}        max{col 67}= {res}    164.88
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  164.7{txt}){col 67}= {res}      9.24
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 12092.58{col 28}{space 2} 9896.528{col 39}{space 1}    1.22{col 48}{space 3}0.224{col 56}{space 4}-7448.814{col 69}{space 3} 31633.97
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 40543.77{col 28}{space 2} 26494.97{col 39}{space 1}    1.53{col 48}{space 3}0.128{col 56}{space 4}-11774.18{col 69}{space 3} 92861.73
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-28173.19{col 28}{space 2} 12803.73{col 39}{space 1}   -2.20{col 48}{space 3}0.029{col 56}{space 4}-53454.02{col 69}{space 3}-2892.359
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 56649.13{col 28}{space 2} 6824.455{col 39}{space 1}    8.30{col 48}{space 3}0.000{col 56}{space 4} 43173.72{col 69}{space 3} 70124.54
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -676.625{col 28}{space 2} 450.8895{col 39}{space 1}   -1.50{col 48}{space 3}0.135{col 56}{space 4}-1566.893{col 69}{space 3} 213.6425
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4129.678{col 28}{space 2} 7718.637{col 39}{space 1}   -0.54{col 48}{space 3}0.593{col 56}{space 4}-19370.08{col 69}{space 3} 11110.72
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-11.21791{col 28}{space 2}  5.66422{col 39}{space 1}   -1.98{col 48}{space 3}0.049{col 56}{space 4}-22.40214{col 69}{space 3}-.0336846
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 100.5366{col 28}{space 2} 557.0006{col 39}{space 1}    0.18{col 48}{space 3}0.857{col 56}{space 4}-999.2472{col 69}{space 3}  1200.32
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 463.8435{col 28}{space 2} 402.1342{col 39}{space 1}    1.15{col 48}{space 3}0.252{col 56}{space 4} -336.298{col 69}{space 3} 1263.985
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 1712.736{col 28}{space 2} 13206.17{col 39}{space 1}    0.13{col 48}{space 3}0.897{col 56}{space 4}-24362.28{col 69}{space 3} 27787.75
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-2106.361{col 28}{space 2} 1696.585{col 39}{space 1}   -1.24{col 48}{space 3}0.216{col 56}{space 4}-5456.896{col 69}{space 3} 1244.174
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 400753.9{col 28}{space 2} 73198.62{col 39}{space 1}    5.47{col 48}{space 3}0.000{col 56}{space 4}   256223{col 69}{space 3} 545284.7
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***********MODEL 6: MODEL 2+lifestyle/health-related factors*******  
. 
. 
. //Overall//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0019
{txt}{col 49}Largest FMI{col 67}= {res}    0.0174
{txt}{col 49}Complete DF{col 67}= {res}       169
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    162.30
{txt}{col 49}        avg{col 67}= {res}    166.48
{txt}{col 49}        max{col 67}= {res}    167.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  167.0{txt}){col 67}= {res}     16.13
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 8533.058{col 26}{space 2} 17077.99{col 37}{space 1}    0.50{col 46}{space 3}0.618{col 54}{space 4}-25183.74{col 67}{space 3} 42249.86
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 135739.1{col 26}{space 2} 13760.54{col 37}{space 1}    9.86{col 46}{space 3}0.000{col 54}{space 4} 108572.1{col 67}{space 3} 162906.1
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2563.178{col 26}{space 2} 951.0465{col 37}{space 1}   -2.70{col 46}{space 3}0.008{col 54}{space 4}-4440.813{col 67}{space 3}-685.5435
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-68074.33{col 26}{space 2}  14569.8{col 37}{space 1}   -4.67{col 46}{space 3}0.000{col 54}{space 4}-96839.15{col 67}{space 3}-39309.51
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-189.3218{col 26}{space 2} 16200.15{col 37}{space 1}   -0.01{col 46}{space 3}0.991{col 54}{space 4}-32172.85{col 67}{space 3} 31794.21
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-23.41696{col 26}{space 2} 11.51737{col 37}{space 1}   -2.03{col 46}{space 3}0.044{col 54}{space 4}-46.15543{col 67}{space 3}-.6784953
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 724.9021{col 26}{space 2}  1103.62{col 37}{space 1}    0.66{col 46}{space 3}0.512{col 54}{space 4}-1453.945{col 67}{space 3} 2903.749
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-5984.259{col 26}{space 2} 17631.96{col 37}{space 1}   -0.34{col 46}{space 3}0.735{col 54}{space 4}-40801.88{col 67}{space 3} 28833.36
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 14337.88{col 26}{space 2} 9041.314{col 37}{space 1}    1.59{col 46}{space 3}0.115{col 54}{space 4} -3512.11{col 67}{space 3} 32187.88
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1142967{col 26}{space 2}  72138.1{col 37}{space 1}   15.84{col 46}{space 3}0.000{col 54}{space 4}  1000547{col 67}{space 3}  1285387
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0049
{txt}{col 49}Largest FMI{col 67}= {res}    0.0307
{txt}{col 49}Complete DF{col 67}= {res}       169
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    156.44
{txt}{col 49}        avg{col 67}= {res}    165.44
{txt}{col 49}        max{col 67}= {res}    167.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  167.0{txt}){col 67}= {res}     18.80
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 1544.405{col 26}{space 2} 9106.339{col 37}{space 1}    0.17{col 46}{space 3}0.866{col 54}{space 4}-16435.04{col 67}{space 3} 19523.85
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 69838.74{col 26}{space 2} 7317.683{col 37}{space 1}    9.54{col 46}{space 3}0.000{col 54}{space 4} 55391.65{col 67}{space 3} 84285.82
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2173.814{col 26}{space 2} 506.9499{col 37}{space 1}   -4.29{col 46}{space 3}0.000{col 54}{space 4}-3174.722{col 67}{space 3}-1172.907
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-47553.79{col 26}{space 2} 7753.678{col 37}{space 1}   -6.13{col 46}{space 3}0.000{col 54}{space 4} -62861.9{col 67}{space 3}-32245.69
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-1656.741{col 26}{space 2} 8621.678{col 37}{space 1}   -0.19{col 46}{space 3}0.848{col 54}{space 4}-18678.51{col 67}{space 3} 15365.03
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-9.027316{col 26}{space 2} 6.138837{col 37}{space 1}   -1.47{col 46}{space 3}0.143{col 54}{space 4}-21.14759{col 67}{space 3} 3.092957
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 445.1349{col 26}{space 2} 587.1962{col 37}{space 1}    0.76{col 46}{space 3}0.449{col 54}{space 4}-714.1611{col 67}{space 3} 1604.431
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-12089.36{col 26}{space 2} 9437.982{col 37}{space 1}   -1.28{col 46}{space 3}0.202{col 54}{space 4}-30731.67{col 67}{space 3} 6552.959
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 8856.483{col 26}{space 2} 4813.063{col 37}{space 1}    1.84{col 46}{space 3}0.068{col 54}{space 4}-645.9664{col 67}{space 3} 18358.93
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 699232.6{col 26}{space 2} 38381.65{col 37}{space 1}   18.22{col 46}{space 3}0.000{col 54}{space 4} 623456.1{col 67}{space 3}   775009
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0022
{txt}{col 49}Largest FMI{col 67}= {res}    0.0130
{txt}{col 49}Complete DF{col 67}= {res}       169
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    163.83
{txt}{col 49}        avg{col 67}= {res}    166.57
{txt}{col 49}        max{col 67}= {res}    166.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  167.0{txt}){col 67}= {res}     10.53
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 3722.541{col 26}{space 2}  8344.86{col 37}{space 1}    0.45{col 46}{space 3}0.656{col 54}{space 4}-12752.59{col 67}{space 3} 20197.67
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  56288.7{col 26}{space 2} 6725.512{col 37}{space 1}    8.37{col 46}{space 3}0.000{col 54}{space 4} 43010.67{col 67}{space 3} 69566.73
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-756.4107{col 26}{space 2} 464.6187{col 37}{space 1}   -1.63{col 46}{space 3}0.105{col 54}{space 4}-1673.697{col 67}{space 3} 160.8759
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-18813.54{col 26}{space 2} 7119.779{col 37}{space 1}   -2.64{col 46}{space 3}0.009{col 54}{space 4}-32869.99{col 67}{space 3}-4757.095
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} -3124.41{col 26}{space 2} 7915.412{col 37}{space 1}   -0.39{col 46}{space 3}0.694{col 54}{space 4}-18751.59{col 67}{space 3} 12502.77
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-12.72226{col 26}{space 2} 5.632162{col 37}{space 1}   -2.26{col 46}{space 3}0.025{col 54}{space 4}-23.84186{col 67}{space 3}-1.602666
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 276.1763{col 26}{space 2} 539.2369{col 37}{space 1}    0.51{col 46}{space 3}0.609{col 54}{space 4}-788.4247{col 67}{space 3} 1340.777
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 7790.591{col 26}{space 2} 8596.598{col 37}{space 1}    0.91{col 46}{space 3}0.366{col 54}{space 4}-9183.817{col 67}{space 3}    24765
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 4299.655{col 26}{space 2} 4420.667{col 37}{space 1}    0.97{col 46}{space 3}0.332{col 54}{space 4}-4428.026{col 67}{space 3} 13027.34
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 441208.1{col 26}{space 2} 35251.81{col 37}{space 1}   12.52{col 46}{space 3}0.000{col 54}{space 4} 371611.3{col 67}{space 3}   510805
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0024
{txt}{col 49}Largest FMI{col 67}= {res}    0.0226
{txt}{col 49}Complete DF{col 67}= {res}        65
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     61.35
{txt}{col 49}        avg{col 67}= {res}     62.88
{txt}{col 49}        max{col 67}= {res}     63.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   63.1{txt}){col 67}= {res}      5.95
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-40946.89{col 26}{space 2} 28790.79{col 37}{space 1}   -1.42{col 46}{space 3}0.160{col 54}{space 4}-98479.59{col 67}{space 3}  16585.8
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 114546.8{col 26}{space 2} 21381.28{col 37}{space 1}    5.36{col 46}{space 3}0.000{col 54}{space 4}  71820.7{col 67}{space 3} 157272.9
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -1270.54{col 26}{space 2} 1603.447{col 37}{space 1}   -0.79{col 46}{space 3}0.431{col 54}{space 4}-4474.697{col 67}{space 3} 1933.617
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 17276.89{col 26}{space 2} 24920.29{col 37}{space 1}    0.69{col 46}{space 3}0.491{col 54}{space 4} -32521.1{col 67}{space 3} 67074.88
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-23.90442{col 26}{space 2}  19.8186{col 37}{space 1}   -1.21{col 46}{space 3}0.232{col 54}{space 4}-63.50808{col 67}{space 3} 15.69925
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} -790.816{col 26}{space 2}  1930.67{col 37}{space 1}   -0.41{col 46}{space 3}0.683{col 54}{space 4}-4648.848{col 67}{space 3} 3067.216
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-1081.936{col 26}{space 2} 24005.15{col 37}{space 1}   -0.05{col 46}{space 3}0.964{col 54}{space 4} -49077.6{col 67}{space 3} 46913.73
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 15249.01{col 26}{space 2} 13560.95{col 37}{space 1}    1.12{col 46}{space 3}0.265{col 54}{space 4}-11849.87{col 67}{space 3} 42347.89
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1087796{col 26}{space 2}  96800.2{col 37}{space 1}   11.24{col 46}{space 3}0.000{col 54}{space 4} 894361.8{col 67}{space 3}  1281231
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0025
{txt}{col 49}Largest FMI{col 67}= {res}    0.0091
{txt}{col 49}Complete DF{col 67}= {res}        65
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     62.52
{txt}{col 49}        avg{col 67}= {res}     62.93
{txt}{col 49}        max{col 67}= {res}     63.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   63.1{txt}){col 67}= {res}      6.63
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-20177.36{col 26}{space 2} 16183.41{col 37}{space 1}   -1.25{col 46}{space 3}0.217{col 54}{space 4}-52518.26{col 67}{space 3} 12163.54
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 58628.48{col 26}{space 2} 12005.48{col 37}{space 1}    4.88{col 46}{space 3}0.000{col 54}{space 4} 34637.91{col 67}{space 3} 82619.05
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1661.759{col 26}{space 2} 901.0848{col 37}{space 1}   -1.84{col 46}{space 3}0.070{col 54}{space 4}-3462.458{col 67}{space 3} 138.9401
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}  7760.56{col 26}{space 2} 13994.87{col 37}{space 1}    0.55{col 46}{space 3}0.581{col 54}{space 4}-20205.53{col 67}{space 3} 35726.65
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-11.33053{col 26}{space 2} 11.14561{col 37}{space 1}   -1.02{col 46}{space 3}0.313{col 54}{space 4}-33.60444{col 67}{space 3} 10.94338
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-460.9277{col 26}{space 2} 1084.242{col 37}{space 1}   -0.43{col 46}{space 3}0.672{col 54}{space 4}-2627.575{col 67}{space 3} 1705.719
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-13466.19{col 26}{space 2} 13389.19{col 37}{space 1}   -1.01{col 46}{space 3}0.318{col 54}{space 4}-40226.33{col 67}{space 3} 13293.95
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 10700.12{col 26}{space 2} 7619.864{col 37}{space 1}    1.40{col 46}{space 3}0.165{col 54}{space 4}-4527.177{col 67}{space 3} 25927.41
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 651920.7{col 26}{space 2} 54378.28{col 37}{space 1}   11.99{col 46}{space 3}0.000{col 54}{space 4} 543254.8{col 67}{space 3} 760586.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0054
{txt}{col 49}Largest FMI{col 67}= {res}    0.0397
{txt}{col 49}Complete DF{col 67}= {res}        65
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     59.50
{txt}{col 49}        avg{col 67}= {res}     62.56
{txt}{col 49}        max{col 67}= {res}     63.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   63.1{txt}){col 67}= {res}      4.28
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0004

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-20742.59{col 26}{space 2} 13336.38{col 37}{space 1}   -1.56{col 46}{space 3}0.125{col 54}{space 4}-47395.48{col 67}{space 3}   5910.3
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 45364.12{col 26}{space 2} 9887.163{col 37}{space 1}    4.59{col 46}{space 3}0.000{col 54}{space 4} 25606.09{col 67}{space 3} 65122.14
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-80.67213{col 26}{space 2} 742.4283{col 37}{space 1}   -0.11{col 46}{space 3}0.914{col 54}{space 4}-1564.386{col 67}{space 3} 1403.042
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 2562.526{col 26}{space 2} 11524.81{col 37}{space 1}    0.22{col 46}{space 3}0.825{col 54}{space 4}-20468.14{col 67}{space 3}  25593.2
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-9.580888{col 26}{space 2}  9.15979{col 37}{space 1}   -1.05{col 46}{space 3}0.300{col 54}{space 4}-27.88508{col 67}{space 3} 8.723307
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-520.0537{col 26}{space 2} 892.5392{col 37}{space 1}   -0.58{col 46}{space 3}0.562{col 54}{space 4}-2303.633{col 67}{space 3} 1263.525
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 11143.15{col 26}{space 2} 11185.45{col 37}{space 1}    1.00{col 46}{space 3}0.323{col 54}{space 4}-11234.97{col 67}{space 3} 33521.27
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 4230.406{col 26}{space 2}  6266.96{col 37}{space 1}    0.68{col 46}{space 3}0.502{col 54}{space 4}-8292.906{col 67}{space 3} 16753.72
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 441731.7{col 26}{space 2} 44781.68{col 37}{space 1}    9.86{col 46}{space 3}0.000{col 54}{space 4} 352240.9{col 67}{space 3} 531222.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0076
{txt}{col 49}Largest FMI{col 67}= {res}    0.0669
{txt}{col 49}Complete DF{col 67}= {res}        96
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     80.92
{txt}{col 49}        avg{col 67}= {res}     92.44
{txt}{col 49}        max{col 67}= {res}     94.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   94.0{txt}){col 67}= {res}     10.24
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 36302.55{col 26}{space 2}  22273.8{col 37}{space 1}    1.63{col 46}{space 3}0.106{col 54}{space 4}-7922.585{col 67}{space 3} 80527.69
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}   151336{col 26}{space 2}  18734.1{col 37}{space 1}    8.08{col 46}{space 3}0.000{col 54}{space 4} 114136.1{col 67}{space 3} 188535.9
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2767.596{col 26}{space 2} 1293.916{col 37}{space 1}   -2.14{col 46}{space 3}0.035{col 54}{space 4}-5336.714{col 67}{space 3}-198.4769
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-10469.43{col 26}{space 2} 22134.62{col 37}{space 1}   -0.47{col 46}{space 3}0.637{col 54}{space 4}-54418.25{col 67}{space 3} 33479.38
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-28.15647{col 26}{space 2} 14.81617{col 37}{space 1}   -1.90{col 46}{space 3}0.060{col 54}{space 4}-57.57411{col 67}{space 3} 1.261181
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 967.1198{col 26}{space 2} 1442.125{col 37}{space 1}    0.67{col 46}{space 3}0.504{col 54}{space 4}  -1896.3{col 67}{space 3}  3830.54
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 6748.776{col 26}{space 2} 27648.14{col 37}{space 1}    0.24{col 46}{space 3}0.808{col 54}{space 4}-48263.12{col 67}{space 3} 61760.67
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 14115.76{col 26}{space 2} 12644.59{col 37}{space 1}    1.12{col 46}{space 3}0.267{col 54}{space 4}-10990.19{col 67}{space 3} 39221.71
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1016868{col 26}{space 2} 98904.34{col 37}{space 1}   10.28{col 46}{space 3}0.000{col 54}{space 4} 820481.1{col 67}{space 3}  1213255
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0068
{txt}{col 49}Largest FMI{col 67}= {res}    0.0601
{txt}{col 49}Complete DF{col 67}= {res}        96
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     82.71
{txt}{col 49}        avg{col 67}= {res}     92.65
{txt}{col 49}        max{col 67}= {res}     94.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   94.0{txt}){col 67}= {res}     10.83
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 12252.32{col 26}{space 2} 11474.89{col 37}{space 1}    1.07{col 46}{space 3}0.288{col 54}{space 4}-10531.42{col 67}{space 3} 35036.07
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 78767.67{col 26}{space 2} 9644.499{col 37}{space 1}    8.17{col 46}{space 3}0.000{col 54}{space 4} 59617.18{col 67}{space 3} 97918.17
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2071.198{col 26}{space 2} 666.6309{col 37}{space 1}   -3.11{col 46}{space 3}0.003{col 54}{space 4}-3394.825{col 67}{space 3}  -747.57
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-7708.853{col 26}{space 2} 11402.34{col 37}{space 1}   -0.68{col 46}{space 3}0.501{col 54}{space 4}-30348.51{col 67}{space 3}  14930.8
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-9.380782{col 26}{space 2}  7.63375{col 37}{space 1}   -1.23{col 46}{space 3}0.222{col 54}{space 4}-24.53777{col 67}{space 3} 5.776202
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 744.8827{col 26}{space 2}  742.781{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4}-729.9473{col 67}{space 3} 2219.713
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-954.3332{col 26}{space 2} 14193.84{col 37}{space 1}   -0.07{col 46}{space 3}0.947{col 54}{space 4}-29186.77{col 67}{space 3}  27278.1
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 7150.737{col 26}{space 2} 6513.394{col 37}{space 1}    1.10{col 46}{space 3}0.275{col 54}{space 4}-5781.666{col 67}{space 3} 20083.14
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 612701.7{col 26}{space 2} 50925.38{col 37}{space 1}   12.03{col 46}{space 3}0.000{col 54}{space 4} 511584.3{col 67}{space 3} 713819.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0098
{txt}{col 49}Largest FMI{col 67}= {res}    0.0708
{txt}{col 49}Complete DF{col 67}= {res}        96
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     79.88
{txt}{col 49}        avg{col 67}= {res}     92.21
{txt}{col 49}        max{col 67}= {res}     94.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   94.0{txt}){col 67}= {res}      7.51
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 18169.81{col 26}{space 2}  11253.2{col 37}{space 1}    1.61{col 46}{space 3}0.110{col 54}{space 4}-4174.162{col 67}{space 3} 40513.79
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 64283.27{col 26}{space 2} 9464.618{col 37}{space 1}    6.79{col 46}{space 3}0.000{col 54}{space 4}  45489.1{col 67}{space 3} 83077.44
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -965.082{col 26}{space 2} 652.9471{col 37}{space 1}   -1.48{col 46}{space 3}0.143{col 54}{space 4}-2261.519{col 67}{space 3} 331.3549
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -5817.91{col 26}{space 2} 11173.49{col 37}{space 1}   -0.52{col 46}{space 3}0.604{col 54}{space 4}-28003.11{col 67}{space 3} 16367.29
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-17.12466{col 26}{space 2} 7.493275{col 37}{space 1}   -2.29{col 46}{space 3}0.025{col 54}{space 4} -32.0034{col 67}{space 3}-2.245921
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 397.4981{col 26}{space 2} 728.0068{col 37}{space 1}    0.55{col 46}{space 3}0.586{col 54}{space 4}    -1048{col 67}{space 3} 1842.996
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 12723.75{col 26}{space 2} 13983.92{col 37}{space 1}    0.91{col 46}{space 3}0.366{col 54}{space 4}-15105.79{col 67}{space 3} 40553.29
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 5529.646{col 26}{space 2} 6384.489{col 37}{space 1}    0.87{col 46}{space 3}0.389{col 54}{space 4}-7146.875{col 67}{space 3} 18206.17
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 395095.4{col 26}{space 2}  49991.2{col 37}{space 1}    7.90{col 46}{space 3}0.000{col 54}{space 4} 295827.5{col 67}{space 3} 494363.2
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. ******************INTERACTION BY Race***********************
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0016
{txt}{col 49}Largest FMI{col 67}= {res}    0.0172
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    161.41
{txt}{col 49}        avg{col 67}= {res}    165.58
{txt}{col 49}        max{col 67}= {res}    166.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  166.0{txt}){col 67}= {res}     15.53
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 34212.03{col 28}{space 2} 19863.21{col 39}{space 1}    1.72{col 48}{space 3}0.087{col 56}{space 4}-5005.076{col 69}{space 3} 73429.13
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 57341.78{col 28}{space 2} 53494.61{col 39}{space 1}    1.07{col 48}{space 3}0.285{col 56}{space 4}-48275.58{col 69}{space 3} 162959.1
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-63735.78{col 28}{space 2} 26189.41{col 39}{space 1}   -2.43{col 48}{space 3}0.016{col 56}{space 4}  -115443{col 69}{space 3}-12028.56
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 135613.2{col 28}{space 2} 13564.74{col 39}{space 1}   10.00{col 48}{space 3}0.000{col 56}{space 4} 108831.5{col 69}{space 3} 162394.8
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2389.115{col 28}{space 2} 940.0553{col 39}{space 1}   -2.54{col 48}{space 3}0.012{col 56}{space 4}-4245.126{col 69}{space 3}-533.1032
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -548.968{col 28}{space 2} 15969.31{col 39}{space 1}   -0.03{col 48}{space 3}0.973{col 56}{space 4}-32078.13{col 69}{space 3} 30980.19
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-24.92292{col 28}{space 2}  11.3685{col 39}{space 1}   -2.19{col 48}{space 3}0.030{col 56}{space 4}-47.36843{col 69}{space 3}-2.477417
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 527.8896{col 28}{space 2} 1090.835{col 39}{space 1}    0.48{col 48}{space 3}0.629{col 56}{space 4}-1625.809{col 69}{space 3} 2681.588
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-2149.133{col 28}{space 2} 17459.63{col 39}{space 1}   -0.12{col 48}{space 3}0.902{col 56}{space 4}-36627.89{col 69}{space 3} 32329.62
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 13264.64{col 28}{space 2} 8922.906{col 39}{space 1}    1.49{col 48}{space 3}0.139{col 56}{space 4}-4352.346{col 69}{space 3} 30881.62
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1022886{col 28}{space 2} 71351.79{col 39}{space 1}   14.34{col 48}{space 3}0.000{col 56}{space 4} 882012.3{col 69}{space 3}  1163761
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0035
{txt}{col 49}Largest FMI{col 67}= {res}    0.0238
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    158.75
{txt}{col 49}        avg{col 67}= {res}    164.97
{txt}{col 49}        max{col 67}= {res}    166.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  166.0{txt}){col 67}= {res}     17.77
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 13621.52{col 28}{space 2} 10627.78{col 39}{space 1}    1.28{col 48}{space 3}0.202{col 56}{space 4}-7362.412{col 69}{space 3} 34605.46
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 11428.76{col 28}{space 2} 28574.24{col 39}{space 1}    0.40{col 48}{space 3}0.690{col 56}{space 4} -44987.5{col 69}{space 3} 67845.03
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} -29973.7{col 28}{space 2} 13993.51{col 39}{space 1}   -2.14{col 48}{space 3}0.034{col 56}{space 4}-57602.29{col 69}{space 3}-2345.107
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 69778.86{col 28}{space 2} 7240.654{col 39}{space 1}    9.64{col 48}{space 3}0.000{col 56}{space 4} 55483.24{col 69}{space 3} 84074.49
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2092.022{col 28}{space 2} 502.8735{col 39}{space 1}   -4.16{col 48}{space 3}0.000{col 56}{space 4}-3084.915{col 69}{space 3}-1099.128
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-1826.289{col 28}{space 2} 8531.484{col 39}{space 1}   -0.21{col 48}{space 3}0.831{col 56}{space 4}-18670.72{col 69}{space 3} 15018.15
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-9.735952{col 28}{space 2} 6.079823{col 39}{space 1}   -1.60{col 48}{space 3}0.111{col 56}{space 4}-21.74009{col 69}{space 3} 2.268186
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 352.3911{col 28}{space 2} 582.4572{col 39}{space 1}    0.61{col 48}{space 3}0.546{col 56}{space 4}-797.5931{col 69}{space 3} 1502.375
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-10295.18{col 28}{space 2} 9350.351{col 39}{space 1}   -1.10{col 48}{space 3}0.273{col 56}{space 4} -28762.3{col 69}{space 3} 8171.951
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 8351.856{col 28}{space 2} 4767.183{col 39}{space 1}    1.75{col 48}{space 3}0.082{col 56}{space 4}-1060.384{col 69}{space 3}  17764.1
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 627228.7{col 28}{space 2} 38117.18{col 39}{space 1}   16.46{col 48}{space 3}0.000{col 56}{space 4} 551970.7{col 69}{space 3} 702486.7
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0034
{txt}{col 49}Largest FMI{col 67}= {res}    0.0221
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    159.48
{txt}{col 49}        avg{col 67}= {res}    165.15
{txt}{col 49}        max{col 67}= {res}    165.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  166.0{txt}){col 67}= {res}     10.22
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 15476.54{col 28}{space 2}  9737.45{col 39}{space 1}    1.59{col 48}{space 3}0.114{col 56}{space 4}-3749.044{col 69}{space 3} 34702.13
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 38595.07{col 28}{space 2} 26212.49{col 39}{space 1}    1.47{col 48}{space 3}0.143{col 56}{space 4}-13158.26{col 69}{space 3} 90348.39
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-29175.75{col 28}{space 2} 12839.21{col 39}{space 1}   -2.27{col 48}{space 3}0.024{col 56}{space 4}-54525.42{col 69}{space 3}-3826.086
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 56231.76{col 28}{space 2} 6644.732{col 39}{space 1}    8.46{col 48}{space 3}0.000{col 56}{space 4} 43112.61{col 69}{space 3} 69350.91
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -676.661{col 28}{space 2} 460.4424{col 39}{space 1}   -1.47{col 48}{space 3}0.144{col 56}{space 4}-1585.746{col 69}{space 3}  232.424
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3288.607{col 28}{space 2} 7819.586{col 39}{space 1}   -0.42{col 48}{space 3}0.675{col 56}{space 4}-18727.28{col 69}{space 3} 12150.07
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-13.41118{col 28}{space 2} 5.574127{col 39}{space 1}   -2.41{col 48}{space 3}0.017{col 56}{space 4}-24.41675{col 69}{space 3}-2.405608
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 186.0935{col 28}{space 2} 534.2666{col 39}{space 1}    0.35{col 48}{space 3}0.728{col 56}{space 4}-868.7441{col 69}{space 3} 1240.931
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2} 9556.539{col 28}{space 2} 8569.882{col 39}{space 1}    1.12{col 48}{space 3}0.266{col 56}{space 4}-7368.555{col 69}{space 3} 26481.63
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 3808.288{col 28}{space 2} 4373.772{col 39}{space 1}    0.87{col 48}{space 3}0.385{col 56}{space 4}-4827.235{col 69}{space 3} 12443.81
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 398580.1{col 28}{space 2} 34981.56{col 39}{space 1}   11.39{col 48}{space 3}0.000{col 56}{space 4} 329512.4{col 69}{space 3} 467647.8
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ////////////////////////////////////////LnNFLw3 exposure/////////////////////////////////////////////
> 
. 
. ***********************LnNFLw3, MODELS 1 AND 2*********************
. 
. *********************AFRICAN-AMERICAN*******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(5, 68)        = {res}     8.79
{txt}       Model {c |} {res} 3.3187e+11         5  6.6373e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 5.1346e+11        68  7.5509e+09   {txt}R-squared       ={res}    0.3926
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3479
{txt}       Total {c |} {res} 8.4533e+11        73  1.1580e+10   {txt}Root MSE        =   {res}  86896

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-18547.84{col 26}{space 2} 17918.21{col 37}{space 1}   -1.04{col 46}{space 3}0.304{col 67}{space 3} -.111493
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 121908.8{col 26}{space 2} 20845.85{col 37}{space 1}    5.85{col 46}{space 3}0.000{col 67}{space 3} .5684291
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2098.441{col 26}{space 2} 1274.921{col 37}{space 1}   -1.65{col 46}{space 3}0.104{col 67}{space 3} -.190504
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 18302.25{col 26}{space 2} 25010.95{col 37}{space 1}    0.73{col 46}{space 3}0.467{col 67}{space 3} .0835952
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-22.97114{col 26}{space 2} 19.68631{col 37}{space 1}   -1.17{col 46}{space 3}0.247{col 67}{space 3}-.1228129
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1084158{col 26}{space 2} 79133.21{col 37}{space 1}   13.70{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(5, 68)        = {res}     9.09
{txt}       Model {c |} {res} 1.1184e+11         5  2.2368e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.6735e+11        68  2.4610e+09   {txt}R-squared       ={res}    0.4006
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3565
{txt}       Total {c |} {res} 2.7919e+11        73  3.8245e+09   {txt}Root MSE        =   {res}  49608

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-10746.05{col 26}{space 2} 10229.33{col 37}{space 1}   -1.05{col 46}{space 3}0.297{col 67}{space 3}-.1124008
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 62226.04{col 26}{space 2}  11900.7{col 37}{space 1}    5.23{col 46}{space 3}0.000{col 67}{space 3} .5048701
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -1975.72{col 26}{space 2} 727.8399{col 37}{space 1}   -2.71{col 46}{space 3}0.008{col 67}{space 3}-.3121038
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 9773.147{col 26}{space 2} 14278.51{col 37}{space 1}    0.68{col 46}{space 3}0.496{col 67}{space 3} .0776744
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-11.84125{col 26}{space 2} 11.23873{col 37}{space 1}   -1.05{col 46}{space 3}0.296{col 67}{space 3}-.1101603
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 650379.9{col 26}{space 2} 45176.39{col 37}{space 1}   14.40{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        74
{txt}{hline 13}{c +}{hline 34}   F(5, 68)        = {res}     6.38
{txt}       Model {c |} {res} 5.0856e+10         5  1.0171e+10   {txt}Prob > F        ={res}    0.0001
{txt}    Residual {c |} {res} 1.0838e+11        68  1.5939e+09   {txt}R-squared       ={res}    0.3194
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.2693
{txt}       Total {c |} {res} 1.5924e+11        73  2.1813e+09   {txt}Root MSE        =   {res}  39923

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-8375.268{col 26}{space 2} 8232.281{col 37}{space 1}   -1.02{col 46}{space 3}0.313{col 67}{space 3}-.1159956
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 49379.96{col 26}{space 2} 9577.348{col 37}{space 1}    5.16{col 46}{space 3}0.000{col 67}{space 3} .5304939
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-600.3609{col 26}{space 2} 585.7452{col 37}{space 1}   -1.02{col 46}{space 3}0.309{col 67}{space 3}-.1255765
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 1615.209{col 26}{space 2} 11490.95{col 37}{space 1}    0.14{col 46}{space 3}0.889{col 67}{space 3} .0169979
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.158743{col 26}{space 2} 9.044612{col 37}{space 1}   -0.90{col 46}{space 3}0.370{col 67}{space 3}-.1005016
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 434152.5{col 26}{space 2} 36356.69{col 37}{space 1}   11.94{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        67
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     65.09
{txt}{col 49}        avg{col 67}= {res}     65.09
{txt}{col 49}        max{col 67}= {res}     65.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   65.1{txt}){col 67}= {res}      7.28
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-16875.36{col 26}{space 2} 18331.88{col 37}{space 1}   -0.92{col 46}{space 3}0.361{col 54}{space 4}-53485.75{col 67}{space 3} 19735.02
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 123194.2{col 26}{space 2} 21122.37{col 37}{space 1}    5.83{col 46}{space 3}0.000{col 54}{space 4} 81010.95{col 67}{space 3} 165377.4
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2280.453{col 26}{space 2} 1333.641{col 37}{space 1}   -1.71{col 46}{space 3}0.092{col 54}{space 4}-4943.851{col 67}{space 3}  382.945
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 16902.76{col 26}{space 2} 25308.97{col 37}{space 1}    0.67{col 46}{space 3}0.507{col 54}{space 4}-33641.49{col 67}{space 3} 67447.01
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-22.89243{col 26}{space 2} 19.79708{col 37}{space 1}   -1.16{col 46}{space 3}0.252{col 54}{space 4}-62.42894{col 67}{space 3} 16.64409
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 829.9951{col 26}{space 2} 1675.104{col 37}{space 1}    0.50{col 46}{space 3}0.622{col 54}{space 4}-2515.334{col 67}{space 3} 4175.324
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1064617{col 26}{space 2} 88812.51{col 37}{space 1}   11.99{col 46}{space 3}0.000{col 54}{space 4} 887250.2{col 67}{space 3}  1241983
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        67
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     65.09
{txt}{col 49}        avg{col 67}= {res}     65.09
{txt}{col 49}        max{col 67}= {res}     65.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   65.1{txt}){col 67}= {res}      7.56
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-9606.053{col 26}{space 2} 10457.33{col 37}{space 1}   -0.92{col 46}{space 3}0.362{col 54}{space 4}-30490.27{col 67}{space 3} 11278.16
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 63102.16{col 26}{space 2} 12049.15{col 37}{space 1}    5.24{col 46}{space 3}0.000{col 54}{space 4} 39038.94{col 67}{space 3} 87165.38
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2099.783{col 26}{space 2} 760.7688{col 37}{space 1}   -2.76{col 46}{space 3}0.007{col 54}{space 4}-3619.105{col 67}{space 3}-580.4608
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}  8819.22{col 26}{space 2} 14437.38{col 37}{space 1}    0.61{col 46}{space 3}0.543{col 54}{space 4} -20013.5{col 67}{space 3} 37651.94
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-11.78759{col 26}{space 2} 11.29315{col 37}{space 1}   -1.04{col 46}{space 3}0.300{col 54}{space 4}  -34.341{col 67}{space 3} 10.76582
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 565.7426{col 26}{space 2} 955.5546{col 37}{space 1}    0.59{col 46}{space 3}0.556{col 54}{space 4}-1342.584{col 67}{space 3} 2474.069
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 637060.3{col 26}{space 2} 50662.66{col 37}{space 1}   12.57{col 46}{space 3}0.000{col 54}{space 4} 535882.5{col 67}{space 3} 738238.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        67
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     65.09
{txt}{col 49}        avg{col 67}= {res}     65.09
{txt}{col 49}        max{col 67}= {res}     65.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   65.1{txt}){col 67}= {res}      5.24
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0002

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-8243.544{col 26}{space 2} 8437.301{col 37}{space 1}   -0.98{col 46}{space 3}0.332{col 54}{space 4}-25093.58{col 67}{space 3}  8606.49
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  49481.2{col 26}{space 2} 9721.633{col 37}{space 1}    5.09{col 46}{space 3}0.000{col 54}{space 4} 30066.24{col 67}{space 3} 68896.15
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-614.6962{col 26}{space 2}  613.812{col 37}{space 1}   -1.00{col 46}{space 3}0.320{col 54}{space 4}-1840.533{col 67}{space 3} 611.1404
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1504.985{col 26}{space 2} 11648.53{col 37}{space 1}    0.13{col 46}{space 3}0.898{col 54}{space 4}-21758.15{col 67}{space 3} 24768.12
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.152543{col 26}{space 2} 9.111664{col 37}{space 1}   -0.89{col 46}{space 3}0.374{col 54}{space 4}-26.34934{col 67}{space 3} 10.04425
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 65.37044{col 26}{space 2} 770.9712{col 37}{space 1}    0.08{col 46}{space 3}0.933{col 54}{space 4}-1474.327{col 67}{space 3} 1605.068
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 432613.5{col 26}{space 2} 40876.22{col 37}{space 1}   10.58{col 46}{space 3}0.000{col 54}{space 4} 350980.1{col 67}{space 3} 514246.9
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. *********************WHITES******************************************************
. 
. **Model 1**
. 
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       105
{txt}{hline 13}{c +}{hline 34}   F(5, 99)        = {res}    15.84
{txt}       Model {c |} {res} 6.4104e+11         5  1.2821e+11   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 8.0147e+11        99  8.0957e+09   {txt}R-squared       ={res}    0.4444
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4163
{txt}       Total {c |} {res} 1.4425e+12       104  1.3870e+10   {txt}Root MSE        =   {res}  89976

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 11911.01{col 26}{space 2} 19691.19{col 37}{space 1}    0.60{col 46}{space 3}0.547{col 67}{space 3} .0513042
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 149423.5{col 26}{space 2}  17919.6{col 37}{space 1}    8.34{col 46}{space 3}0.000{col 67}{space 3} .6325119
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1985.824{col 26}{space 2} 1181.512{col 37}{space 1}   -1.68{col 46}{space 3}0.096{col 67}{space 3} -.142038
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-19000.84{col 26}{space 2} 21233.19{col 37}{space 1}   -0.89{col 46}{space 3}0.373{col 67}{space 3}-.0708511
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-23.21674{col 26}{space 2} 14.12331{col 37}{space 1}   -1.64{col 46}{space 3}0.103{col 67}{space 3}-.1287583
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1092868{col 26}{space 2} 72065.17{col 37}{space 1}   15.16{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       105
{txt}{hline 13}{c +}{hline 34}   F(5, 99)        = {res}    17.00
{txt}       Model {c |} {res} 1.8143e+11         5  3.6285e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.1136e+11        99  2.1350e+09   {txt}R-squared       ={res}    0.4619
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4347
{txt}       Total {c |} {res} 3.9279e+11       104  3.7768e+09   {txt}Root MSE        =   {res}  46206

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-383.7444{col 26}{space 2} 10112.06{col 37}{space 1}   -0.04{col 46}{space 3}0.970{col 67}{space 3}-.0031676
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 78266.15{col 26}{space 2} 9202.294{col 37}{space 1}    8.51{col 46}{space 3}0.000{col 67}{space 3} .6348997
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1706.098{col 26}{space 2} 606.7448{col 37}{space 1}   -2.81{col 46}{space 3}0.006{col 67}{space 3}-.2338563
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-11425.38{col 26}{space 2} 10903.93{col 37}{space 1}   -1.05{col 46}{space 3}0.297{col 67}{space 3}-.0816443
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-7.461271{col 26}{space 2} 7.252777{col 37}{space 1}   -1.03{col 46}{space 3}0.306{col 67}{space 3}-.0792991
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   661033{col 26}{space 2}  37007.8{col 37}{space 1}   17.86{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}       105
{txt}{hline 13}{c +}{hline 34}   F(5, 99)        = {res}    11.34
{txt}       Model {c |} {res} 1.1746e+11         5  2.3492e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.0509e+11        99  2.0716e+09   {txt}R-squared       ={res}    0.3642
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3320
{txt}       Total {c |} {res} 3.2255e+11       104  3.1015e+09   {txt}Root MSE        =   {res}  45515

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 7225.937{col 26}{space 2} 9960.985{col 37}{space 1}    0.73{col 46}{space 3}0.470{col 67}{space 3}   .06582
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 61836.75{col 26}{space 2} 9064.807{col 37}{space 1}    6.82{col 46}{space 3}0.000{col 67}{space 3} .5535488
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-642.2755{col 26}{space 2} 597.6797{col 37}{space 1}   -1.07{col 46}{space 3}0.285{col 67}{space 3}-.0971504
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-10347.38{col 26}{space 2} 10741.02{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 67}{space 3} -.081595
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.48656{col 26}{space 2} 7.144417{col 37}{space 1}   -2.03{col 46}{space 3}0.045{col 67}{space 3} -.169902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   431138{col 26}{space 2} 36454.89{col 37}{space 1}   11.83{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        98
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     96.06
{txt}{col 49}        avg{col 67}= {res}     96.06
{txt}{col 49}        max{col 67}= {res}     96.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   96.1{txt}){col 67}= {res}     13.12
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 12468.25{col 26}{space 2} 19814.52{col 37}{space 1}    0.63{col 46}{space 3}0.531{col 54}{space 4}-26862.94{col 67}{space 3} 51799.44
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 150423.2{col 26}{space 2}  18141.6{col 37}{space 1}    8.29{col 46}{space 3}0.000{col 54}{space 4} 114412.7{col 67}{space 3} 186433.8
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1947.115{col 26}{space 2} 1189.768{col 37}{space 1}   -1.64{col 46}{space 3}0.105{col 54}{space 4}-4308.766{col 67}{space 3} 414.5362
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-19154.57{col 26}{space 2} 21323.89{col 37}{space 1}   -0.90{col 46}{space 3}0.371{col 54}{space 4}-61481.82{col 67}{space 3} 23172.67
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-22.30441{col 26}{space 2}  14.3378{col 37}{space 1}   -1.56{col 46}{space 3}0.123{col 54}{space 4}-50.76449{col 67}{space 3} 6.155672
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 612.9474{col 26}{space 2} 1417.711{col 37}{space 1}    0.43{col 46}{space 3}0.666{col 54}{space 4}-2201.165{col 67}{space 3}  3427.06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1068736{col 26}{space 2} 91387.33{col 37}{space 1}   11.69{col 46}{space 3}0.000{col 54}{space 4} 887335.2{col 67}{space 3}  1250137
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        98
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     96.06
{txt}{col 49}        avg{col 67}= {res}     96.06
{txt}{col 49}        max{col 67}= {res}     96.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   96.1{txt}){col 67}= {res}     14.24
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 171.9681{col 26}{space 2} 10148.47{col 37}{space 1}    0.02{col 46}{space 3}0.987{col 54}{space 4}-19972.42{col 67}{space 3} 20316.36
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 79263.12{col 26}{space 2} 9291.647{col 37}{space 1}    8.53{col 46}{space 3}0.000{col 54}{space 4} 60819.49{col 67}{space 3} 97706.75
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1667.496{col 26}{space 2} 609.3674{col 37}{space 1}   -2.74{col 46}{space 3}0.007{col 54}{space 4}-2877.071{col 67}{space 3}-457.9204
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -11578.7{col 26}{space 2} 10921.53{col 37}{space 1}   -1.06{col 46}{space 3}0.292{col 54}{space 4}-33257.59{col 67}{space 3}  10100.2
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-6.551448{col 26}{space 2}  7.34344{col 37}{space 1}   -0.89{col 46}{space 3}0.375{col 54}{space 4}-21.12795{col 67}{space 3} 8.025049
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 611.2593{col 26}{space 2} 726.1142{col 37}{space 1}    0.84{col 46}{space 3}0.402{col 54}{space 4}-830.0547{col 67}{space 3} 2052.573
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 636968.1{col 26}{space 2} 46806.17{col 37}{space 1}   13.61{col 46}{space 3}0.000{col 54}{space 4} 544059.3{col 67}{space 3} 729876.8
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        98
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     96.06
{txt}{col 49}        avg{col 67}= {res}     96.06
{txt}{col 49}        max{col 67}= {res}     96.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   96.1{txt}){col 67}= {res}      9.37
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}  7365.14{col 26}{space 2}  10030.6{col 37}{space 1}    0.73{col 46}{space 3}0.465{col 54}{space 4}-12545.28{col 67}{space 3} 27275.56
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 62086.49{col 26}{space 2} 9183.726{col 37}{space 1}    6.76{col 46}{space 3}0.000{col 54}{space 4} 43857.08{col 67}{space 3} 80315.89
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-632.6058{col 26}{space 2} 602.2897{col 37}{space 1}   -1.05{col 46}{space 3}0.296{col 54}{space 4}-1828.132{col 67}{space 3} 562.9203
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-10385.78{col 26}{space 2} 10794.68{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4}-31812.88{col 67}{space 3} 11041.32
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.25865{col 26}{space 2} 7.258147{col 37}{space 1}   -1.96{col 46}{space 3}0.052{col 54}{space 4}-28.66585{col 67}{space 3} .1485403
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 153.1162{col 26}{space 2} 717.6805{col 37}{space 1}    0.21{col 46}{space 3}0.832{col 54}{space 4}-1271.457{col 67}{space 3}  1577.69
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 425109.9{col 26}{space 2} 46262.52{col 37}{space 1}    9.19{col 46}{space 3}0.000{col 54}{space 4} 333280.3{col 67}{space 3} 516939.6
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //INTERACTION BY Race//
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       170
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    168.03
{txt}{col 49}        avg{col 67}= {res}    168.03
{txt}{col 49}        max{col 67}= {res}    168.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  168.0{txt}){col 67}= {res}     18.27
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 17089.45{col 28}{space 2} 18422.79{col 39}{space 1}    0.93{col 48}{space 3}0.355{col 56}{space 4}-19280.49{col 69}{space 3} 53459.38
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 10359.86{col 28}{space 2} 53810.89{col 39}{space 1}    0.19{col 48}{space 3}0.848{col 56}{space 4}-95872.64{col 69}{space 3} 116592.4
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-37083.94{col 28}{space 2} 23544.98{col 39}{space 1}   -1.58{col 48}{space 3}0.117{col 56}{space 4}-83566.01{col 69}{space 3} 9398.135
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 139330.1{col 28}{space 2} 13681.06{col 39}{space 1}   10.18{col 48}{space 3}0.000{col 56}{space 4} 112321.2{col 69}{space 3}   166339
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2201.935{col 28}{space 2} 853.3511{col 39}{space 1}   -2.58{col 48}{space 3}0.011{col 56}{space 4}-3886.605{col 69}{space 3}-517.2641
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2379.567{col 28}{space 2}  15882.5{col 39}{space 1}   -0.15{col 48}{space 3}0.881{col 56}{space 4}-33734.51{col 69}{space 3} 28975.37
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-21.78963{col 28}{space 2} 11.36841{col 39}{space 1}   -1.92{col 48}{space 3}0.057{col 56}{space 4}-44.23294{col 69}{space 3}  .653672
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 710.4608{col 28}{space 2} 1056.562{col 39}{space 1}    0.67{col 48}{space 3}0.502{col 56}{space 4}-1375.385{col 69}{space 3} 2796.307
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1061589{col 28}{space 2} 70199.55{col 39}{space 1}   15.12{col 48}{space 3}0.000{col 56}{space 4}   923002{col 69}{space 3}  1200175
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       170
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    168.03
{txt}{col 49}        avg{col 67}= {res}    168.03
{txt}{col 49}        max{col 67}= {res}    168.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  168.0{txt}){col 67}= {res}     20.62
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 3870.013{col 28}{space 2} 9883.729{col 39}{space 1}    0.39{col 48}{space 3}0.696{col 56}{space 4}-15642.27{col 69}{space 3}  23382.3
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-15020.28{col 28}{space 2} 28869.26{col 39}{space 1}   -0.52{col 48}{space 3}0.604{col 56}{space 4}-72013.47{col 69}{space 3} 41972.91
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-16100.55{col 28}{space 2} 12631.76{col 39}{space 1}   -1.27{col 48}{space 3}0.204{col 56}{space 4}-41037.94{col 69}{space 3} 8836.845
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 72787.69{col 28}{space 2} 7339.819{col 39}{space 1}    9.92{col 48}{space 3}0.000{col 56}{space 4} 58297.54{col 69}{space 3} 87277.83
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1949.981{col 28}{space 2} 457.8184{col 39}{space 1}   -4.26{col 48}{space 3}0.000{col 56}{space 4}-2853.798{col 69}{space 3}-1046.164
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2144.962{col 28}{space 2} 8520.876{col 39}{space 1}   -0.25{col 48}{space 3}0.802{col 56}{space 4}-18966.72{col 69}{space 3}  14676.8
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-8.196717{col 28}{space 2}  6.09909{col 39}{space 1}   -1.34{col 48}{space 3}0.181{col 56}{space 4}-20.23743{col 69}{space 3} 3.843998
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 553.6187{col 28}{space 2}   566.84{col 39}{space 1}    0.98{col 48}{space 3}0.330{col 56}{space 4}-565.4268{col 69}{space 3} 1672.664
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 644494.2{col 28}{space 2} 37661.69{col 39}{space 1}   17.11{col 48}{space 3}0.000{col 56}{space 4} 570143.2{col 69}{space 3} 718845.3
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       170
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    168.03
{txt}{col 49}        avg{col 67}= {res}    168.03
{txt}{col 49}        max{col 67}= {res}    168.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  168.0{txt}){col 67}= {res}     12.01
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 8232.902{col 28}{space 2}  8990.38{col 39}{space 1}    0.92{col 48}{space 3}0.361{col 56}{space 4}-9515.746{col 69}{space 3} 25981.55
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}    18816{col 28}{space 2} 26259.89{col 39}{space 1}    0.72{col 48}{space 3}0.475{col 56}{space 4}-33025.81{col 69}{space 3} 70657.81
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-17067.08{col 28}{space 2} 11490.02{col 39}{space 1}   -1.49{col 48}{space 3}0.139{col 56}{space 4}-39750.48{col 69}{space 3} 5616.325
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 56838.24{col 28}{space 2} 6676.403{col 39}{space 1}    8.51{col 48}{space 3}0.000{col 56}{space 4}  43657.8{col 69}{space 3} 70018.68
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-646.4135{col 28}{space 2} 416.4381{col 39}{space 1}   -1.55{col 48}{space 3}0.122{col 56}{space 4}-1468.538{col 69}{space 3} 175.7112
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -4544.83{col 28}{space 2} 7750.709{col 39}{space 1}   -0.59{col 48}{space 3}0.558{col 56}{space 4}-19846.14{col 69}{space 3} 10756.48
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-11.87029{col 28}{space 2} 5.547819{col 39}{space 1}   -2.14{col 48}{space 3}0.034{col 56}{space 4} -22.8227{col 69}{space 3}-.9178865
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}  158.376{col 28}{space 2} 515.6057{col 39}{space 1}    0.31{col 48}{space 3}0.759{col 56}{space 4}-859.5235{col 69}{space 3} 1176.276
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 419363.9{col 28}{space 2} 34257.61{col 39}{space 1}   12.24{col 48}{space 3}0.000{col 56}{space 4} 351733.1{col 69}{space 3} 486994.6
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. *********************LnNFLw3, MODELS 3-6***************************
. 
. ***********MODEL 3: MODEL 2+w1dxDiabetes w1Glucose******
. 
. //AFRICAN-AMERICAN//
. 
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0095
{txt}{col 49}Largest FMI{col 67}= {res}    0.0672
{txt}{col 49}Complete DF{col 67}= {res}        65
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     55.87
{txt}{col 49}        avg{col 67}= {res}     61.73
{txt}{col 49}        max{col 67}= {res}     63.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   63.0{txt}){col 67}= {res}      6.09
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-26585.32{col 26}{space 2} 18846.38{col 37}{space 1}   -1.41{col 46}{space 3}0.163{col 54}{space 4}-64261.51{col 67}{space 3} 11090.86
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 119981.6{col 26}{space 2} 21144.48{col 37}{space 1}    5.67{col 46}{space 3}0.000{col 54}{space 4} 77724.75{col 67}{space 3} 162238.4
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1549.933{col 26}{space 2} 1369.818{col 37}{space 1}   -1.13{col 46}{space 3}0.262{col 54}{space 4}-4287.871{col 67}{space 3} 1188.005
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}  17256.6{col 26}{space 2}  24923.8{col 37}{space 1}    0.69{col 46}{space 3}0.491{col 54}{space 4}-32548.79{col 67}{space 3}    67062
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-25.34489{col 26}{space 2} 19.53524{col 37}{space 1}   -1.30{col 46}{space 3}0.199{col 54}{space 4}-64.38217{col 67}{space 3} 13.69239
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 598.7203{col 26}{space 2} 1669.696{col 37}{space 1}    0.36{col 46}{space 3}0.721{col 54}{space 4}-2737.916{col 67}{space 3} 3935.356
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-37221.69{col 26}{space 2} 20162.46{col 37}{space 1}   -1.85{col 46}{space 3}0.070{col 54}{space 4}-77614.03{col 67}{space 3} 3170.643
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 972.4667{col 26}{space 2} 587.1417{col 37}{space 1}    1.66{col 46}{space 3}0.103{col 54}{space 4}-201.4542{col 67}{space 3} 2146.388
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 987451.6{col 26}{space 2} 98395.58{col 37}{space 1}   10.04{col 46}{space 3}0.000{col 54}{space 4} 790783.4{col 67}{space 3}  1184120
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0057
{txt}{col 49}Largest FMI{col 67}= {res}    0.0246
{txt}{col 49}Complete DF{col 67}= {res}        65
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     61.15
{txt}{col 49}        avg{col 67}= {res}     62.51
{txt}{col 49}        max{col 67}= {res}     63.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   63.1{txt}){col 67}= {res}      6.76
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-16393.42{col 26}{space 2}  10558.1{col 37}{space 1}   -1.55{col 46}{space 3}0.126{col 54}{space 4} -37496.4{col 67}{space 3} 4709.568
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 61327.33{col 26}{space 2} 11905.16{col 37}{space 1}    5.15{col 46}{space 3}0.000{col 54}{space 4} 37533.16{col 67}{space 3}  85121.5
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1588.734{col 26}{space 2} 768.4561{col 37}{space 1}   -2.07{col 46}{space 3}0.043{col 54}{space 4}-3124.547{col 67}{space 3}-52.92066
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 9128.168{col 26}{space 2} 14011.73{col 37}{space 1}    0.65{col 46}{space 3}0.517{col 54}{space 4} -18871.8{col 67}{space 3} 37128.14
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-13.54728{col 26}{space 2} 10.98082{col 37}{space 1}   -1.23{col 46}{space 3}0.222{col 54}{space 4}-35.49032{col 67}{space 3} 8.395763
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 440.5349{col 26}{space 2} 938.9649{col 37}{space 1}    0.47{col 46}{space 3}0.641{col 54}{space 4}-1435.885{col 67}{space 3} 2316.955
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-26667.93{col 26}{space 2}    11097{col 37}{space 1}   -2.40{col 46}{space 3}0.019{col 54}{space 4}-48856.63{col 67}{space 3}-4479.225
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 618.2421{col 26}{space 2} 328.2655{col 37}{space 1}    1.88{col 46}{space 3}0.064{col 54}{space 4} -37.8854{col 67}{space 3}  1274.37
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 587455.7{col 26}{space 2} 55219.85{col 37}{space 1}   10.64{col 46}{space 3}0.000{col 54}{space 4} 477093.3{col 67}{space 3}   697818
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0159
{txt}{col 49}Largest FMI{col 67}= {res}    0.1280
{txt}{col 49}Complete DF{col 67}= {res}        65
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     46.59
{txt}{col 49}        avg{col 67}= {res}     60.34
{txt}{col 49}        max{col 67}= {res}     63.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   63.0{txt}){col 67}= {res}      4.13
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0005

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-11337.08{col 26}{space 2}  8815.93{col 37}{space 1}   -1.29{col 46}{space 3}0.203{col 54}{space 4}-28962.82{col 67}{space 3} 6288.654
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 48161.49{col 26}{space 2} 9862.215{col 37}{space 1}    4.88{col 46}{space 3}0.000{col 54}{space 4} 28453.25{col 67}{space 3} 67869.73
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-382.5191{col 26}{space 2}  640.864{col 37}{space 1}   -0.60{col 46}{space 3}0.553{col 54}{space 4}-1663.566{col 67}{space 3} 898.5283
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1575.422{col 26}{space 2}  11639.3{col 37}{space 1}    0.14{col 46}{space 3}0.893{col 54}{space 4}-21683.31{col 67}{space 3} 24834.15
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.903146{col 26}{space 2} 9.124657{col 37}{space 1}   -0.98{col 46}{space 3}0.333{col 54}{space 4}-27.13697{col 67}{space 3} 9.330675
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-31.15664{col 26}{space 2} 779.5075{col 37}{space 1}   -0.04{col 46}{space 3}0.968{col 54}{space 4}-1588.855{col 67}{space 3} 1526.542
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-11438.81{col 26}{space 2} 9708.269{col 37}{space 1}   -1.18{col 46}{space 3}0.245{col 54}{space 4}-30973.84{col 67}{space 3} 8096.224
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 348.7727{col 26}{space 2} 277.3206{col 37}{space 1}    1.26{col 46}{space 3}0.213{col 54}{space 4}-206.1816{col 67}{space 3} 903.7269
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 405287.4{col 26}{space 2} 46063.34{col 37}{space 1}    8.80{col 46}{space 3}0.000{col 54}{space 4} 313206.8{col 67}{space 3}   497368
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        96
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     94.06
{txt}{col 49}        avg{col 67}= {res}     94.06
{txt}{col 49}        max{col 67}= {res}     94.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   94.1{txt}){col 67}= {res}     10.02
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 15832.77{col 26}{space 2} 20980.02{col 37}{space 1}    0.75{col 46}{space 3}0.452{col 54}{space 4}-25823.21{col 67}{space 3} 57488.74
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 147189.2{col 26}{space 2} 18659.77{col 37}{space 1}    7.89{col 46}{space 3}0.000{col 54}{space 4} 110140.1{col 67}{space 3} 184238.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2138.249{col 26}{space 2} 1202.583{col 37}{space 1}   -1.78{col 46}{space 3}0.079{col 54}{space 4}-4525.986{col 67}{space 3} 249.4872
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-20475.56{col 26}{space 2} 21481.94{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 54}{space 4} -63128.1{col 67}{space 3} 22176.98
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-20.04601{col 26}{space 2} 14.66541{col 37}{space 1}   -1.37{col 46}{space 3}0.175{col 54}{space 4}-49.16429{col 67}{space 3} 9.072266
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 428.6407{col 26}{space 2} 1477.487{col 37}{space 1}    0.29{col 46}{space 3}0.772{col 54}{space 4}-2504.919{col 67}{space 3}   3362.2
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 24851.81{col 26}{space 2} 19636.95{col 37}{space 1}    1.27{col 46}{space 3}0.209{col 54}{space 4}-14137.48{col 67}{space 3} 63841.09
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-454.7993{col 26}{space 2} 421.7988{col 37}{space 1}   -1.08{col 46}{space 3}0.284{col 54}{space 4}-1292.284{col 67}{space 3}  382.685
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1114169{col 26}{space 2} 98113.28{col 37}{space 1}   11.36{col 46}{space 3}0.000{col 54}{space 4} 919364.1{col 67}{space 3}  1308973
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        96
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     94.06
{txt}{col 49}        avg{col 67}= {res}     94.06
{txt}{col 49}        max{col 67}= {res}     94.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   94.1{txt}){col 67}= {res}     10.71
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 667.1272{col 26}{space 2} 10779.56{col 37}{space 1}    0.06{col 46}{space 3}0.951{col 54}{space 4}-20735.76{col 67}{space 3} 22070.02
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 77519.11{col 26}{space 2} 9587.412{col 37}{space 1}    8.09{col 46}{space 3}0.000{col 54}{space 4} 58483.24{col 67}{space 3} 96554.98
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1752.631{col 26}{space 2} 617.8886{col 37}{space 1}   -2.84{col 46}{space 3}0.006{col 54}{space 4}-2979.453{col 67}{space 3}-525.8087
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-12381.06{col 26}{space 2} 11037.45{col 37}{space 1}   -1.12{col 46}{space 3}0.265{col 54}{space 4}-34295.98{col 67}{space 3} 9533.869
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-5.331794{col 26}{space 2} 7.535107{col 37}{space 1}   -0.71{col 46}{space 3}0.481{col 54}{space 4} -20.2928{col 67}{space 3} 9.629212
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  486.972{col 26}{space 2} 759.1344{col 37}{space 1}    0.64{col 46}{space 3}0.523{col 54}{space 4}-1020.294{col 67}{space 3} 1994.238
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 10494.97{col 26}{space 2} 10089.49{col 37}{space 1}    1.04{col 46}{space 3}0.301{col 54}{space 4}-9537.773{col 67}{space 3} 30527.71
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-148.8863{col 26}{space 2} 216.7207{col 37}{space 1}   -0.69{col 46}{space 3}0.494{col 54}{space 4}-579.1868{col 67}{space 3} 281.4141
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 655789.2{col 26}{space 2} 50410.72{col 37}{space 1}   13.01{col 46}{space 3}0.000{col 54}{space 4} 555698.4{col 67}{space 3} 755880.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        96
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     94.06
{txt}{col 49}        avg{col 67}= {res}     94.06
{txt}{col 49}        max{col 67}= {res}     94.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   94.1{txt}){col 67}= {res}      7.09
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}  8928.32{col 26}{space 2} 10656.65{col 37}{space 1}    0.84{col 46}{space 3}0.404{col 54}{space 4}-12230.53{col 67}{space 3} 30087.17
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 60930.51{col 26}{space 2} 9478.096{col 37}{space 1}    6.43{col 46}{space 3}0.000{col 54}{space 4} 42111.69{col 67}{space 3} 79749.34
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-705.8275{col 26}{space 2} 610.8434{col 37}{space 1}   -1.16{col 46}{space 3}0.251{col 54}{space 4}-1918.661{col 67}{space 3} 507.0063
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-10833.35{col 26}{space 2}  10911.6{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4}-32498.41{col 67}{space 3}  10831.7
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -13.4519{col 26}{space 2} 7.449192{col 37}{space 1}   -1.81{col 46}{space 3}0.074{col 54}{space 4}-28.24232{col 67}{space 3} 1.338521
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  94.0426{col 26}{space 2} 750.4787{col 37}{space 1}    0.13{col 46}{space 3}0.901{col 54}{space 4}-1396.038{col 67}{space 3} 1584.123
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 9677.503{col 26}{space 2} 9974.446{col 37}{space 1}    0.97{col 46}{space 3}0.334{col 54}{space 4}-10126.83{col 67}{space 3} 29481.83
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-188.9037{col 26}{space 2} 214.2497{col 37}{space 1}   -0.88{col 46}{space 3}0.380{col 54}{space 4}-614.2979{col 67}{space 3} 236.4904
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 442901.5{col 26}{space 2} 49835.94{col 37}{space 1}    8.89{col 46}{space 3}0.000{col 54}{space 4} 343951.9{col 67}{space 3} 541851.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. //INTERACTION BY Race//
. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0059
{txt}{col 49}Largest FMI{col 67}= {res}    0.0635
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    136.18
{txt}{col 49}        avg{col 67}= {res}    162.32
{txt}{col 49}        max{col 67}= {res}    166.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  166.0{txt}){col 67}= {res}     14.37
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 16341.01{col 28}{space 2} 19411.83{col 39}{space 1}    0.84{col 48}{space 3}0.401{col 56}{space 4}-21984.97{col 69}{space 3} 54666.99
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 10892.88{col 28}{space 2} 55286.46{col 39}{space 1}    0.20{col 48}{space 3}0.844{col 56}{space 4}-98262.67{col 69}{space 3} 120048.4
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-37188.26{col 28}{space 2} 24302.22{col 39}{space 1}   -1.53{col 48}{space 3}0.128{col 56}{space 4} -85169.6{col 69}{space 3} 10793.08
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 139554.3{col 28}{space 2} 13975.67{col 39}{space 1}    9.99{col 48}{space 3}0.000{col 56}{space 4} 111961.2{col 69}{space 3} 167147.3
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2154.598{col 28}{space 2}  876.272{col 39}{space 1}   -2.46{col 48}{space 3}0.015{col 56}{space 4}-3884.712{col 69}{space 3}-424.4837
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2338.409{col 28}{space 2} 16012.19{col 39}{space 1}   -0.15{col 48}{space 3}0.884{col 56}{space 4}-33952.16{col 69}{space 3} 29275.34
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} -22.0461{col 28}{space 2} 11.56187{col 39}{space 1}   -1.91{col 48}{space 3}0.058{col 56}{space 4}-44.87344{col 69}{space 3} .7812406
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 725.6044{col 28}{space 2} 1089.761{col 39}{space 1}    0.67{col 48}{space 3}0.506{col 56}{space 4}-1425.984{col 69}{space 3} 2877.192
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-3704.579{col 28}{space 2} 14226.44{col 39}{space 1}   -0.26{col 48}{space 3}0.795{col 56}{space 4}-31837.89{col 69}{space 3} 24428.73
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 72.26765{col 28}{space 2} 339.7894{col 39}{space 1}    0.21{col 48}{space 3}0.832{col 56}{space 4}-598.8558{col 69}{space 3} 743.3911
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1054782{col 28}{space 2} 74955.29{col 39}{space 1}   14.07{col 48}{space 3}0.000{col 56}{space 4}   906783{col 69}{space 3}  1202781
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0025
{txt}{col 49}Largest FMI{col 67}= {res}    0.0268
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    157.42
{txt}{col 49}        avg{col 67}= {res}    164.89
{txt}{col 49}        max{col 67}= {res}    166.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  166.0{txt}){col 67}= {res}     16.45
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 2274.544{col 28}{space 2} 10387.39{col 39}{space 1}    0.22{col 48}{space 3}0.827{col 56}{space 4}-18233.89{col 69}{space 3} 22782.98
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-14663.21{col 28}{space 2} 29588.26{col 39}{space 1}   -0.50{col 48}{space 3}0.621{col 56}{space 4}-73081.22{col 69}{space 3}  43754.8
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-16004.58{col 28}{space 2} 13006.04{col 39}{space 1}   -1.23{col 48}{space 3}0.220{col 56}{space 4} -41683.2{col 69}{space 3} 9674.048
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 73067.35{col 28}{space 2} 7479.198{col 39}{space 1}    9.77{col 48}{space 3}0.000{col 56}{space 4} 58300.68{col 69}{space 3} 87834.02
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1864.343{col 28}{space 2} 468.6753{col 39}{space 1}   -3.98{col 48}{space 3}0.000{col 56}{space 4}-2789.687{col 69}{space 3}-938.9985
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2090.244{col 28}{space 2} 8569.129{col 39}{space 1}   -0.24{col 48}{space 3}0.808{col 56}{space 4}-19008.75{col 69}{space 3} 14828.26
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-8.628854{col 28}{space 2} 6.186118{col 39}{space 1}   -1.39{col 48}{space 3}0.165{col 56}{space 4}-20.84246{col 69}{space 3} 3.584754
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 570.5082{col 28}{space 2} 583.1549{col 39}{space 1}    0.98{col 48}{space 3}0.329{col 56}{space 4} -580.852{col 69}{space 3} 1721.868
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} -6848.79{col 28}{space 2} 7475.579{col 39}{space 1}   -0.92{col 48}{space 3}0.361{col 56}{space 4}-21614.17{col 69}{space 3} 7916.589
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2}  144.287{col 28}{space 2} 180.4558{col 39}{space 1}    0.80{col 48}{space 3}0.425{col 56}{space 4}-212.0352{col 69}{space 3} 500.6092
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 631861.5{col 28}{space 2} 40042.91{col 39}{space 1}   15.78{col 48}{space 3}0.000{col 56}{space 4}   552800{col 69}{space 3} 710923.1
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0083
{txt}{col 49}Largest FMI{col 67}= {res}    0.0879
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    120.14
{txt}{col 49}        avg{col 67}= {res}    160.29
{txt}{col 49}        max{col 67}= {res}    166.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  165.9{txt}){col 67}= {res}      9.42
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 8054.658{col 28}{space 2} 9475.136{col 39}{space 1}    0.85{col 48}{space 3}0.397{col 56}{space 4}-10652.71{col 69}{space 3} 26762.02
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 18373.77{col 28}{space 2} 26983.37{col 39}{space 1}    0.68{col 48}{space 3}0.497{col 56}{space 4}-34901.18{col 69}{space 3} 71648.71
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-16852.08{col 28}{space 2} 11861.09{col 39}{space 1}   -1.42{col 48}{space 3}0.157{col 56}{space 4}-40270.15{col 69}{space 3} 6565.985
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}  56741.2{col 28}{space 2} 6821.175{col 39}{space 1}    8.32{col 48}{space 3}0.000{col 56}{space 4} 43273.71{col 69}{space 3}  70208.7
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-650.4884{col 28}{space 2} 427.8522{col 39}{space 1}   -1.52{col 48}{space 3}0.130{col 56}{space 4}-1495.247{col 69}{space 3} 194.2704
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4606.779{col 28}{space 2} 7815.306{col 39}{space 1}   -0.59{col 48}{space 3}0.556{col 56}{space 4}-20036.97{col 69}{space 3} 10823.41
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-11.78751{col 28}{space 2} 5.643959{col 39}{space 1}   -2.09{col 48}{space 3}0.038{col 56}{space 4}-22.93076{col 69}{space 3}-.6442469
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 147.8949{col 28}{space 2}  531.912{col 39}{space 1}    0.28{col 48}{space 3}0.781{col 56}{space 4}-902.2952{col 69}{space 3} 1198.085
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} 388.3912{col 28}{space 2} 7029.096{col 39}{space 1}    0.06{col 48}{space 3}0.956{col 56}{space 4}-13528.57{col 69}{space 3} 14305.35
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 3.964884{col 28}{space 2} 166.7349{col 39}{space 1}    0.02{col 48}{space 3}0.981{col 56}{space 4}-325.4462{col 69}{space 3}  333.376
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 419775.5{col 28}{space 2} 36626.08{col 39}{space 1}   11.46{col 48}{space 3}0.000{col 56}{space 4} 347455.4{col 69}{space 3} 492095.6
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 4: MODEL 2+liver/kidney disease******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0894
{txt}{col 49}Largest FMI{col 67}= {res}    0.5635
{txt}{col 49}Complete DF{col 67}= {res}        62
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     10.36
{txt}{col 49}        avg{col 67}= {res}     52.13
{txt}{col 49}        max{col 67}= {res}     59.61
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   58.8{txt}){col 67}= {res}      4.07
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0002

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-19516.82{col 26}{space 2} 19497.13{col 37}{space 1}   -1.00{col 46}{space 3}0.321{col 54}{space 4}-58523.65{col 67}{space 3} 19490.02
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 156359.1{col 26}{space 2} 29438.26{col 37}{space 1}    5.31{col 46}{space 3}0.000{col 54}{space 4} 96541.01{col 67}{space 3} 216177.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1886.387{col 26}{space 2} 1529.324{col 37}{space 1}   -1.23{col 46}{space 3}0.222{col 54}{space 4}-4947.216{col 67}{space 3} 1174.443
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 20425.68{col 26}{space 2} 25697.57{col 37}{space 1}    0.79{col 46}{space 3}0.430{col 54}{space 4}-30984.09{col 67}{space 3} 71835.44
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -25.7146{col 26}{space 2} 20.24063{col 37}{space 1}   -1.27{col 46}{space 3}0.209{col 54}{space 4}-66.20893{col 67}{space 3} 14.77973
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  2692.32{col 26}{space 2} 1926.207{col 37}{space 1}    1.40{col 46}{space 3}0.168{col 54}{space 4}-1164.967{col 67}{space 3} 6549.607
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-50220.61{col 26}{space 2} 69814.64{col 37}{space 1}   -0.72{col 46}{space 3}0.488{col 54}{space 4}-205056.5{col 67}{space 3} 104615.3
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} -1036826{col 26}{space 2}  1693725{col 37}{space 1}   -0.61{col 46}{space 3}0.543{col 54}{space 4} -4425580{col 67}{space 3}  2351928
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-835.7732{col 26}{space 2} 3643.409{col 37}{space 1}   -0.23{col 46}{space 3}0.819{col 54}{space 4}-8149.491{col 67}{space 3} 6477.944
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 605.2099{col 26}{space 2}  556.335{col 37}{space 1}    1.09{col 46}{space 3}0.281{col 54}{space 4}-508.0497{col 67}{space 3} 1718.469
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-10132.44{col 26}{space 2} 9397.379{col 37}{space 1}   -1.08{col 46}{space 3}0.285{col 54}{space 4}-28940.74{col 67}{space 3} 8675.854
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  2075184{col 26}{space 2}  1717167{col 37}{space 1}    1.21{col 46}{space 3}0.232{col 54}{space 4} -1360471{col 67}{space 3}  5510839
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0773
{txt}{col 49}Largest FMI{col 67}= {res}    0.5327
{txt}{col 49}Complete DF{col 67}= {res}        62
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     11.39
{txt}{col 49}        avg{col 67}= {res}     53.19
{txt}{col 49}        max{col 67}= {res}     59.94
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   59.1{txt}){col 67}= {res}      3.89
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0003

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-12797.14{col 26}{space 2}  11316.4{col 37}{space 1}   -1.13{col 46}{space 3}0.263{col 54}{space 4}-35434.05{col 67}{space 3} 9839.775
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 75205.88{col 26}{space 2} 16688.68{col 37}{space 1}    4.51{col 46}{space 3}0.000{col 54}{space 4} 41495.03{col 67}{space 3} 108916.7
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2071.537{col 26}{space 2} 890.7418{col 37}{space 1}   -2.33{col 46}{space 3}0.024{col 54}{space 4}-3854.381{col 67}{space 3}-288.6931
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 11526.76{col 26}{space 2} 15003.14{col 37}{space 1}    0.77{col 46}{space 3}0.445{col 54}{space 4}-18493.11{col 67}{space 3} 41546.63
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -13.5198{col 26}{space 2} 11.78487{col 37}{space 1}   -1.15{col 46}{space 3}0.256{col 54}{space 4}-37.09758{col 67}{space 3} 10.05799
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  1236.91{col 26}{space 2} 1113.298{col 37}{space 1}    1.11{col 46}{space 3}0.271{col 54}{space 4}-991.2746{col 67}{space 3} 3465.094
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-5713.833{col 26}{space 2} 39447.64{col 37}{space 1}   -0.14{col 46}{space 3}0.887{col 54}{space 4}-92176.46{col 67}{space 3}  80748.8
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-921156.8{col 26}{space 2} 981630.4{col 37}{space 1}   -0.94{col 46}{space 3}0.352{col 54}{space 4} -2884747{col 67}{space 3}  1042434
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 813.7424{col 26}{space 2} 2099.411{col 37}{space 1}    0.39{col 46}{space 3}0.700{col 54}{space 4}-3395.306{col 67}{space 3} 5022.791
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 298.6926{col 26}{space 2} 322.9703{col 37}{space 1}    0.92{col 46}{space 3}0.359{col 54}{space 4}-347.4876{col 67}{space 3} 944.8728
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-4889.607{col 26}{space 2} 5484.374{col 37}{space 1}   -0.89{col 46}{space 3}0.376{col 54}{space 4}-15868.43{col 67}{space 3}  6089.22
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1544674{col 26}{space 2} 995297.8{col 37}{space 1}    1.55{col 46}{space 3}0.126{col 54}{space 4}-446260.5{col 67}{space 3}  3535609
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.1007
{txt}{col 49}Largest FMI{col 67}= {res}    0.5751
{txt}{col 49}Complete DF{col 67}= {res}        62
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      9.99
{txt}{col 49}        avg{col 67}= {res}     51.13
{txt}{col 49}        max{col 67}= {res}     59.60
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   58.6{txt}){col 67}= {res}      3.26
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0016

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} -8802.66{col 26}{space 2} 8867.524{col 37}{space 1}   -0.99{col 46}{space 3}0.325{col 54}{space 4}-26547.82{col 67}{space 3} 8942.501
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 67024.07{col 26}{space 2} 13479.57{col 37}{space 1}    4.97{col 46}{space 3}0.000{col 54}{space 4} 39557.74{col 67}{space 3} 94490.39
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-418.9825{col 26}{space 2} 696.4742{col 37}{space 1}   -0.60{col 46}{space 3}0.550{col 54}{space 4}-1813.509{col 67}{space 3} 975.5438
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 2380.791{col 26}{space 2} 11639.09{col 37}{space 1}    0.20{col 46}{space 3}0.839{col 54}{space 4}-20904.06{col 67}{space 3} 25665.64
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-9.128113{col 26}{space 2} 9.212646{col 37}{space 1}   -0.99{col 46}{space 3}0.326{col 54}{space 4}-27.56469{col 67}{space 3} 9.308463
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1013.633{col 26}{space 2} 882.3007{col 37}{space 1}    1.15{col 46}{space 3}0.256{col 54}{space 4}-755.1977{col 67}{space 3} 2782.465
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-35785.23{col 26}{space 2}  32006.4{col 37}{space 1}   -1.12{col 46}{space 3}0.290{col 54}{space 4}-107106.1{col 67}{space 3} 35535.64
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-253271.6{col 26}{space 2}   772025{col 37}{space 1}   -0.33{col 46}{space 3}0.744{col 54}{space 4} -1798547{col 67}{space 3}  1292004
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-663.5921{col 26}{space 2} 1655.408{col 37}{space 1}   -0.40{col 46}{space 3}0.690{col 54}{space 4}-3988.132{col 67}{space 3} 2660.948
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 278.2259{col 26}{space 2}  253.183{col 37}{space 1}    1.10{col 46}{space 3}0.276{col 54}{space 4}-228.5792{col 67}{space 3} 785.0311
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} -4322.24{col 26}{space 2} 4249.467{col 37}{space 1}   -1.02{col 46}{space 3}0.313{col 54}{space 4}-12826.39{col 67}{space 3} 4181.914
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 674872.2{col 26}{space 2}   782449{col 37}{space 1}    0.86{col 46}{space 3}0.392{col 54}{space 4}-891231.4{col 67}{space 3}  2240976
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0224
{txt}{col 49}Largest FMI{col 67}= {res}    0.2148
{txt}{col 49}Complete DF{col 67}= {res}        93
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     42.94
{txt}{col 49}        avg{col 67}= {res}     85.36
{txt}{col 49}        max{col 67}= {res}     90.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   90.8{txt}){col 67}= {res}      8.47
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 15110.08{col 26}{space 2} 20373.07{col 37}{space 1}    0.74{col 46}{space 3}0.460{col 54}{space 4}-25361.13{col 67}{space 3} 55581.29
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 175438.8{col 26}{space 2} 23793.89{col 37}{space 1}    7.37{col 46}{space 3}0.000{col 54}{space 4} 128118.9{col 67}{space 3} 222758.7
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1748.407{col 26}{space 2} 1178.218{col 37}{space 1}   -1.48{col 46}{space 3}0.141{col 54}{space 4}-4088.876{col 67}{space 3} 592.0626
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-15632.89{col 26}{space 2} 20912.62{col 37}{space 1}   -0.75{col 46}{space 3}0.457{col 54}{space 4}-57173.36{col 67}{space 3} 25907.59
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}   -27.53{col 26}{space 2}  14.3251{col 37}{space 1}   -1.92{col 46}{space 3}0.058{col 54}{space 4}-55.98696{col 67}{space 3} .9269545
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  2383.78{col 26}{space 2} 1521.075{col 37}{space 1}    1.57{col 46}{space 3}0.121{col 54}{space 4}-637.7416{col 67}{space 3} 5405.301
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 28004.87{col 26}{space 2} 61180.97{col 37}{space 1}    0.46{col 46}{space 3}0.649{col 54}{space 4}-95382.99{col 67}{space 3} 151392.7
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}  1215414{col 26}{space 2}  1676652{col 37}{space 1}    0.72{col 46}{space 3}0.470{col 54}{space 4} -2115985{col 67}{space 3}  4546814
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-317.2223{col 26}{space 2} 2602.231{col 37}{space 1}   -0.12{col 46}{space 3}0.903{col 54}{space 4}-5491.851{col 67}{space 3} 4857.406
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 185.0451{col 26}{space 2}  434.897{col 37}{space 1}    0.43{col 46}{space 3}0.671{col 54}{space 4}-678.8335{col 67}{space 3} 1048.924
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-23504.11{col 26}{space 2} 7474.562{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-38351.95{col 67}{space 3}-8656.277
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-174001.4{col 26}{space 2}  1684702{col 37}{space 1}   -0.10{col 46}{space 3}0.918{col 54}{space 4} -3521448{col 67}{space 3}  3173445
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0323
{txt}{col 49}Largest FMI{col 67}= {res}    0.2867
{txt}{col 49}Complete DF{col 67}= {res}        93
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     31.69
{txt}{col 49}        avg{col 67}= {res}     84.32
{txt}{col 49}        max{col 67}= {res}     91.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   90.6{txt}){col 67}= {res}      8.46
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-300.9222{col 26}{space 2} 10624.89{col 37}{space 1}   -0.03{col 46}{space 3}0.977{col 54}{space 4}-21408.64{col 67}{space 3} 20806.79
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 89685.78{col 26}{space 2} 12429.73{col 37}{space 1}    7.22{col 46}{space 3}0.000{col 54}{space 4} 64959.12{col 67}{space 3} 114412.4
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1656.993{col 26}{space 2} 613.8338{col 37}{space 1}   -2.70{col 46}{space 3}0.008{col 54}{space 4}-2876.372{col 67}{space 3}-437.6147
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-9870.089{col 26}{space 2} 10883.66{col 37}{space 1}   -0.91{col 46}{space 3}0.367{col 54}{space 4}-31489.03{col 67}{space 3} 11748.86
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.663213{col 26}{space 2} 7.462767{col 37}{space 1}   -1.16{col 46}{space 3}0.249{col 54}{space 4}-23.48843{col 67}{space 3} 6.162003
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1369.289{col 26}{space 2} 793.0461{col 37}{space 1}    1.73{col 46}{space 3}0.088{col 54}{space 4}-206.1238{col 67}{space 3} 2944.702
{txt}w1Creatinine {c |}{col 14}{res}{space 2}  18610.1{col 26}{space 2} 33164.07{col 37}{space 1}    0.56{col 46}{space 3}0.579{col 54}{space 4}-48969.07{col 67}{space 3} 86189.27
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 303328.1{col 26}{space 2} 868871.3{col 37}{space 1}    0.35{col 46}{space 3}0.728{col 54}{space 4} -1422741{col 67}{space 3}  2029397
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 177.9935{col 26}{space 2}  1356.07{col 37}{space 1}    0.13{col 46}{space 3}0.896{col 54}{space 4}-2518.814{col 67}{space 3} 2874.801
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 209.9214{col 26}{space 2} 226.6491{col 37}{space 1}    0.93{col 46}{space 3}0.357{col 54}{space 4}-240.3083{col 67}{space 3} 660.1512
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-10262.13{col 26}{space 2} 3897.447{col 37}{space 1}   -2.63{col 46}{space 3}0.010{col 54}{space 4}-18004.62{col 67}{space 3}-2519.641
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 314065.5{col 26}{space 2}   873024{col 37}{space 1}    0.36{col 46}{space 3}0.720{col 54}{space 4} -1420272{col 67}{space 3}  2048403
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0062
{txt}{col 49}Largest FMI{col 67}= {res}    0.0608
{txt}{col 49}Complete DF{col 67}= {res}        93
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     80.10
{txt}{col 49}        avg{col 67}= {res}     89.92
{txt}{col 49}        max{col 67}= {res}     91.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   91.0{txt}){col 67}= {res}      6.38
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 9793.169{col 26}{space 2} 10320.99{col 37}{space 1}    0.95{col 46}{space 3}0.345{col 54}{space 4}-10708.41{col 67}{space 3} 30294.75
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 75228.19{col 26}{space 2} 11860.04{col 37}{space 1}    6.34{col 46}{space 3}0.000{col 54}{space 4} 51666.65{col 67}{space 3} 98789.73
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-499.7932{col 26}{space 2}  597.548{col 37}{space 1}   -0.84{col 46}{space 3}0.405{col 54}{space 4}-1686.766{col 67}{space 3} 687.1793
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-8746.513{col 26}{space 2} 10610.29{col 37}{space 1}   -0.82{col 46}{space 3}0.412{col 54}{space 4} -29822.4{col 67}{space 3} 12329.37
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}   -16.71{col 26}{space 2} 7.254497{col 37}{space 1}   -2.30{col 46}{space 3}0.024{col 54}{space 4}-31.12017{col 67}{space 3}-2.299835
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1032.786{col 26}{space 2} 771.4061{col 37}{space 1}    1.34{col 46}{space 3}0.184{col 54}{space 4}-499.5298{col 67}{space 3} 2565.101
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 7602.516{col 26}{space 2} 28680.22{col 37}{space 1}    0.27{col 46}{space 3}0.792{col 54}{space 4}-49471.88{col 67}{space 3} 64676.91
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 680390.4{col 26}{space 2} 845431.6{col 37}{space 1}    0.80{col 46}{space 3}0.423{col 54}{space 4}  -999009{col 67}{space 3}  2359790
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-391.6137{col 26}{space 2} 1297.196{col 37}{space 1}   -0.30{col 46}{space 3}0.763{col 54}{space 4}-2968.542{col 67}{space 3} 2185.314
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 42.33248{col 26}{space 2} 220.6134{col 37}{space 1}    0.19{col 46}{space 3}0.848{col 54}{space 4}-395.8881{col 67}{space 3} 480.5531
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-11361.64{col 26}{space 2} 3789.617{col 37}{space 1}   -3.00{col 46}{space 3}0.004{col 54}{space 4}-18889.29{col 67}{space 3}-3833.999
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-264650.8{col 26}{space 2} 849212.8{col 37}{space 1}   -0.31{col 46}{space 3}0.756{col 54}{space 4} -1951562{col 67}{space 3}  1422260
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. **INTERACTION BY Race**
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0236
{txt}{col 49}Largest FMI{col 67}= {res}    0.2615
{txt}{col 49}Complete DF{col 67}= {res}       165
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     44.89
{txt}{col 49}        avg{col 67}= {res}    152.20
{txt}{col 49}        max{col 67}= {res}    162.97
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  162.6{txt}){col 67}= {res}     12.44
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 19468.32{col 28}{space 2} 18682.91{col 39}{space 1}    1.04{col 48}{space 3}0.299{col 56}{space 4}-17424.09{col 69}{space 3} 56360.73
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 16017.46{col 28}{space 2} 53655.64{col 39}{space 1}    0.30{col 48}{space 3}0.766{col 56}{space 4}-89939.01{col 69}{space 3} 121973.9
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} -37647.4{col 28}{space 2} 23325.32{col 39}{space 1}   -1.61{col 48}{space 3}0.108{col 56}{space 4}-83707.38{col 69}{space 3}  8412.58
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 169010.6{col 28}{space 2} 17396.69{col 39}{space 1}    9.72{col 48}{space 3}0.000{col 56}{space 4}   134622{col 69}{space 3} 203399.1
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1726.834{col 28}{space 2} 873.7535{col 39}{space 1}   -1.98{col 48}{space 3}0.050{col 56}{space 4}-3452.191{col 69}{space 3} -1.47618
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-270.1439{col 28}{space 2} 15651.29{col 39}{space 1}   -0.02{col 48}{space 3}0.986{col 56}{space 4}-31175.62{col 69}{space 3} 30635.34
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-22.20473{col 28}{space 2}  11.2107{col 39}{space 1}   -1.98{col 48}{space 3}0.049{col 56}{space 4}-44.34211{col 69}{space 3}-.0673522
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2337.446{col 28}{space 2}  1151.79{col 39}{space 1}    2.03{col 48}{space 3}0.044{col 56}{space 4} 63.05176{col 69}{space 3}  4611.84
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-21533.13{col 28}{space 2} 39650.71{col 39}{space 1}   -0.54{col 48}{space 3}0.590{col 56}{space 4}-101399.4{col 69}{space 3} 58333.11
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-42707.38{col 28}{space 2}  1144089{col 39}{space 1}   -0.04{col 48}{space 3}0.970{col 56}{space 4} -2301878{col 69}{space 3}  2216463
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 1.849314{col 28}{space 2} 2009.316{col 39}{space 1}    0.00{col 48}{space 3}0.999{col 56}{space 4}-3967.358{col 69}{space 3} 3971.056
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 306.1121{col 28}{space 2} 330.3973{col 39}{space 1}    0.93{col 48}{space 3}0.356{col 56}{space 4}-346.2995{col 69}{space 3} 958.5237
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-17750.62{col 28}{space 2} 5667.916{col 39}{space 1}   -3.13{col 48}{space 3}0.002{col 56}{space 4}-28942.98{col 69}{space 3}-6558.265
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1076477{col 28}{space 2}  1151571{col 39}{space 1}    0.93{col 48}{space 3}0.351{col 56}{space 4} -1197468{col 69}{space 3}  3350422
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0204
{txt}{col 49}Largest FMI{col 67}= {res}    0.2375
{txt}{col 49}Complete DF{col 67}= {res}       165
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     50.86
{txt}{col 49}        avg{col 67}= {res}    152.84
{txt}{col 49}        max{col 67}= {res}    162.96
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  162.7{txt}){col 67}= {res}     13.31
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 2514.159{col 28}{space 2} 10168.68{col 39}{space 1}    0.25{col 48}{space 3}0.805{col 56}{space 4}-17566.21{col 69}{space 3} 22594.53
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-12984.86{col 28}{space 2} 29150.32{col 39}{space 1}   -0.45{col 48}{space 3}0.657{col 56}{space 4}-70549.22{col 69}{space 3}  44579.5
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-15804.68{col 28}{space 2} 12675.87{col 39}{space 1}   -1.25{col 48}{space 3}0.214{col 56}{space 4}-40835.49{col 69}{space 3} 9226.131
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}  84760.1{col 28}{space 2} 9439.366{col 39}{space 1}    8.98{col 48}{space 3}0.000{col 56}{space 4} 66102.91{col 69}{space 3} 103417.3
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1824.858{col 28}{space 2} 474.6439{col 39}{space 1}   -3.84{col 48}{space 3}0.000{col 56}{space 4} -2762.11{col 69}{space 3}-887.6071
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-580.3684{col 28}{space 2} 8504.616{col 39}{space 1}   -0.07{col 48}{space 3}0.946{col 56}{space 4}-17373.83{col 69}{space 3} 16213.09
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-8.575885{col 28}{space 2} 6.094063{col 39}{space 1}   -1.41{col 48}{space 3}0.161{col 56}{space 4}-20.60971{col 69}{space 3} 3.457943
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1231.319{col 28}{space 2} 625.9033{col 39}{space 1}    1.97{col 48}{space 3}0.051{col 56}{space 4}-4.629322{col 69}{space 3} 2467.266
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}  1097.65{col 28}{space 2} 21250.83{col 39}{space 1}    0.05{col 48}{space 3}0.959{col 56}{space 4}-41568.11{col 69}{space 3} 43763.41
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-302347.7{col 28}{space 2} 622504.9{col 39}{space 1}   -0.49{col 48}{space 3}0.628{col 56}{space 4} -1531604{col 69}{space 3} 926908.7
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 591.5766{col 28}{space 2} 1087.779{col 39}{space 1}    0.54{col 48}{space 3}0.587{col 56}{space 4}-1556.891{col 69}{space 3} 2740.044
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 238.0835{col 28}{space 2}   179.65{col 39}{space 1}    1.33{col 48}{space 3}0.187{col 56}{space 4}-116.6622{col 69}{space 3} 592.8291
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-7998.797{col 28}{space 2} 3077.353{col 39}{space 1}   -2.60{col 48}{space 3}0.010{col 56}{space 4}-14075.51{col 69}{space 3}-1922.082
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 927090.2{col 28}{space 2} 626656.5{col 39}{space 1}    1.48{col 48}{space 3}0.141{col 56}{space 4}-310368.4{col 69}{space 3}  2164549
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0389
{txt}{col 49}Largest FMI{col 67}= {res}    0.3602
{txt}{col 49}Complete DF{col 67}= {res}       165
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     28.23
{txt}{col 49}        avg{col 67}= {res}    147.07
{txt}{col 49}        max{col 67}= {res}    162.84
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  161.9{txt}){col 67}= {res}      8.51
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 10837.34{col 28}{space 2}  9120.91{col 39}{space 1}    1.19{col 48}{space 3}0.237{col 56}{space 4}-7175.021{col 69}{space 3} 28849.71
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 22947.84{col 28}{space 2} 26183.16{col 39}{space 1}    0.88{col 48}{space 3}0.382{col 56}{space 4}-28762.53{col 69}{space 3} 74658.21
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-18046.69{col 28}{space 2} 11372.34{col 39}{space 1}   -1.59{col 48}{space 3}0.114{col 56}{space 4}-40504.78{col 69}{space 3} 4411.392
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 72428.94{col 28}{space 2} 8599.269{col 39}{space 1}    8.42{col 48}{space 3}0.000{col 56}{space 4}  55405.8{col 69}{space 3} 89452.08
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-392.7165{col 28}{space 2} 426.7073{col 39}{space 1}   -0.92{col 48}{space 3}0.359{col 56}{space 4}-1235.397{col 69}{space 3} 449.9642
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3858.558{col 28}{space 2} 7612.592{col 39}{space 1}   -0.51{col 48}{space 3}0.613{col 56}{space 4}-18890.68{col 69}{space 3} 11173.56
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} -11.8531{col 28}{space 2} 5.457337{col 39}{space 1}   -2.17{col 48}{space 3}0.031{col 56}{space 4}-22.62977{col 69}{space 3}-1.076441
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}   973.19{col 28}{space 2} 563.2192{col 39}{space 1}    1.73{col 48}{space 3}0.086{col 56}{space 4}-139.1329{col 69}{space 3} 2085.513
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-19280.69{col 28}{space 2} 20472.29{col 39}{space 1}   -0.94{col 48}{space 3}0.354{col 56}{space 4}-61200.93{col 69}{space 3} 22639.56
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} 76682.23{col 28}{space 2} 559936.8{col 39}{space 1}    0.14{col 48}{space 3}0.891{col 56}{space 4} -1029172{col 69}{space 3}  1182537
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2}-244.8635{col 28}{space 2} 990.7979{col 39}{space 1}   -0.25{col 48}{space 3}0.805{col 56}{space 4}-2203.778{col 69}{space 3} 1714.051
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}  109.258{col 28}{space 2} 160.8068{col 39}{space 1}    0.68{col 48}{space 3}0.498{col 56}{space 4}-208.2806{col 69}{space 3} 426.7966
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-8291.425{col 28}{space 2}  2759.99{col 39}{space 1}   -3.00{col 48}{space 3}0.003{col 56}{space 4}-13741.71{col 69}{space 3}-2841.138
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 333012.1{col 28}{space 2} 563602.7{col 39}{space 1}    0.59{col 48}{space 3}0.555{col 56}{space 4}-780083.9{col 69}{space 3}  1446108
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 5: MODEL2+OXIDATIVE STRESS******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0476
{txt}{col 49}Largest FMI{col 67}= {res}    0.3086
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     24.22
{txt}{col 49}        avg{col 67}= {res}     56.56
{txt}{col 49}        max{col 67}= {res}     61.89
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   61.5{txt}){col 67}= {res}      4.90
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-20992.13{col 26}{space 2} 18607.75{col 37}{space 1}   -1.13{col 46}{space 3}0.264{col 54}{space 4}-58189.76{col 67}{space 3} 16205.51
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 119223.9{col 26}{space 2}  21994.6{col 37}{space 1}    5.42{col 46}{space 3}0.000{col 54}{space 4} 75233.69{col 67}{space 3} 163214.2
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2573.367{col 26}{space 2} 1395.962{col 37}{space 1}   -1.84{col 46}{space 3}0.070{col 54}{space 4}-5367.279{col 67}{space 3} 220.5456
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 20476.74{col 26}{space 2} 25597.86{col 37}{space 1}    0.80{col 46}{space 3}0.427{col 54}{space 4}-30705.45{col 67}{space 3} 71658.93
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-12.18825{col 26}{space 2} 21.25882{col 37}{space 1}   -0.57{col 46}{space 3}0.569{col 54}{space 4} -54.7189{col 67}{space 3} 30.34239
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1472.856{col 26}{space 2} 1762.744{col 37}{space 1}    0.84{col 46}{space 3}0.407{col 54}{space 4}-2053.636{col 67}{space 3} 4999.347
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 2351.845{col 26}{space 2} 1812.121{col 37}{space 1}    1.30{col 46}{space 3}0.207{col 54}{space 4}-1386.425{col 67}{space 3} 6090.115
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 21349.05{col 26}{space 2} 40928.57{col 37}{space 1}    0.52{col 46}{space 3}0.604{col 54}{space 4}-60518.69{col 67}{space 3} 103216.8
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}  3194.32{col 26}{space 2} 6073.937{col 37}{space 1}    0.53{col 46}{space 3}0.601{col 54}{space 4}-8949.981{col 67}{space 3} 15338.62
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 909333.1{col 26}{space 2} 220591.1{col 37}{space 1}    4.12{col 46}{space 3}0.000{col 54}{space 4} 467918.6{col 67}{space 3}  1350748
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0331
{txt}{col 49}Largest FMI{col 67}= {res}    0.2492
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     29.96
{txt}{col 49}        avg{col 67}= {res}     57.97
{txt}{col 49}        max{col 67}= {res}     61.93
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   61.8{txt}){col 67}= {res}      5.04
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-11544.88{col 26}{space 2} 10664.48{col 37}{space 1}   -1.08{col 46}{space 3}0.283{col 54}{space 4}-32863.38{col 67}{space 3} 9773.605
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 59823.39{col 26}{space 2} 12542.68{col 37}{space 1}    4.77{col 46}{space 3}0.000{col 54}{space 4} 34745.33{col 67}{space 3} 84901.45
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2180.203{col 26}{space 2} 793.9371{col 37}{space 1}   -2.75{col 46}{space 3}0.008{col 54}{space 4}-3768.218{col 67}{space 3}-592.1886
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 10136.29{col 26}{space 2} 14634.21{col 37}{space 1}    0.69{col 46}{space 3}0.491{col 54}{space 4}-19120.24{col 67}{space 3} 39392.81
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-6.628406{col 26}{space 2} 12.13551{col 37}{space 1}   -0.55{col 46}{space 3}0.587{col 54}{space 4} -30.8996{col 67}{space 3} 17.64279
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 880.8046{col 26}{space 2} 1004.483{col 37}{space 1}    0.88{col 46}{space 3}0.384{col 54}{space 4}-1127.908{col 67}{space 3} 2889.517
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 882.5854{col 26}{space 2} 1004.057{col 37}{space 1}    0.88{col 46}{space 3}0.386{col 54}{space 4}-1168.092{col 67}{space 3} 2933.263
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 12241.55{col 26}{space 2} 23304.15{col 37}{space 1}    0.53{col 46}{space 3}0.601{col 54}{space 4}-34353.17{col 67}{space 3} 58836.26
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 3407.889{col 26}{space 2} 3472.832{col 37}{space 1}    0.98{col 46}{space 3}0.330{col 54}{space 4}-3534.814{col 67}{space 3} 10350.59
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 552814.1{col 26}{space 2} 125585.9{col 37}{space 1}    4.40{col 46}{space 3}0.000{col 54}{space 4} 301639.6{col 67}{space 3} 803988.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0415
{txt}{col 49}Largest FMI{col 67}= {res}    0.2438
{txt}{col 49}Complete DF{col 67}= {res}        64
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     30.55
{txt}{col 49}        avg{col 67}= {res}     57.11
{txt}{col 49}        max{col 67}= {res}     61.92
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   61.6{txt}){col 67}= {res}      3.71
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0009

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-10226.85{col 26}{space 2} 8528.649{col 37}{space 1}   -1.20{col 46}{space 3}0.235{col 54}{space 4}-27275.83{col 67}{space 3}  6822.12
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 48663.55{col 26}{space 2} 10104.45{col 37}{space 1}    4.82{col 46}{space 3}0.000{col 54}{space 4} 28451.19{col 67}{space 3} 68875.91
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-787.2614{col 26}{space 2} 639.1893{col 37}{space 1}   -1.23{col 46}{space 3}0.223{col 54}{space 4}-2066.413{col 67}{space 3} 491.8901
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 3456.987{col 26}{space 2} 11757.79{col 37}{space 1}    0.29{col 46}{space 3}0.770{col 54}{space 4}-20055.04{col 67}{space 3} 26969.02
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-3.185388{col 26}{space 2} 9.708023{col 37}{space 1}   -0.33{col 46}{space 3}0.744{col 54}{space 4}-22.60197{col 67}{space 3} 16.23119
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 359.8928{col 26}{space 2} 808.8415{col 37}{space 1}    0.44{col 46}{space 3}0.658{col 54}{space 4}-1258.367{col 67}{space 3} 1978.152
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 1272.295{col 26}{space 2} 800.4842{col 37}{space 1}    1.59{col 46}{space 3}0.122{col 54}{space 4}-361.2717{col 67}{space 3} 2905.861
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 8785.079{col 26}{space 2} 18846.73{col 37}{space 1}    0.47{col 46}{space 3}0.643{col 54}{space 4}-28925.94{col 67}{space 3} 46496.09
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 81.17386{col 26}{space 2} 2787.016{col 37}{space 1}    0.03{col 46}{space 3}0.977{col 54}{space 4}-5491.496{col 67}{space 3} 5653.844
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   365907{col 26}{space 2} 101040.1{col 37}{space 1}    3.62{col 46}{space 3}0.001{col 54}{space 4} 163734.7{col 67}{space 3} 568079.3
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0055
{txt}{col 49}Largest FMI{col 67}= {res}    0.0345
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     87.86
{txt}{col 49}        avg{col 67}= {res}     92.28
{txt}{col 49}        max{col 67}= {res}     93.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.0{txt}){col 67}= {res}      8.67
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}  11458.4{col 26}{space 2} 20030.36{col 37}{space 1}    0.57{col 46}{space 3}0.569{col 54}{space 4}-28317.72{col 67}{space 3} 51234.51
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}   153667{col 26}{space 2} 19126.16{col 37}{space 1}    8.03{col 46}{space 3}0.000{col 54}{space 4} 115686.2{col 67}{space 3} 191647.7
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2032.373{col 26}{space 2} 1207.379{col 37}{space 1}   -1.68{col 46}{space 3}0.096{col 54}{space 4}-4429.982{col 67}{space 3} 365.2369
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-16732.07{col 26}{space 2} 21639.92{col 37}{space 1}   -0.77{col 46}{space 3}0.441{col 54}{space 4}-59704.45{col 67}{space 3} 26240.32
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-22.63929{col 26}{space 2} 14.89404{col 37}{space 1}   -1.52{col 46}{space 3}0.132{col 54}{space 4}  -52.216{col 67}{space 3} 6.937408
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 361.8259{col 26}{space 2} 1520.042{col 37}{space 1}    0.24{col 46}{space 3}0.812{col 54}{space 4}-2656.688{col 67}{space 3} 3380.339
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 359.7627{col 26}{space 2} 916.4042{col 37}{space 1}    0.39{col 46}{space 3}0.696{col 54}{space 4}-1461.439{col 67}{space 3} 2180.964
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-16460.51{col 26}{space 2} 37917.37{col 37}{space 1}   -0.43{col 46}{space 3}0.665{col 54}{space 4}-91756.95{col 67}{space 3} 58835.93
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-4241.316{col 26}{space 2}  4439.19{col 37}{space 1}   -0.96{col 46}{space 3}0.342{col 54}{space 4}-13059.31{col 67}{space 3}  4576.68
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1150341{col 26}{space 2}   204426{col 37}{space 1}    5.63{col 46}{space 3}0.000{col 54}{space 4} 744389.9{col 67}{space 3}  1556292
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0053
{txt}{col 49}Largest FMI{col 67}= {res}    0.0424
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     86.16
{txt}{col 49}        avg{col 67}= {res}     92.23
{txt}{col 49}        max{col 67}= {res}     93.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.0{txt}){col 67}= {res}      9.14
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 27.28703{col 26}{space 2} 10324.82{col 37}{space 1}    0.00{col 46}{space 3}0.998{col 54}{space 4}-20475.61{col 67}{space 3} 20530.19
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 79038.42{col 26}{space 2} 9857.384{col 37}{space 1}    8.02{col 46}{space 3}0.000{col 54}{space 4} 59463.72{col 67}{space 3} 98613.12
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1663.183{col 26}{space 2} 622.2882{col 37}{space 1}   -2.67{col 46}{space 3}0.009{col 54}{space 4}-2898.915{col 67}{space 3}-427.4509
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-11317.86{col 26}{space 2} 11155.45{col 37}{space 1}   -1.01{col 46}{space 3}0.313{col 54}{space 4}-33470.26{col 67}{space 3} 10834.54
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-6.172293{col 26}{space 2} 7.676579{col 37}{space 1}   -0.80{col 46}{space 3}0.423{col 54}{space 4}-21.41643{col 67}{space 3} 9.071845
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 636.2202{col 26}{space 2} 783.6825{col 37}{space 1}    0.81{col 46}{space 3}0.419{col 54}{space 4}-920.0293{col 67}{space 3}  2192.47
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 74.59197{col 26}{space 2} 474.2328{col 37}{space 1}    0.16{col 46}{space 3}0.875{col 54}{space 4}-868.1263{col 67}{space 3}  1017.31
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 2065.787{col 26}{space 2} 19543.25{col 37}{space 1}    0.11{col 46}{space 3}0.916{col 54}{space 4}-36743.09{col 67}{space 3} 40874.67
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-565.1927{col 26}{space 2} 2280.407{col 37}{space 1}   -0.25{col 46}{space 3}0.805{col 54}{space 4}-5094.312{col 67}{space 3} 3963.927
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 626313.4{col 26}{space 2}   105367{col 37}{space 1}    5.94{col 46}{space 3}0.000{col 54}{space 4} 417075.4{col 67}{space 3} 835551.4
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0066
{txt}{col 49}Largest FMI{col 67}= {res}    0.0383
{txt}{col 49}Complete DF{col 67}= {res}        95
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     87.05
{txt}{col 49}        avg{col 67}= {res}     92.11
{txt}{col 49}        max{col 67}= {res}     93.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   93.0{txt}){col 67}= {res}      6.36
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 6683.064{col 26}{space 2} 10101.76{col 37}{space 1}    0.66{col 46}{space 3}0.510{col 54}{space 4}-13377.03{col 67}{space 3} 26743.15
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 63159.38{col 26}{space 2} 9649.039{col 37}{space 1}    6.55{col 46}{space 3}0.000{col 54}{space 4} 43998.02{col 67}{space 3} 82320.74
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-665.1983{col 26}{space 2} 608.9495{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-1874.457{col 67}{space 3} 544.0601
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-8843.128{col 26}{space 2} 10912.48{col 37}{space 1}   -0.81{col 46}{space 3}0.420{col 54}{space 4}-30513.09{col 67}{space 3} 12826.84
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-13.74911{col 26}{space 2} 7.512347{col 37}{space 1}   -1.83{col 46}{space 3}0.070{col 54}{space 4}-28.66732{col 67}{space 3} 1.169087
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 94.32075{col 26}{space 2} 766.6057{col 37}{space 1}    0.12{col 46}{space 3}0.902{col 54}{space 4} -1428.02{col 67}{space 3} 1616.661
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 305.6988{col 26}{space 2} 462.9583{col 37}{space 1}    0.66{col 46}{space 3}0.511{col 54}{space 4} -614.473{col 67}{space 3} 1225.871
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-3692.397{col 26}{space 2} 19125.21{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4}-41671.62{col 67}{space 3} 34286.83
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} -2692.68{col 26}{space 2} 2241.576{col 37}{space 1}   -1.20{col 46}{space 3}0.233{col 54}{space 4}-7145.648{col 67}{space 3} 1760.288
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 441525.7{col 26}{space 2} 103110.2{col 37}{space 1}    4.28{col 46}{space 3}0.000{col 54}{space 4} 236766.9{col 67}{space 3} 646284.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. **********INTERACTION BY Race***************
. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0121
{txt}{col 49}Largest FMI{col 67}= {res}    0.1129
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    103.91
{txt}{col 49}        avg{col 67}= {res}    159.21
{txt}{col 49}        max{col 67}= {res}    165.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  164.8{txt}){col 67}= {res}     13.10
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 16202.86{col 28}{space 2} 18537.47{col 39}{space 1}    0.87{col 48}{space 3}0.383{col 56}{space 4}-20398.82{col 69}{space 3} 52804.53
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 17269.66{col 28}{space 2} 55183.68{col 39}{space 1}    0.31{col 48}{space 3}0.755{col 56}{space 4}-91693.88{col 69}{space 3} 126233.2
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-37261.04{col 28}{space 2} 23704.76{col 39}{space 1}   -1.57{col 48}{space 3}0.118{col 56}{space 4} -84065.3{col 69}{space 3} 9543.226
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 140172.6{col 28}{space 2} 14195.24{col 39}{space 1}    9.87{col 48}{space 3}0.000{col 56}{space 4} 112143.7{col 69}{space 3} 168201.5
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2286.919{col 28}{space 2} 864.4696{col 39}{space 1}   -2.65{col 48}{space 3}0.009{col 56}{space 4}-3993.786{col 69}{space 3}-580.0526
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -329.345{col 28}{space 2} 16060.73{col 39}{space 1}   -0.02{col 48}{space 3}0.984{col 56}{space 4}-32040.96{col 69}{space 3} 31382.27
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-20.24258{col 28}{space 2} 11.77347{col 39}{space 1}   -1.72{col 48}{space 3}0.087{col 56}{space 4}-43.48937{col 69}{space 3}  3.00421
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 785.7691{col 28}{space 2} 1114.768{col 39}{space 1}    0.70{col 48}{space 3}0.482{col 56}{space 4}-1415.306{col 69}{space 3} 2986.844
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 807.8759{col 28}{space 2} 801.5262{col 39}{space 1}    1.01{col 48}{space 3}0.316{col 56}{space 4}-781.5971{col 69}{space 3} 2397.349
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2}-2484.622{col 28}{space 2} 27146.86{col 39}{space 1}   -0.09{col 48}{space 3}0.927{col 56}{space 4}-56084.62{col 69}{space 3} 51115.37
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-2196.042{col 28}{space 2} 3507.404{col 39}{space 1}   -0.63{col 48}{space 3}0.532{col 56}{space 4}-9122.332{col 69}{space 3} 4730.249
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1054513{col 28}{space 2} 150663.1{col 39}{space 1}    7.00{col 48}{space 3}0.000{col 56}{space 4} 757030.1{col 69}{space 3}  1351997
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0072
{txt}{col 49}Largest FMI{col 67}= {res}    0.0710
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    130.64
{txt}{col 49}        avg{col 67}= {res}    161.80
{txt}{col 49}        max{col 67}= {res}    165.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  165.0{txt}){col 67}= {res}     14.68
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 3743.979{col 28}{space 2} 9969.809{col 39}{space 1}    0.38{col 48}{space 3}0.708{col 56}{space 4}-15940.96{col 69}{space 3} 23428.92
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-10653.72{col 28}{space 2} 29650.86{col 39}{space 1}   -0.36{col 48}{space 3}0.720{col 56}{space 4}-69199.43{col 69}{space 3}    47892
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-16647.57{col 28}{space 2} 12749.72{col 39}{space 1}   -1.31{col 48}{space 3}0.193{col 56}{space 4} -41821.3{col 69}{space 3} 8526.155
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 71826.22{col 28}{space 2} 7628.286{col 39}{space 1}    9.42{col 48}{space 3}0.000{col 56}{space 4} 56764.32{col 69}{space 3} 86888.13
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1948.831{col 28}{space 2}  464.902{col 39}{space 1}   -4.19{col 48}{space 3}0.000{col 56}{space 4}-2866.757{col 69}{space 3}-1030.905
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-1769.847{col 28}{space 2}  8636.66{col 39}{space 1}   -0.20{col 48}{space 3}0.838{col 56}{space 4} -18822.6{col 69}{space 3}  15282.9
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-7.107043{col 28}{space 2} 6.329877{col 39}{space 1}   -1.12{col 48}{space 3}0.263{col 56}{space 4}-19.60525{col 69}{space 3} 5.391158
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}  677.234{col 28}{space 2} 599.6212{col 39}{space 1}    1.13{col 48}{space 3}0.260{col 56}{space 4}-506.6936{col 69}{space 3} 1861.162
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 260.2571{col 28}{space 2}  422.239{col 39}{space 1}    0.62{col 48}{space 3}0.539{col 56}{space 4}-575.0537{col 69}{space 3} 1095.568
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 5199.335{col 28}{space 2} 14605.96{col 39}{space 1}    0.36{col 48}{space 3}0.722{col 56}{space 4}-23639.31{col 69}{space 3} 34037.98
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} 571.4228{col 28}{space 2} 1881.708{col 39}{space 1}    0.30{col 48}{space 3}0.762{col 56}{space 4}-3144.198{col 69}{space 3} 4287.044
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 608544.4{col 28}{space 2} 81014.45{col 39}{space 1}    7.51{col 48}{space 3}0.000{col 56}{space 4} 448583.8{col 69}{space 3}   768505
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0136
{txt}{col 49}Largest FMI{col 67}= {res}    0.1179
{txt}{col 49}Complete DF{col 67}= {res}       167
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    100.92
{txt}{col 49}        avg{col 67}= {res}    158.72
{txt}{col 49}        max{col 67}= {res}    164.97
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  164.8{txt}){col 67}= {res}      8.92
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 7597.932{col 28}{space 2} 8999.004{col 39}{space 1}    0.84{col 48}{space 3}0.400{col 56}{space 4}-10170.49{col 69}{space 3} 25366.35
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 22875.57{col 28}{space 2} 26793.24{col 39}{space 1}    0.85{col 48}{space 3}0.394{col 56}{space 4}-30030.14{col 69}{space 3} 75781.28
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-17140.07{col 28}{space 2} 11505.45{col 39}{space 1}   -1.49{col 48}{space 3}0.138{col 56}{space 4}-39857.33{col 69}{space 3} 5577.188
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 57397.63{col 28}{space 2}   6896.3{col 39}{space 1}    8.32{col 48}{space 3}0.000{col 56}{space 4}  43780.3{col 69}{space 3} 71014.96
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-697.7378{col 28}{space 2} 419.5756{col 39}{space 1}   -1.66{col 48}{space 3}0.098{col 56}{space 4} -1526.18{col 69}{space 3} 130.7047
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3183.485{col 28}{space 2} 7795.259{col 39}{space 1}   -0.41{col 48}{space 3}0.684{col 56}{space 4}-18575.17{col 69}{space 3}  12208.2
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-10.74342{col 28}{space 2} 5.714115{col 39}{space 1}   -1.88{col 48}{space 3}0.062{col 56}{space 4}-22.02605{col 69}{space 3} .5392021
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 215.8497{col 28}{space 2} 541.0482{col 39}{space 1}    0.40{col 48}{space 3}0.690{col 56}{space 4}-852.4392{col 69}{space 3} 1284.139
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 521.6599{col 28}{space 2} 389.9041{col 39}{space 1}    1.34{col 48}{space 3}0.184{col 56}{space 4}-251.8123{col 69}{space 3} 1295.132
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 690.5248{col 28}{space 2} 13172.87{col 39}{space 1}    0.05{col 48}{space 3}0.958{col 56}{space 4}-25318.63{col 69}{space 3} 26699.68
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-1975.906{col 28}{space 2} 1704.147{col 39}{space 1}   -1.16{col 48}{space 3}0.248{col 56}{space 4}-5341.344{col 69}{space 3} 1389.533
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 405876.2{col 28}{space 2} 73114.42{col 39}{space 1}    5.55{col 48}{space 3}0.000{col 56}{space 4} 261511.9{col 69}{space 3} 550240.6
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***********MODEL 6: MODEL 2+lifestyle/health-related factors*******  
. 
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0021
{txt}{col 49}Largest FMI{col 67}= {res}    0.0184
{txt}{col 49}Complete DF{col 67}= {res}        65
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     61.75
{txt}{col 49}        avg{col 67}= {res}     62.92
{txt}{col 49}        max{col 67}= {res}     63.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   63.1{txt}){col 67}= {res}      5.68
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-15248.36{col 26}{space 2} 18375.43{col 37}{space 1}   -0.83{col 46}{space 3}0.410{col 54}{space 4}-51967.76{col 67}{space 3} 21471.05
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 116935.7{col 26}{space 2} 21915.25{col 37}{space 1}    5.34{col 46}{space 3}0.000{col 54}{space 4} 73142.63{col 67}{space 3} 160728.7
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2314.098{col 26}{space 2}  1335.13{col 37}{space 1}   -1.73{col 46}{space 3}0.088{col 54}{space 4}-4982.076{col 67}{space 3} 353.8791
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 16963.26{col 26}{space 2} 25410.65{col 37}{space 1}    0.67{col 46}{space 3}0.507{col 54}{space 4}-33814.51{col 67}{space 3} 67741.03
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-21.00743{col 26}{space 2} 19.89475{col 37}{space 1}   -1.06{col 46}{space 3}0.295{col 54}{space 4}-60.76366{col 67}{space 3}  18.7488
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 310.8021{col 26}{space 2} 1726.797{col 37}{space 1}    0.18{col 46}{space 3}0.858{col 54}{space 4}-3139.842{col 67}{space 3} 3761.446
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-7071.529{col 26}{space 2} 23786.25{col 37}{space 1}   -0.30{col 46}{space 3}0.767{col 54}{space 4}-54623.46{col 67}{space 3}  40480.4
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 17889.18{col 26}{space 2}  13519.9{col 37}{space 1}    1.32{col 46}{space 3}0.191{col 54}{space 4}-9127.879{col 67}{space 3} 44906.24
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1046095{col 26}{space 2} 91858.62{col 37}{space 1}   11.39{col 46}{space 3}0.000{col 54}{space 4} 862534.5{col 67}{space 3}  1229655
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0032
{txt}{col 49}Largest FMI{col 67}= {res}    0.0115
{txt}{col 49}Complete DF{col 67}= {res}        65
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     62.33
{txt}{col 49}        avg{col 67}= {res}     62.89
{txt}{col 49}        max{col 67}= {res}     63.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   63.1{txt}){col 67}= {res}      6.43
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-8370.068{col 26}{space 2} 10287.68{col 37}{space 1}   -0.81{col 46}{space 3}0.419{col 54}{space 4}-28928.17{col 67}{space 3} 12188.03
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 59978.25{col 26}{space 2} 12266.28{col 37}{space 1}    4.89{col 46}{space 3}0.000{col 54}{space 4} 35466.49{col 67}{space 3} 84490.02
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2146.299{col 26}{space 2} 747.7881{col 37}{space 1}   -2.87{col 46}{space 3}0.006{col 54}{space 4}-3640.647{col 67}{space 3}-651.9514
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 7818.554{col 26}{space 2} 14227.28{col 37}{space 1}    0.55{col 46}{space 3}0.585{col 54}{space 4}-20612.18{col 67}{space 3} 36249.29
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-9.919963{col 26}{space 2} 11.15922{col 37}{space 1}   -0.89{col 46}{space 3}0.377{col 54}{space 4}-32.22197{col 67}{space 3} 12.38204
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 68.94177{col 26}{space 2} 966.8139{col 37}{space 1}    0.07{col 46}{space 3}0.943{col 54}{space 4}-1863.071{col 67}{space 3} 2000.955
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-16391.39{col 26}{space 2}  13266.7{col 37}{space 1}   -1.24{col 46}{space 3}0.221{col 54}{space 4}-42908.32{col 67}{space 3} 10125.54
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 11961.26{col 26}{space 2} 7570.546{col 37}{space 1}    1.58{col 46}{space 3}0.119{col 54}{space 4}-3167.476{col 67}{space 3} 27089.99
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 631738.4{col 26}{space 2} 51473.07{col 37}{space 1}   12.27{col 46}{space 3}0.000{col 54}{space 4} 528874.8{col 67}{space 3} 734601.9
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}Average RVI{col 67}= {res}    0.0034
{txt}{col 49}Largest FMI{col 67}= {res}    0.0273
{txt}{col 49}Complete DF{col 67}= {res}        65
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     60.88
{txt}{col 49}        avg{col 67}= {res}     62.79
{txt}{col 49}        max{col 67}= {res}     63.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   63.1{txt}){col 67}= {res}      4.00
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0007

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-7864.365{col 26}{space 2} 8507.364{col 37}{space 1}   -0.92{col 46}{space 3}0.359{col 54}{space 4}-24864.61{col 67}{space 3} 9135.879
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 46604.96{col 26}{space 2} 10149.59{col 37}{space 1}    4.59{col 46}{space 3}0.000{col 54}{space 4} 26322.77{col 67}{space 3} 66887.16
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-604.5175{col 26}{space 2} 618.2341{col 37}{space 1}   -0.98{col 46}{space 3}0.332{col 54}{space 4}-1839.942{col 67}{space 3} 630.9072
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 2436.925{col 26}{space 2} 11768.84{col 37}{space 1}    0.21{col 46}{space 3}0.837{col 54}{space 4}-21081.05{col 67}{space 3}  25954.9
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.118506{col 26}{space 2} 9.207845{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-26.51863{col 67}{space 3} 10.28162
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 35.58274{col 26}{space 2} 799.8558{col 37}{space 1}    0.04{col 46}{space 3}0.965{col 54}{space 4}-1562.802{col 67}{space 3} 1633.967
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 8095.141{col 26}{space 2} 11058.77{col 37}{space 1}    0.73{col 46}{space 3}0.467{col 54}{space 4}-14019.11{col 67}{space 3}  30209.4
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 5561.582{col 26}{space 2} 6256.746{col 37}{space 1}    0.89{col 46}{space 3}0.377{col 54}{space 4}-6941.231{col 67}{space 3} 18064.39
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 420686.1{col 26}{space 2} 42578.77{col 37}{space 1}    9.88{col 46}{space 3}0.000{col 54}{space 4} 335596.8{col 67}{space 3} 505775.4
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0048
{txt}{col 49}Largest FMI{col 67}= {res}    0.0401
{txt}{col 49}Complete DF{col 67}= {res}        96
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     87.56
{txt}{col 49}        avg{col 67}= {res}     93.22
{txt}{col 49}        max{col 67}= {res}     94.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   94.0{txt}){col 67}= {res}      9.77
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}  12755.6{col 26}{space 2} 19957.59{col 37}{space 1}    0.64{col 46}{space 3}0.524{col 54}{space 4} -26870.6{col 67}{space 3} 52381.81
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 152671.2{col 26}{space 2}  18930.2{col 37}{space 1}    8.06{col 46}{space 3}0.000{col 54}{space 4}   115083{col 67}{space 3} 190259.5
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1928.472{col 26}{space 2} 1204.703{col 37}{space 1}   -1.60{col 46}{space 3}0.113{col 54}{space 4}-4320.435{col 67}{space 3} 463.4921
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-13951.46{col 26}{space 2} 22269.48{col 37}{space 1}   -0.63{col 46}{space 3}0.533{col 54}{space 4}-58168.07{col 67}{space 3} 30265.15
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-25.36547{col 26}{space 2} 14.91695{col 37}{space 1}   -1.70{col 46}{space 3}0.092{col 54}{space 4}-54.98367{col 67}{space 3} 4.252727
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 827.5525{col 26}{space 2} 1456.188{col 37}{space 1}    0.57{col 46}{space 3}0.571{col 54}{space 4}-2063.761{col 67}{space 3} 3718.866
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 11369.34{col 26}{space 2} 27435.05{col 37}{space 1}    0.41{col 46}{space 3}0.680{col 54}{space 4}-43155.89{col 67}{space 3} 65894.56
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 9561.046{col 26}{space 2} 12458.48{col 37}{space 1}    0.77{col 46}{space 3}0.445{col 54}{space 4}-15175.38{col 67}{space 3} 34297.47
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1034043{col 26}{space 2} 100303.5{col 37}{space 1}   10.31{col 46}{space 3}0.000{col 54}{space 4} 834882.3{col 67}{space 3}  1233203
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0064
{txt}{col 49}Largest FMI{col 67}= {res}    0.0571
{txt}{col 49}Complete DF{col 67}= {res}        96
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     83.49
{txt}{col 49}        avg{col 67}= {res}     92.76
{txt}{col 49}        max{col 67}= {res}     94.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   94.0{txt}){col 67}= {res}     10.57
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 278.4426{col 26}{space 2} 10220.27{col 37}{space 1}    0.03{col 46}{space 3}0.978{col 54}{space 4}-20013.99{col 67}{space 3} 20570.87
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 79474.61{col 26}{space 2} 9698.464{col 37}{space 1}    8.19{col 46}{space 3}0.000{col 54}{space 4} 60216.98{col 67}{space 3} 98732.24
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1684.195{col 26}{space 2} 617.1013{col 37}{space 1}   -2.73{col 46}{space 3}0.008{col 54}{space 4}-2909.465{col 67}{space 3}-458.9253
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-9166.638{col 26}{space 2} 11406.57{col 37}{space 1}   -0.80{col 46}{space 3}0.424{col 54}{space 4}-31814.65{col 67}{space 3} 13481.37
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.033404{col 26}{space 2} 7.636363{col 37}{space 1}   -1.05{col 46}{space 3}0.295{col 54}{space 4}-23.19548{col 67}{space 3} 7.128675
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 677.9382{col 26}{space 2} 746.0856{col 37}{space 1}    0.91{col 46}{space 3}0.366{col 54}{space 4}-803.4531{col 67}{space 3}  2159.33
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 543.0702{col 26}{space 2} 14170.71{col 37}{space 1}    0.04{col 46}{space 3}0.970{col 54}{space 4}-27639.43{col 67}{space 3} 28725.57
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 5572.206{col 26}{space 2} 6381.104{col 37}{space 1}    0.87{col 46}{space 3}0.385{col 54}{space 4} -7097.52{col 67}{space 3} 18241.93
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 622626.7{col 26}{space 2} 51404.33{col 37}{space 1}   12.11{col 46}{space 3}0.000{col 54}{space 4} 520557.8{col 67}{space 3} 724695.6
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       105
{txt}{col 49}Average RVI{col 67}= {res}    0.0055
{txt}{col 49}Largest FMI{col 67}= {res}    0.0285
{txt}{col 49}Complete DF{col 67}= {res}        96
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     89.99
{txt}{col 49}        avg{col 67}= {res}     93.31
{txt}{col 49}        max{col 67}= {res}     94.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   94.0{txt}){col 67}= {res}      7.14
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 7564.631{col 26}{space 2} 10074.29{col 37}{space 1}    0.75{col 46}{space 3}0.455{col 54}{space 4}-12438.62{col 67}{space 3} 27567.88
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 64874.13{col 26}{space 2} 9549.621{col 37}{space 1}    6.79{col 46}{space 3}0.000{col 54}{space 4} 45911.97{col 67}{space 3} 83836.28
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-575.5965{col 26}{space 2} 607.7306{col 37}{space 1}   -0.95{col 46}{space 3}0.346{col 54}{space 4}-1782.269{col 67}{space 3} 631.0766
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-7480.636{col 26}{space 2} 11238.22{col 37}{space 1}   -0.67{col 46}{space 3}0.507{col 54}{space 4}-29794.82{col 67}{space 3} 14833.55
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.84381{col 26}{space 2} 7.558901{col 37}{space 1}   -2.10{col 46}{space 3}0.039{col 54}{space 4}-30.85473{col 67}{space 3}-.8328872
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 333.3012{col 26}{space 2}   734.15{col 37}{space 1}    0.45{col 46}{space 3}0.651{col 54}{space 4}-1124.369{col 67}{space 3} 1790.972
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 15039.89{col 26}{space 2} 13755.97{col 37}{space 1}    1.09{col 46}{space 3}0.277{col 54}{space 4} -12288.8{col 67}{space 3} 42368.59
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 3262.383{col 26}{space 2} 6285.448{col 37}{space 1}    0.52{col 46}{space 3}0.605{col 54}{space 4}-9217.574{col 67}{space 3} 15742.34
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 402493.4{col 26}{space 2} 50570.33{col 37}{space 1}    7.96{col 46}{space 3}0.000{col 54}{space 4} 302082.8{col 67}{space 3} 502903.9
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. ******************INTERACTION BY Race***********************
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0007
{txt}{col 49}Largest FMI{col 67}= {res}    0.0078
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    164.41
{txt}{col 49}        avg{col 67}= {res}    165.87
{txt}{col 49}        max{col 67}= {res}    166.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  166.0{txt}){col 67}= {res}     14.83
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 16782.12{col 28}{space 2} 18423.73{col 39}{space 1}    0.91{col 48}{space 3}0.364{col 56}{space 4}-19592.86{col 69}{space 3}  53157.1
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 7615.857{col 28}{space 2} 53830.54{col 39}{space 1}    0.14{col 48}{space 3}0.888{col 56}{space 4}-98664.73{col 69}{space 3} 113896.4
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} -35370.5{col 28}{space 2} 23593.19{col 39}{space 1}   -1.50{col 48}{space 3}0.136{col 56}{space 4}-81951.84{col 69}{space 3} 11210.84
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 137161.7{col 28}{space 2} 13793.47{col 39}{space 1}    9.94{col 48}{space 3}0.000{col 56}{space 4} 109928.5{col 69}{space 3}   164395
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2240.904{col 28}{space 2}  855.861{col 39}{space 1}   -2.62{col 48}{space 3}0.010{col 56}{space 4}-3930.678{col 69}{space 3}-551.1297
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} 724.4154{col 28}{space 2} 16162.23{col 39}{space 1}    0.04{col 48}{space 3}0.964{col 56}{space 4}-31185.59{col 69}{space 3} 32634.42
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-23.71305{col 28}{space 2} 11.50145{col 39}{space 1}   -2.06{col 48}{space 3}0.041{col 56}{space 4}-46.42101{col 69}{space 3}-1.005085
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 647.1285{col 28}{space 2} 1072.637{col 39}{space 1}    0.60{col 48}{space 3}0.547{col 56}{space 4}-1470.642{col 69}{space 3} 2764.899
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-3347.388{col 28}{space 2} 17344.57{col 39}{space 1}   -0.19{col 48}{space 3}0.847{col 56}{space 4}-37594.21{col 69}{space 3} 30899.43
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 12765.49{col 28}{space 2} 8809.249{col 39}{space 1}    1.45{col 48}{space 3}0.149{col 56}{space 4}-4627.093{col 69}{space 3} 30158.07
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1041161{col 28}{space 2}  73604.6{col 39}{space 1}   14.15{col 48}{space 3}0.000{col 56}{space 4} 895838.6{col 69}{space 3}  1186483
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0031
{txt}{col 49}Largest FMI{col 67}= {res}    0.0224
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    159.37
{txt}{col 49}        avg{col 67}= {res}    165.15
{txt}{col 49}        max{col 67}= {res}    165.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  166.0{txt}){col 67}= {res}     17.19
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}  3411.76{col 28}{space 2} 9811.164{col 39}{space 1}    0.35{col 48}{space 3}0.728{col 56}{space 4}-15959.04{col 69}{space 3} 22782.56
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-17145.95{col 28}{space 2} 28670.72{col 39}{space 1}   -0.60{col 48}{space 3}0.551{col 56}{space 4}-73752.51{col 69}{space 3} 39460.61
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-14301.22{col 28}{space 2} 12566.36{col 39}{space 1}   -1.14{col 48}{space 3}0.257{col 56}{space 4}-39111.86{col 69}{space 3} 10509.41
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 70730.49{col 28}{space 2} 7344.065{col 39}{space 1}    9.63{col 48}{space 3}0.000{col 56}{space 4} 56230.67{col 69}{space 3}  85230.3
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2010.377{col 28}{space 2} 455.8889{col 39}{space 1}   -4.41{col 48}{space 3}0.000{col 56}{space 4}-2910.471{col 69}{space 3}-1110.282
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-1027.704{col 28}{space 2} 8611.874{col 39}{space 1}   -0.12{col 48}{space 3}0.905{col 56}{space 4}-18030.85{col 69}{space 3} 15975.44
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-9.014673{col 28}{space 2} 6.137078{col 39}{space 1}   -1.47{col 48}{space 3}0.144{col 56}{space 4}-21.13195{col 69}{space 3}   3.1026
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 415.1297{col 28}{space 2} 571.5526{col 39}{space 1}    0.73{col 48}{space 3}0.469{col 56}{space 4}-713.3365{col 69}{space 3} 1543.596
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-11210.95{col 28}{space 2} 9300.721{col 39}{space 1}   -1.21{col 48}{space 3}0.230{col 56}{space 4}-29579.51{col 69}{space 3} 7157.614
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 8373.076{col 28}{space 2} 4692.291{col 39}{space 1}    1.78{col 48}{space 3}0.076{col 56}{space 4}-891.2457{col 69}{space 3}  17637.4
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 638784.3{col 28}{space 2}  39239.1{col 39}{space 1}   16.28{col 48}{space 3}0.000{col 56}{space 4} 561310.4{col 69}{space 3} 716258.3
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       179
{txt}{col 49}Average RVI{col 67}= {res}    0.0013
{txt}{col 49}Largest FMI{col 67}= {res}    0.0049
{txt}{col 49}Complete DF{col 67}= {res}       168
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    165.10
{txt}{col 49}        avg{col 67}= {res}    165.81
{txt}{col 49}        max{col 67}= {res}    166.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  166.0{txt}){col 67}= {res}      9.76
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 8423.185{col 28}{space 2} 9002.342{col 39}{space 1}    0.94{col 48}{space 3}0.351{col 56}{space 4}-9350.685{col 69}{space 3} 26197.05
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 18380.63{col 28}{space 2}    26307{col 39}{space 1}    0.70{col 48}{space 3}0.486{col 56}{space 4}-33558.99{col 69}{space 3} 70320.25
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-17321.79{col 28}{space 2} 11528.29{col 39}{space 1}   -1.50{col 48}{space 3}0.135{col 56}{space 4} -40082.8{col 69}{space 3} 5439.226
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 56934.66{col 28}{space 2} 6740.771{col 39}{space 1}    8.45{col 48}{space 3}0.000{col 56}{space 4} 43625.92{col 69}{space 3}  70243.4
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-619.2345{col 28}{space 2}  418.183{col 39}{space 1}   -1.48{col 48}{space 3}0.141{col 56}{space 4}-1444.879{col 69}{space 3} 206.4095
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2668.677{col 28}{space 2} 7898.382{col 39}{space 1}   -0.34{col 48}{space 3}0.736{col 56}{space 4}-18262.98{col 69}{space 3} 12925.62
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-12.89599{col 28}{space 2} 5.627801{col 39}{space 1}   -2.29{col 48}{space 3}0.023{col 56}{space 4}-24.00757{col 69}{space 3}-1.784401
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 247.1303{col 28}{space 2}  524.003{col 39}{space 1}    0.47{col 48}{space 3}0.638{col 56}{space 4}-787.4391{col 69}{space 3}   1281.7
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2} 9000.425{col 28}{space 2} 8461.643{col 39}{space 1}    1.06{col 48}{space 3}0.289{col 56}{space 4}-7706.556{col 69}{space 3} 25707.41
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 3586.488{col 28}{space 2} 4306.754{col 39}{space 1}    0.83{col 48}{space 3}0.406{col 56}{space 4}-4916.668{col 69}{space 3} 12089.64
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 405183.7{col 28}{space 2} 35958.26{col 39}{space 1}   11.27{col 48}{space 3}0.000{col 56}{space 4} 334189.2{col 69}{space 3} 476178.3
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed.dta{rm}
saved
{p_end}

{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}