{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. /////////////////////////////////////////////////TABLE S6: TOTAL AND GM/WM VOLUMES VS. NFL exposures by Race***********************
> ////////////////////////////////////////LnNFLw1 EXPOSURE/////////////////////////////////////////////
> 
. 
. ***********************LnNFLw1, MODELS 1 AND 2*********************
. 
. *********************AFRICAN-AMERICAN*******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final2==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        67
{txt}{hline 13}{c +}{hline 34}   F(5, 61)        = {res}    11.44
{txt}       Model {c |} {res} 3.4962e+11         5  6.9925e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.7283e+11        61  6.1120e+09   {txt}R-squared       ={res}    0.4839
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4416
{txt}       Total {c |} {res} 7.2245e+11        66  1.0946e+10   {txt}Root MSE        =   {res}  78179

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-41478.97{col 26}{space 2}    25446{col 37}{space 1}   -1.63{col 46}{space 3}0.108{col 67}{space 3}-.1835216
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 127697.1{col 26}{space 2} 19615.73{col 37}{space 1}    6.51{col 46}{space 3}0.000{col 67}{space 3} .6065266
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1676.428{col 26}{space 2} 1269.797{col 37}{space 1}   -1.32{col 46}{space 3}0.192{col 67}{space 3}-.1581991
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 23294.63{col 26}{space 2} 24262.02{col 37}{space 1}    0.96{col 46}{space 3}0.341{col 67}{space 3} .1084946
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -20.1077{col 26}{space 2} 18.35418{col 37}{space 1}   -1.10{col 46}{space 3}0.278{col 67}{space 3}-.1147828
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1087313{col 26}{space 2} 76828.83{col 37}{space 1}   14.15{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final2==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        67
{txt}{hline 13}{c +}{hline 34}   F(5, 61)        = {res}    11.21
{txt}       Model {c |} {res} 1.1579e+11         5  2.3157e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.2596e+11        61  2.0648e+09   {txt}R-squared       ={res}    0.4790
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4363
{txt}       Total {c |} {res} 2.4174e+11        66  3.6627e+09   {txt}Root MSE        =   {res}  45441

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-18026.63{col 26}{space 2} 14790.17{col 37}{space 1}   -1.22{col 46}{space 3}0.228{col 67}{space 3}-.1378807
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 67625.55{col 26}{space 2}  11401.4{col 37}{space 1}    5.93{col 46}{space 3}0.000{col 67}{space 3} .5552767
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1752.755{col 26}{space 2} 738.0538{col 37}{space 1}   -2.37{col 46}{space 3}0.021{col 67}{space 3}-.2859367
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 12136.05{col 26}{space 2} 14101.99{col 37}{space 1}    0.86{col 46}{space 3}0.393{col 67}{space 3} .0977146
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-10.04335{col 26}{space 2} 10.66814{col 37}{space 1}   -0.94{col 46}{space 3}0.350{col 67}{space 3}-.0991112
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 640389.8{col 26}{space 2} 44655.79{col 37}{space 1}   14.34{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final2==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        67
{txt}{hline 13}{c +}{hline 34}   F(5, 61)        = {res}     8.02
{txt}       Model {c |} {res} 5.3304e+10         5  1.0661e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 8.1131e+10        61  1.3300e+09   {txt}R-squared       ={res}    0.3965
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3470
{txt}       Total {c |} {res} 1.3443e+11        66  2.0369e+09   {txt}Root MSE        =   {res}  36469

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-21148.23{col 26}{space 2}  11870.2{col 37}{space 1}   -1.78{col 46}{space 3}0.080{col 67}{space 3}-.2169114
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 49998.25{col 26}{space 2} 9150.457{col 37}{space 1}    5.46{col 46}{space 3}0.000{col 67}{space 3} .5505198
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-445.3266{col 26}{space 2} 592.3422{col 37}{space 1}   -0.75{col 46}{space 3}0.455{col 67}{space 3}-.0974197
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 3316.207{col 26}{space 2} 11317.88{col 37}{space 1}    0.29{col 46}{space 3}0.771{col 67}{space 3}  .035805
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-6.826527{col 26}{space 2} 8.561962{col 37}{space 1}   -0.80{col 46}{space 3}0.428{col 67}{space 3}-.0903365
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   444222{col 26}{space 2} 35839.54{col 37}{space 1}   12.39{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        60
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     58.10
{txt}{col 49}        avg{col 67}= {res}     58.10
{txt}{col 49}        max{col 67}= {res}     58.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   58.1{txt}){col 67}= {res}      9.41
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-46303.86{col 26}{space 2} 30026.72{col 37}{space 1}   -1.54{col 46}{space 3}0.128{col 54}{space 4}-106406.8{col 67}{space 3} 13799.04
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 126706.7{col 26}{space 2} 20021.62{col 37}{space 1}    6.33{col 46}{space 3}0.000{col 54}{space 4} 86630.46{col 67}{space 3} 166782.9
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1443.064{col 26}{space 2} 1486.032{col 37}{space 1}   -0.97{col 46}{space 3}0.336{col 54}{space 4}-4417.577{col 67}{space 3} 1531.449
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 24199.26{col 26}{space 2} 24619.05{col 37}{space 1}    0.98{col 46}{space 3}0.330{col 54}{space 4} -25079.4{col 67}{space 3} 73477.91
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-20.51667{col 26}{space 2} 18.53924{col 37}{space 1}   -1.11{col 46}{space 3}0.273{col 54}{space 4}-57.62569{col 67}{space 3} 16.59235
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-553.3687{col 26}{space 2}  1792.83{col 37}{space 1}   -0.31{col 46}{space 3}0.759{col 54}{space 4}-4141.982{col 67}{space 3} 3035.245
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1102784{col 26}{space 2} 92216.74{col 37}{space 1}   11.96{col 46}{space 3}0.000{col 54}{space 4} 918198.2{col 67}{space 3}  1287369
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        60
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     58.10
{txt}{col 49}        avg{col 67}= {res}     58.10
{txt}{col 49}        max{col 67}= {res}     58.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   58.1{txt}){col 67}= {res}      9.20
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-19278.28{col 26}{space 2} 17463.75{col 37}{space 1}   -1.10{col 46}{space 3}0.274{col 54}{space 4}-54234.55{col 67}{space 3} 15677.98
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 67368.63{col 26}{space 2} 11644.71{col 37}{space 1}    5.79{col 46}{space 3}0.000{col 54}{space 4} 44060.02{col 67}{space 3} 90677.24
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1692.216{col 26}{space 2} 864.2867{col 37}{space 1}   -1.96{col 46}{space 3}0.055{col 54}{space 4}-3422.214{col 67}{space 3} 37.78095
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 12370.73{col 26}{space 2} 14318.61{col 37}{space 1}    0.86{col 46}{space 3}0.391{col 54}{space 4}-16290.07{col 67}{space 3} 41031.53
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-10.14945{col 26}{space 2} 10.78255{col 37}{space 1}   -0.94{col 46}{space 3}0.350{col 54}{space 4}-31.73231{col 67}{space 3} 11.43341
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-143.5529{col 26}{space 2} 1042.722{col 37}{space 1}   -0.14{col 46}{space 3}0.891{col 54}{space 4}-2230.715{col 67}{space 3}  1943.61
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 644403.2{col 26}{space 2} 53633.89{col 37}{space 1}   12.01{col 46}{space 3}0.000{col 54}{space 4} 537047.1{col 67}{space 3} 751759.4
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        60
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     58.10
{txt}{col 49}        avg{col 67}= {res}     58.10
{txt}{col 49}        max{col 67}= {res}     58.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   58.1{txt}){col 67}= {res}      6.68
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-25802.28{col 26}{space 2} 13970.56{col 37}{space 1}   -1.85{col 46}{space 3}0.070{col 54}{space 4}-53766.41{col 67}{space 3} 2161.855
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 49042.94{col 26}{space 2} 9315.477{col 37}{space 1}    5.26{col 46}{space 3}0.000{col 54}{space 4} 30396.64{col 67}{space 3} 67689.24
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-220.2254{col 26}{space 2} 691.4076{col 37}{space 1}   -0.32{col 46}{space 3}0.751{col 54}{space 4} -1604.18{col 67}{space 3} 1163.729
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 4188.807{col 26}{space 2} 11454.53{col 37}{space 1}    0.37{col 46}{space 3}0.716{col 54}{space 4}-18739.12{col 67}{space 3} 27116.73
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-7.221013{col 26}{space 2} 8.625767{col 37}{space 1}   -0.84{col 46}{space 3}0.406{col 54}{space 4}-24.48676{col 67}{space 3} 10.04473
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-533.7752{col 26}{space 2} 834.1516{col 37}{space 1}   -0.64{col 46}{space 3}0.525{col 54}{space 4}-2203.453{col 67}{space 3} 1135.902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 459145.2{col 26}{space 2} 42905.76{col 37}{space 1}   10.70{col 46}{space 3}0.000{col 54}{space 4}   373263{col 67}{space 3} 545027.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. *********************WHITES******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final2==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        96
{txt}{hline 13}{c +}{hline 34}   F(5, 90)        = {res}    15.23
{txt}       Model {c |} {res} 6.2304e+11         5  1.2461e+11   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 7.3638e+11        90  8.1820e+09   {txt}R-squared       ={res}    0.4583
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4282
{txt}       Total {c |} {res} 1.3594e+12        95  1.4310e+10   {txt}Root MSE        =   {res}  90454

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  36935.9{col 26}{space 2} 23384.43{col 37}{space 1}    1.58{col 46}{space 3}0.118{col 67}{space 3} .1545142
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 154541.6{col 26}{space 2} 18762.92{col 37}{space 1}    8.24{col 46}{space 3}0.000{col 67}{space 3}  .642401
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-3036.631{col 26}{space 2} 1328.884{col 37}{space 1}   -2.29{col 46}{space 3}0.025{col 67}{space 3}-.2206126
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-22200.74{col 26}{space 2} 22898.86{col 37}{space 1}   -0.97{col 46}{space 3}0.335{col 67}{space 3}-.0807843
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-21.74411{col 26}{space 2} 15.55393{col 37}{space 1}   -1.40{col 46}{space 3}0.166{col 67}{space 3}-.1164381
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1089158{col 26}{space 2} 72275.55{col 37}{space 1}   15.07{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final2==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        96
{txt}{hline 13}{c +}{hline 34}   F(5, 90)        = {res}    16.81
{txt}       Model {c |} {res} 1.7791e+11         5  3.5583e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.9053e+11        90  2.1170e+09   {txt}R-squared       ={res}    0.4829
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4542
{txt}       Total {c |} {res} 3.6844e+11        95  3.8783e+09   {txt}Root MSE        =   {res}  46011

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 10928.11{col 26}{space 2} 11894.75{col 37}{space 1}    0.92{col 46}{space 3}0.361{col 67}{space 3} .0878125
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 81283.99{col 26}{space 2} 9543.962{col 37}{space 1}    8.52{col 46}{space 3}0.000{col 67}{space 3} .6490196
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2188.609{col 26}{space 2} 675.9516{col 37}{space 1}   -3.24{col 46}{space 3}0.002{col 67}{space 3}-.3054207
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-16145.85{col 26}{space 2} 11647.76{col 37}{space 1}   -1.39{col 46}{space 3}0.169{col 67}{space 3}-.1128528
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-5.240479{col 26}{space 2} 7.911678{col 37}{space 1}   -0.66{col 46}{space 3}0.509{col 67}{space 3}-.0539034
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   658156{col 26}{space 2} 36763.75{col 37}{space 1}   17.90{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final2==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        96
{txt}{hline 13}{c +}{hline 34}   F(5, 90)        = {res}    10.53
{txt}       Model {c |} {res} 1.1295e+11         5  2.2590e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.9303e+11        90  2.1448e+09   {txt}R-squared       ={res}    0.3691
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3341
{txt}       Total {c |} {res} 3.0598e+11        95  3.2209e+09   {txt}Root MSE        =   {res}  46312

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 19078.97{col 26}{space 2} 11972.69{col 37}{space 1}    1.59{col 46}{space 3}0.115{col 67}{space 3} .1682292
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 63837.46{col 26}{space 2} 9606.497{col 37}{space 1}    6.65{col 46}{space 3}0.000{col 67}{space 3} .5593237
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1128.973{col 26}{space 2} 680.3806{col 37}{space 1}   -1.66{col 46}{space 3}0.101{col 67}{space 3}-.1728816
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-10440.53{col 26}{space 2} 11724.08{col 37}{space 1}   -0.89{col 46}{space 3}0.376{col 67}{space 3}-.0800772
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.48675{col 26}{space 2} 7.963517{col 37}{space 1}   -1.82{col 46}{space 3}0.072{col 67}{space 3}-.1635126
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 430236.8{col 26}{space 2} 37004.64{col 37}{space 1}   11.63{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        89
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     87.07
{txt}{col 49}        avg{col 67}= {res}     87.07
{txt}{col 49}        max{col 67}= {res}     87.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   87.1{txt}){col 67}= {res}     12.67
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 37683.42{col 26}{space 2} 23497.87{col 37}{space 1}    1.60{col 46}{space 3}0.112{col 54}{space 4}-9020.638{col 67}{space 3} 84387.48
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 156078.6{col 26}{space 2} 18995.17{col 37}{space 1}    8.22{col 46}{space 3}0.000{col 54}{space 4}   118324{col 67}{space 3} 193833.2
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2965.146{col 26}{space 2}  1338.63{col 37}{space 1}   -2.22{col 46}{space 3}0.029{col 54}{space 4}-5625.791{col 67}{space 3}-304.5011
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-22204.51{col 26}{space 2} 22978.84{col 37}{space 1}   -0.97{col 46}{space 3}0.337{col 54}{space 4}-67876.95{col 67}{space 3} 23467.94
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-20.45648{col 26}{space 2}  15.7494{col 37}{space 1}   -1.30{col 46}{space 3}0.197{col 54}{space 4}-51.75978{col 67}{space 3} 10.84682
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 906.4527{col 26}{space 2} 1480.988{col 37}{space 1}    0.61{col 46}{space 3}0.542{col 54}{space 4}-2037.141{col 67}{space 3} 3850.047
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1052869{col 26}{space 2} 93678.05{col 37}{space 1}   11.24{col 46}{space 3}0.000{col 54}{space 4} 866675.9{col 67}{space 3}  1239062
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        89
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     87.07
{txt}{col 49}        avg{col 67}= {res}     87.07
{txt}{col 49}        max{col 67}= {res}     87.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   87.1{txt}){col 67}= {res}     14.16
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 11529.27{col 26}{space 2} 11914.66{col 37}{space 1}    0.97{col 46}{space 3}0.336{col 54}{space 4}-12152.16{col 67}{space 3} 35210.71
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 82520.07{col 26}{space 2} 9631.559{col 37}{space 1}    8.57{col 46}{space 3}0.000{col 54}{space 4} 63376.51{col 67}{space 3} 101663.6
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -2131.12{col 26}{space 2} 678.7566{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-3480.208{col 67}{space 3}-782.0324
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-16148.88{col 26}{space 2} 11651.49{col 37}{space 1}   -1.39{col 46}{space 3}0.169{col 54}{space 4}-39307.23{col 67}{space 3} 7009.471
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-4.204952{col 26}{space 2} 7.985778{col 37}{space 1}   -0.53{col 46}{space 3}0.600{col 54}{space 4}-20.07738{col 67}{space 3} 11.66748
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 728.9773{col 26}{space 2} 750.9396{col 37}{space 1}    0.97{col 46}{space 3}0.334{col 54}{space 4}-763.5808{col 67}{space 3} 2221.535
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 628972.2{col 26}{space 2} 47499.74{col 37}{space 1}   13.24{col 46}{space 3}0.000{col 54}{space 4} 534562.3{col 67}{space 3}   723382
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        89
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     87.07
{txt}{col 49}        avg{col 67}= {res}     87.07
{txt}{col 49}        max{col 67}= {res}     87.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   87.1{txt}){col 67}= {res}      8.72
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 19318.45{col 26}{space 2} 12046.16{col 37}{space 1}    1.60{col 46}{space 3}0.112{col 54}{space 4}-4624.338{col 67}{space 3} 43261.24
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 64329.87{col 26}{space 2} 9737.857{col 37}{space 1}    6.61{col 46}{space 3}0.000{col 54}{space 4} 44975.03{col 67}{space 3} 83684.71
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1106.071{col 26}{space 2} 686.2476{col 37}{space 1}   -1.61{col 46}{space 3}0.111{col 54}{space 4}-2470.048{col 67}{space 3}  257.906
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-10441.73{col 26}{space 2} 11780.08{col 37}{space 1}   -0.89{col 46}{space 3}0.378{col 54}{space 4}-33855.67{col 67}{space 3}  12972.2
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.07423{col 26}{space 2} 8.073913{col 37}{space 1}   -1.74{col 46}{space 3}0.085{col 54}{space 4}-30.12184{col 67}{space 3} 1.973374
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 290.4027{col 26}{space 2} 759.2273{col 37}{space 1}    0.38{col 46}{space 3}0.703{col 54}{space 4}-1218.628{col 67}{space 3} 1799.433
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 418610.9{col 26}{space 2} 48023.96{col 37}{space 1}    8.72{col 46}{space 3}0.000{col 54}{space 4}   323159{col 67}{space 3} 514062.7
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //INTERACTION BY Race//
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       154
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    152.04
{txt}{col 49}        avg{col 67}= {res}    152.04
{txt}{col 49}        max{col 67}= {res}    152.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  152.0{txt}){col 67}= {res}     19.06
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}  36693.3{col 28}{space 2} 20278.95{col 39}{space 1}    1.81{col 48}{space 3}0.072{col 56}{space 4}-3371.617{col 69}{space 3} 76758.21
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 73467.43{col 28}{space 2}  58477.9{col 39}{space 1}    1.26{col 48}{space 3}0.211{col 56}{space 4}-42066.77{col 69}{space 3} 189001.6
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-71312.76{col 28}{space 2} 29121.38{col 39}{space 1}   -2.45{col 48}{space 3}0.015{col 56}{space 4}-128847.6{col 69}{space 3}-13777.94
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 143536.7{col 28}{space 2} 13837.57{col 39}{space 1}   10.37{col 48}{space 3}0.000{col 56}{space 4} 116197.9{col 69}{space 3} 170875.4
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2589.868{col 28}{space 2} 931.8439{col 39}{space 1}   -2.78{col 48}{space 3}0.006{col 56}{space 4}-4430.902{col 69}{space 3}-748.8332
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2977.234{col 28}{space 2} 16582.18{col 39}{space 1}   -0.18{col 48}{space 3}0.858{col 56}{space 4}-35738.48{col 69}{space 3} 29784.01
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-18.59111{col 28}{space 2}  11.7497{col 39}{space 1}   -1.58{col 48}{space 3}0.116{col 56}{space 4}-41.80487{col 69}{space 3} 4.622653
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 624.4931{col 28}{space 2} 1087.021{col 39}{space 1}    0.57{col 48}{space 3}0.566{col 56}{space 4}-1523.124{col 69}{space 3}  2772.11
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1035233{col 28}{space 2} 67534.25{col 39}{space 1}   15.33{col 48}{space 3}0.000{col 56}{space 4} 901805.9{col 69}{space 3}  1168659
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       154
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    152.04
{txt}{col 49}        avg{col 67}= {res}    152.04
{txt}{col 49}        max{col 67}= {res}    152.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  152.0{txt}){col 67}= {res}     21.29
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 13587.68{col 28}{space 2}  10822.1{col 39}{space 1}    1.26{col 48}{space 3}0.211{col 56}{space 4}-7793.433{col 69}{space 3} 34968.79
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 11213.37{col 28}{space 2} 31207.42{col 39}{space 1}    0.36{col 48}{space 3}0.720{col 56}{space 4}-50442.81{col 69}{space 3} 72869.55
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-29092.64{col 28}{space 2} 15540.97{col 39}{space 1}   -1.87{col 48}{space 3}0.063{col 56}{space 4}-59796.77{col 69}{space 3} 1611.492
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}  76011.7{col 28}{space 2} 7384.581{col 39}{space 1}   10.29{col 48}{space 3}0.000{col 56}{space 4} 61422.05{col 69}{space 3} 90601.34
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2146.187{col 28}{space 2} 497.2894{col 39}{space 1}   -4.32{col 48}{space 3}0.000{col 56}{space 4}-3128.677{col 69}{space 3}-1163.698
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4286.465{col 28}{space 2} 8849.275{col 39}{space 1}   -0.48{col 48}{space 3}0.629{col 56}{space 4}-21769.89{col 69}{space 3} 13196.96
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-5.781934{col 28}{space 2} 6.270364{col 39}{space 1}   -0.92{col 48}{space 3}0.358{col 56}{space 4}-18.17023{col 69}{space 3} 6.606361
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 465.6944{col 28}{space 2} 580.1016{col 39}{space 1}    0.80{col 48}{space 3}0.423{col 56}{space 4}-680.4065{col 69}{space 3} 1611.795
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 630464.8{col 28}{space 2} 36040.44{col 39}{space 1}   17.49{col 48}{space 3}0.000{col 56}{space 4} 559260.1{col 69}{space 3} 701669.5
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       154
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    152.04
{txt}{col 49}        avg{col 67}= {res}    152.04
{txt}{col 49}        max{col 67}= {res}    152.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  152.0{txt}){col 67}= {res}     12.18
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 16950.31{col 28}{space 2} 10078.56{col 39}{space 1}    1.68{col 48}{space 3}0.095{col 56}{space 4}-2961.794{col 69}{space 3} 36862.41
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 49877.78{col 28}{space 2} 29063.28{col 39}{space 1}    1.72{col 48}{space 3}0.088{col 56}{space 4}-7542.246{col 69}{space 3} 107297.8
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-34996.86{col 28}{space 2} 14473.21{col 39}{space 1}   -2.42{col 48}{space 3}0.017{col 56}{space 4}-63591.43{col 69}{space 3}-6402.284
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}  57896.3{col 28}{space 2} 6877.216{col 39}{space 1}    8.42{col 48}{space 3}0.000{col 56}{space 4} 44309.05{col 69}{space 3} 71483.55
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-820.1522{col 28}{space 2} 463.1226{col 39}{space 1}   -1.77{col 48}{space 3}0.079{col 56}{space 4}-1735.139{col 69}{space 3} 94.83448
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4197.588{col 28}{space 2} 8241.276{col 39}{space 1}   -0.51{col 48}{space 3}0.611{col 56}{space 4} -20479.8{col 69}{space 3} 12084.62
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-10.63332{col 28}{space 2} 5.839552{col 39}{space 1}   -1.82{col 48}{space 3}0.071{col 56}{space 4}-22.17046{col 69}{space 3} .9038298
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 149.8669{col 28}{space 2} 540.2451{col 39}{space 1}    0.28{col 48}{space 3}0.782{col 56}{space 4}  -917.49{col 69}{space 3} 1217.224
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 408724.3{col 28}{space 2} 33564.25{col 39}{space 1}   12.18{col 48}{space 3}0.000{col 56}{space 4} 342411.7{col 69}{space 3} 475036.8
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. *********************LnNFLw1, MODELS 3-6***************************
. 
. ***********MODEL 3: MODEL 2+w1dxDiabetes w1Glucose******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0071
{txt}{col 49}Largest FMI{col 67}= {res}    0.0363
{txt}{col 49}Complete DF{col 67}= {res}        58
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     53.40
{txt}{col 49}        avg{col 67}= {res}     55.40
{txt}{col 49}        max{col 67}= {res}     56.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   56.1{txt}){col 67}= {res}      7.83
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} -61943.6{col 26}{space 2} 31030.69{col 37}{space 1}   -2.00{col 46}{space 3}0.051{col 54}{space 4}-124117.7{col 67}{space 3} 230.5021
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}   123800{col 26}{space 2} 19957.13{col 37}{space 1}    6.20{col 46}{space 3}0.000{col 54}{space 4} 83817.01{col 67}{space 3}   163783
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-443.8861{col 26}{space 2} 1551.018{col 37}{space 1}   -0.29{col 46}{space 3}0.776{col 54}{space 4}-3551.667{col 67}{space 3} 2663.895
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 25807.18{col 26}{space 2} 24196.46{col 37}{space 1}    1.07{col 46}{space 3}0.291{col 54}{space 4}   -22664{col 67}{space 3} 74278.36
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -25.4918{col 26}{space 2} 18.35983{col 37}{space 1}   -1.39{col 46}{space 3}0.170{col 54}{space 4}-62.27053{col 67}{space 3} 11.28692
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-1082.537{col 26}{space 2} 1786.633{col 37}{space 1}   -0.61{col 46}{space 3}0.547{col 54}{space 4}-4662.221{col 67}{space 3} 2497.146
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-37423.12{col 26}{space 2} 18383.94{col 37}{space 1}   -2.04{col 46}{space 3}0.047{col 54}{space 4}-74290.21{col 67}{space 3}-556.0278
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 729.5367{col 26}{space 2} 524.7431{col 37}{space 1}    1.39{col 46}{space 3}0.170{col 54}{space 4}-321.9134{col 67}{space 3} 1780.987
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1057558{col 26}{space 2}  99755.4{col 37}{space 1}   10.60{col 46}{space 3}0.000{col 54}{space 4} 857691.6{col 67}{space 3}  1257424
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0085
{txt}{col 49}Largest FMI{col 67}= {res}    0.0362
{txt}{col 49}Complete DF{col 67}= {res}        58
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     53.41
{txt}{col 49}        avg{col 67}= {res}     55.02
{txt}{col 49}        max{col 67}= {res}     55.95
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   56.0{txt}){col 67}= {res}      8.20
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-30685.32{col 26}{space 2} 17842.84{col 37}{space 1}   -1.72{col 46}{space 3}0.091{col 54}{space 4}-66451.53{col 67}{space 3} 5080.884
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 65372.02{col 26}{space 2} 11427.31{col 37}{space 1}    5.72{col 46}{space 3}0.000{col 54}{space 4} 42474.86{col 67}{space 3} 88269.18
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-974.3995{col 26}{space 2}  891.576{col 37}{space 1}   -1.09{col 46}{space 3}0.279{col 54}{space 4} -2761.62{col 67}{space 3}  812.821
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 13592.17{col 26}{space 2} 13829.45{col 37}{space 1}    0.98{col 46}{space 3}0.330{col 54}{space 4}-14112.36{col 67}{space 3}  41296.7
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-13.71368{col 26}{space 2} 10.49293{col 37}{space 1}   -1.31{col 46}{space 3}0.197{col 54}{space 4}-34.73392{col 67}{space 3} 7.306556
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-521.4301{col 26}{space 2} 1024.922{col 37}{space 1}   -0.51{col 46}{space 3}0.613{col 54}{space 4}-2575.506{col 67}{space 3} 1532.646
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-26608.04{col 26}{space 2} 10495.67{col 37}{space 1}   -2.54{col 46}{space 3}0.014{col 54}{space 4}-47655.96{col 67}{space 3}-5560.128
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 500.2632{col 26}{space 2} 300.3416{col 37}{space 1}    1.67{col 46}{space 3}0.101{col 54}{space 4}-101.6279{col 67}{space 3} 1102.154
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 614079.8{col 26}{space 2} 56920.15{col 37}{space 1}   10.79{col 46}{space 3}0.000{col 54}{space 4} 500042.8{col 67}{space 3} 728116.9
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0096
{txt}{col 49}Largest FMI{col 67}= {res}    0.0736
{txt}{col 49}Complete DF{col 67}= {res}        58
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     49.26
{txt}{col 49}        avg{col 67}= {res}     55.02
{txt}{col 49}        max{col 67}= {res}     56.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   56.0{txt}){col 67}= {res}      5.19
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-30465.83{col 26}{space 2} 14678.18{col 37}{space 1}   -2.08{col 46}{space 3}0.043{col 54}{space 4}-59870.02{col 67}{space 3}-1061.643
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 48124.38{col 26}{space 2} 9455.137{col 37}{space 1}    5.09{col 46}{space 3}0.000{col 54}{space 4} 29183.42{col 67}{space 3} 67065.35
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 83.44471{col 26}{space 2} 734.1653{col 37}{space 1}    0.11{col 46}{space 3}0.910{col 54}{space 4}-1387.371{col 67}{space 3} 1554.261
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 4639.091{col 26}{space 2} 11480.23{col 37}{space 1}    0.40{col 46}{space 3}0.688{col 54}{space 4}-18357.91{col 67}{space 3} 27636.09
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.739882{col 26}{space 2} 8.714447{col 37}{space 1}   -1.00{col 46}{space 3}0.320{col 54}{space 4}-26.19667{col 67}{space 3} 8.716908
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-694.7576{col 26}{space 2} 845.3516{col 37}{space 1}   -0.82{col 46}{space 3}0.415{col 54}{space 4} -2388.21{col 67}{space 3} 998.6953
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-11549.27{col 26}{space 2} 8889.165{col 37}{space 1}   -1.30{col 46}{space 3}0.200{col 54}{space 4}-29410.36{col 67}{space 3} 6311.831
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 233.7962{col 26}{space 2} 250.5585{col 37}{space 1}    0.93{col 46}{space 3}0.355{col 54}{space 4}-268.4482{col 67}{space 3} 736.0405
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 444278.4{col 26}{space 2} 47363.65{col 37}{space 1}    9.38{col 46}{space 3}0.000{col 54}{space 4} 349381.6{col 67}{space 3} 539175.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        87
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     85.07
{txt}{col 49}        avg{col 67}= {res}     85.07
{txt}{col 49}        max{col 67}= {res}     85.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   85.1{txt}){col 67}= {res}     10.03
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 49475.79{col 26}{space 2} 25761.54{col 37}{space 1}    1.92{col 46}{space 3}0.058{col 54}{space 4}-1744.479{col 67}{space 3} 100696.1
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 154680.2{col 26}{space 2}  19476.5{col 37}{space 1}    7.94{col 46}{space 3}0.000{col 54}{space 4} 115956.1{col 67}{space 3} 193404.2
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-3331.719{col 26}{space 2} 1345.772{col 37}{space 1}   -2.48{col 46}{space 3}0.015{col 54}{space 4}-6007.444{col 67}{space 3}-655.9944
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-22622.22{col 26}{space 2} 23105.69{col 37}{space 1}   -0.98{col 46}{space 3}0.330{col 54}{space 4}   -68562{col 67}{space 3} 23317.55
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-19.58588{col 26}{space 2} 16.11335{col 37}{space 1}   -1.22{col 46}{space 3}0.228{col 54}{space 4}-51.62316{col 67}{space 3} 12.45141
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 930.4501{col 26}{space 2}  1535.89{col 37}{space 1}    0.61{col 46}{space 3}0.546{col 54}{space 4}-2123.277{col 67}{space 3} 3984.177
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 29858.82{col 26}{space 2} 19869.56{col 37}{space 1}    1.50{col 46}{space 3}0.137{col 54}{space 4} -9646.74{col 67}{space 3} 69364.39
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-742.8502{col 26}{space 2} 433.8912{col 37}{space 1}   -1.71{col 46}{space 3}0.091{col 54}{space 4}-1605.532{col 67}{space 3}  119.832
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1109938{col 26}{space 2} 99703.82{col 37}{space 1}   11.13{col 46}{space 3}0.000{col 54}{space 4} 911702.7{col 67}{space 3}  1308174
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        87
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     85.07
{txt}{col 49}        avg{col 67}= {res}     85.07
{txt}{col 49}        max{col 67}= {res}     85.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   85.1{txt}){col 67}= {res}     10.91
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 14670.81{col 26}{space 2} 13135.44{col 37}{space 1}    1.12{col 46}{space 3}0.267{col 54}{space 4}-11445.68{col 67}{space 3} 40787.29
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 81027.71{col 26}{space 2} 9930.789{col 37}{space 1}    8.16{col 46}{space 3}0.000{col 54}{space 4} 61282.87{col 67}{space 3} 100772.6
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2275.088{col 26}{space 2} 686.1898{col 37}{space 1}   -3.32{col 46}{space 3}0.001{col 54}{space 4}-3639.401{col 67}{space 3} -910.774
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-17011.11{col 26}{space 2} 11781.26{col 37}{space 1}   -1.44{col 46}{space 3}0.152{col 54}{space 4}-40435.14{col 67}{space 3} 6412.921
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-3.109263{col 26}{space 2} 8.215965{col 37}{space 1}   -0.38{col 46}{space 3}0.706{col 54}{space 4}-19.44462{col 67}{space 3} 13.22609
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 653.5217{col 26}{space 2} 783.1284{col 37}{space 1}    0.83{col 46}{space 3}0.406{col 54}{space 4}-903.5297{col 67}{space 3} 2210.573
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}  14283.9{col 26}{space 2}  10131.2{col 37}{space 1}    1.41{col 46}{space 3}0.162{col 54}{space 4}-5859.422{col 67}{space 3} 34427.22
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}  -279.41{col 26}{space 2} 221.2349{col 37}{space 1}   -1.26{col 46}{space 3}0.210{col 54}{space 4}-719.2793{col 67}{space 3} 160.4593
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 655429.7{col 26}{space 2} 50837.55{col 37}{space 1}   12.89{col 46}{space 3}0.000{col 54}{space 4} 554352.2{col 67}{space 3} 756507.2
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        87
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     85.07
{txt}{col 49}        avg{col 67}= {res}     85.07
{txt}{col 49}        max{col 67}= {res}     85.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   85.1{txt}){col 67}= {res}      6.82
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 25509.33{col 26}{space 2} 13284.09{col 37}{space 1}    1.92{col 46}{space 3}0.058{col 54}{space 4}-902.6908{col 67}{space 3} 51921.36
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 64467.48{col 26}{space 2} 10043.17{col 37}{space 1}    6.42{col 46}{space 3}0.000{col 54}{space 4}  44499.2{col 67}{space 3} 84435.77
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1262.466{col 26}{space 2} 693.9549{col 37}{space 1}   -1.82{col 46}{space 3}0.072{col 54}{space 4}-2642.219{col 67}{space 3} 117.2869
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-10076.42{col 26}{space 2} 11914.58{col 37}{space 1}   -0.85{col 46}{space 3}0.400{col 54}{space 4}-33765.53{col 67}{space 3} 13612.69
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -14.2896{col 26}{space 2} 8.308939{col 37}{space 1}   -1.72{col 46}{space 3}0.089{col 54}{space 4}-30.80981{col 67}{space 3} 2.230606
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 366.7196{col 26}{space 2} 791.9905{col 37}{space 1}    0.46{col 46}{space 3}0.645{col 54}{space 4}-1207.952{col 67}{space 3} 1941.391
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}  10748.2{col 26}{space 2} 10245.85{col 37}{space 1}    1.05{col 46}{space 3}0.297{col 54}{space 4}-9623.066{col 67}{space 3} 31119.47
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-326.5327{col 26}{space 2} 223.7385{col 37}{space 1}   -1.46{col 46}{space 3}0.148{col 54}{space 4}-771.3797{col 67}{space 3} 118.3143
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 439810.4{col 26}{space 2} 51412.84{col 37}{space 1}    8.55{col 46}{space 3}0.000{col 54}{space 4}   337589{col 67}{space 3} 542031.7
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. //INTERACTION BY Race//
. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0054
{txt}{col 49}Largest FMI{col 67}= {res}    0.0579
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    127.72
{txt}{col 49}        avg{col 67}= {res}    147.30
{txt}{col 49}        max{col 67}= {res}    150.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  150.0{txt}){col 67}= {res}     15.05
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 41806.46{col 28}{space 2} 21866.89{col 39}{space 1}    1.91{col 48}{space 3}0.058{col 56}{space 4} -1400.52{col 69}{space 3} 85013.45
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 82916.29{col 28}{space 2} 60725.05{col 39}{space 1}    1.37{col 48}{space 3}0.174{col 56}{space 4}-37070.49{col 69}{space 3} 202903.1
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-76426.11{col 28}{space 2} 30382.38{col 39}{space 1}   -2.52{col 48}{space 3}0.013{col 56}{space 4}-136458.7{col 69}{space 3} -16393.5
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 145088.1{col 28}{space 2} 14163.62{col 39}{space 1}   10.24{col 48}{space 3}0.000{col 56}{space 4} 117102.1{col 69}{space 3} 173074.1
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2638.286{col 28}{space 2} 957.6928{col 39}{space 1}   -2.75{col 48}{space 3}0.007{col 56}{space 4}-4530.629{col 69}{space 3}-745.9426
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2082.951{col 28}{space 2} 16749.11{col 39}{space 1}   -0.12{col 48}{space 3}0.901{col 56}{space 4}-35177.56{col 69}{space 3} 31011.66
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-19.44834{col 28}{space 2} 12.00078{col 39}{space 1}   -1.62{col 48}{space 3}0.107{col 56}{space 4}-43.16087{col 69}{space 3} 4.264189
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 775.4037{col 28}{space 2} 1119.379{col 39}{space 1}    0.69{col 48}{space 3}0.490{col 56}{space 4}-1436.383{col 69}{space 3}  2987.19
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} 1016.993{col 28}{space 2} 13938.63{col 39}{space 1}    0.07{col 48}{space 3}0.942{col 56}{space 4}-26563.53{col 69}{space 3} 28597.52
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2}-183.8945{col 28}{space 2}  336.992{col 39}{space 1}   -0.55{col 48}{space 3}0.586{col 56}{space 4}-849.9866{col 69}{space 3} 482.1976
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1039263{col 28}{space 2} 71616.81{col 39}{space 1}   14.51{col 48}{space 3}0.000{col 56}{space 4} 897747.3{col 69}{space 3}  1180779
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0021
{txt}{col 49}Largest FMI{col 67}= {res}    0.0225
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    144.24
{txt}{col 49}        avg{col 67}= {res}    149.29
{txt}{col 49}        max{col 67}= {res}    150.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  150.0{txt}){col 67}= {res}     16.85
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 14067.36{col 28}{space 2} 11671.94{col 39}{space 1}    1.21{col 48}{space 3}0.230{col 56}{space 4}-8995.269{col 69}{space 3} 37129.98
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}  13999.9{col 28}{space 2} 32417.48{col 39}{space 1}    0.43{col 48}{space 3}0.666{col 56}{space 4}-50053.84{col 69}{space 3} 78053.65
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-30448.67{col 28}{space 2} 16219.84{col 39}{space 1}   -1.88{col 48}{space 3}0.062{col 56}{space 4}-62497.49{col 69}{space 3} 1600.146
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 76638.25{col 28}{space 2} 7561.371{col 39}{space 1}   10.14{col 48}{space 3}0.000{col 56}{space 4} 61697.68{col 69}{space 3} 91578.82
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2101.411{col 28}{space 2} 510.9212{col 39}{space 1}   -4.11{col 48}{space 3}0.000{col 56}{space 4}-3110.948{col 69}{space 3}-1091.874
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3881.497{col 28}{space 2}  8941.28{col 39}{space 1}   -0.43{col 48}{space 3}0.665{col 56}{space 4}-21548.59{col 69}{space 3} 13785.59
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-6.396021{col 28}{space 2} 6.404912{col 39}{space 1}   -1.00{col 48}{space 3}0.320{col 56}{space 4}-19.05152{col 69}{space 3}  6.25948
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 514.7808{col 28}{space 2} 597.6083{col 39}{space 1}    0.86{col 48}{space 3}0.390{col 56}{space 4} -666.037{col 69}{space 3} 1695.599
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-3748.086{col 28}{space 2} 7311.868{col 39}{space 1}   -0.51{col 48}{space 3}0.609{col 56}{space 4}-18200.34{col 69}{space 3} 10704.17
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 22.31214{col 28}{space 2} 178.6164{col 39}{space 1}    0.12{col 48}{space 3}0.901{col 56}{space 4}-330.6482{col 69}{space 3} 375.2725
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 624903.8{col 28}{space 2} 38172.91{col 39}{space 1}   16.37{col 48}{space 3}0.000{col 56}{space 4} 549476.1{col 69}{space 3} 700331.4
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0072
{txt}{col 49}Largest FMI{col 67}= {res}    0.0771
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    116.97
{txt}{col 49}        avg{col 67}= {res}    145.96
{txt}{col 49}        max{col 67}= {res}    150.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  150.0{txt}){col 67}= {res}      9.63
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}  19787.3{col 28}{space 2} 10864.97{col 39}{space 1}    1.82{col 48}{space 3}0.071{col 56}{space 4}-1680.942{col 69}{space 3} 41255.54
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 54447.78{col 28}{space 2} 30169.98{col 39}{space 1}    1.80{col 48}{space 3}0.073{col 56}{space 4}-5165.188{col 69}{space 3} 114060.8
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-37520.91{col 28}{space 2} 15094.71{col 39}{space 1}   -2.49{col 48}{space 3}0.014{col 56}{space 4}-67346.59{col 69}{space 3}-7695.237
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 58593.04{col 28}{space 2} 7036.647{col 39}{space 1}    8.33{col 48}{space 3}0.000{col 56}{space 4} 44689.28{col 69}{space 3}  72496.8
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-864.2824{col 28}{space 2} 476.0225{col 39}{space 1}   -1.82{col 48}{space 3}0.071{col 56}{space 4}-1804.883{col 69}{space 3} 76.31824
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3814.806{col 28}{space 2} 8321.411{col 39}{space 1}   -0.46{col 48}{space 3}0.647{col 56}{space 4}-20257.11{col 69}{space 3}  12627.5
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-10.92344{col 28}{space 2} 5.963049{col 39}{space 1}   -1.83{col 48}{space 3}0.069{col 56}{space 4}-22.70595{col 69}{space 3} .8590756
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 221.6768{col 28}{space 2} 556.1149{col 39}{space 1}    0.40{col 48}{space 3}0.691{col 56}{space 4}-877.1534{col 69}{space 3} 1320.507
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} 1896.456{col 28}{space 2} 6991.863{col 39}{space 1}    0.27{col 48}{space 3}0.787{col 56}{space 4} -11950.6{col 69}{space 3} 15743.51
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2}-115.6844{col 28}{space 2} 168.1079{col 39}{space 1}   -0.69{col 48}{space 3}0.492{col 56}{space 4}-448.0292{col 69}{space 3} 216.6604
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 413013.6{col 28}{space 2}  35611.8{col 39}{space 1}   11.60{col 48}{space 3}0.000{col 56}{space 4} 342642.6{col 69}{space 3} 483384.5
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 4: MODEL 2+liver/kidney disease******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0962
{txt}{col 49}Largest FMI{col 67}= {res}    0.5728
{txt}{col 49}Complete DF{col 67}= {res}        55
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      9.66
{txt}{col 49}        avg{col 67}= {res}     45.66
{txt}{col 49}        max{col 67}= {res}     52.81
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   51.9{txt}){col 67}= {res}      5.14
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-49824.75{col 26}{space 2} 31399.62{col 37}{space 1}   -1.59{col 46}{space 3}0.119{col 54}{space 4}-112899.9{col 67}{space 3} 13250.45
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 164291.5{col 26}{space 2} 29634.85{col 37}{space 1}    5.54{col 46}{space 3}0.000{col 54}{space 4} 103595.5{col 67}{space 3} 224987.6
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-729.9707{col 26}{space 2} 1703.983{col 37}{space 1}   -0.43{col 46}{space 3}0.670{col 54}{space 4}-4150.663{col 67}{space 3} 2690.722
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 26646.28{col 26}{space 2}    24986{col 37}{space 1}    1.07{col 46}{space 3}0.291{col 54}{space 4}-23479.79{col 67}{space 3} 76772.34
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-21.83751{col 26}{space 2} 19.12328{col 37}{space 1}   -1.14{col 46}{space 3}0.259{col 54}{space 4}-60.21663{col 67}{space 3} 16.54161
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 934.1542{col 26}{space 2} 2041.212{col 37}{space 1}    0.46{col 46}{space 3}0.649{col 54}{space 4}-3174.545{col 67}{space 3} 5042.854
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-53047.46{col 26}{space 2} 65853.52{col 37}{space 1}   -0.81{col 46}{space 3}0.440{col 54}{space 4}-200479.6{col 67}{space 3} 94384.69
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-104133.1{col 26}{space 2}  1598456{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4} -3311056{col 67}{space 3}  3102789
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 329.6467{col 26}{space 2} 3645.869{col 37}{space 1}    0.09{col 46}{space 3}0.928{col 54}{space 4}-6995.835{col 67}{space 3} 7655.128
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 675.0058{col 26}{space 2} 544.4606{col 37}{space 1}    1.24{col 46}{space 3}0.221{col 54}{space 4}-417.5344{col 67}{space 3} 1767.546
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} -12651.6{col 26}{space 2}  8896.29{col 37}{space 1}   -1.42{col 46}{space 3}0.161{col 54}{space 4} -30496.8{col 67}{space 3} 5193.598
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1150550{col 26}{space 2}  1626638{col 37}{space 1}    0.71{col 46}{space 3}0.482{col 54}{space 4} -2112771{col 67}{space 3}  4413872
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0711
{txt}{col 49}Largest FMI{col 67}= {res}    0.5086
{txt}{col 49}Complete DF{col 67}= {res}        55
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     11.74
{txt}{col 49}        avg{col 67}= {res}     47.25
{txt}{col 49}        max{col 67}= {res}     53.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   52.3{txt}){col 67}= {res}      4.97
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-23879.41{col 26}{space 2} 18229.34{col 37}{space 1}   -1.31{col 46}{space 3}0.196{col 54}{space 4}-60458.63{col 67}{space 3} 12699.81
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 84792.38{col 26}{space 2} 16880.21{col 37}{space 1}    5.02{col 46}{space 3}0.000{col 54}{space 4} 50497.27{col 67}{space 3} 119087.5
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -1407.89{col 26}{space 2} 996.7196{col 37}{space 1}   -1.41{col 46}{space 3}0.164{col 54}{space 4}-3407.949{col 67}{space 3} 592.1677
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 14975.89{col 26}{space 2}  14685.9{col 37}{space 1}    1.02{col 46}{space 3}0.313{col 54}{space 4} -14485.5{col 67}{space 3} 44437.28
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-11.34445{col 26}{space 2} 11.17961{col 37}{space 1}   -1.01{col 46}{space 3}0.315{col 54}{space 4}-33.77241{col 67}{space 3}  11.0835
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 427.4122{col 26}{space 2} 1180.185{col 37}{space 1}    0.36{col 46}{space 3}0.719{col 54}{space 4} -1943.32{col 67}{space 3} 2798.144
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-12065.59{col 26}{space 2}  36509.7{col 37}{space 1}   -0.33{col 46}{space 3}0.747{col 54}{space 4}-91808.46{col 67}{space 3} 67677.28
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-279319.9{col 26}{space 2}   935943{col 37}{space 1}   -0.30{col 46}{space 3}0.767{col 54}{space 4} -2156599{col 67}{space 3}  1597959
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 1255.811{col 26}{space 2} 2127.442{col 37}{space 1}    0.59{col 46}{space 3}0.558{col 54}{space 4} -3015.54{col 67}{space 3} 5527.162
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 385.0384{col 26}{space 2} 319.3351{col 37}{space 1}    1.21{col 46}{space 3}0.233{col 54}{space 4}-255.6381{col 67}{space 3} 1025.715
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-7518.923{col 26}{space 2} 5231.532{col 37}{space 1}   -1.44{col 46}{space 3}0.157{col 54}{space 4}-18012.86{col 67}{space 3} 2975.009
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   891530{col 26}{space 2} 953003.5{col 37}{space 1}    0.94{col 46}{space 3}0.354{col 54}{space 4} -1019955{col 67}{space 3}  2803015
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.1133
{txt}{col 49}Largest FMI{col 67}= {res}    0.6008
{txt}{col 49}Complete DF{col 67}= {res}        55
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      8.88
{txt}{col 49}        avg{col 67}= {res}     44.67
{txt}{col 49}        max{col 67}= {res}     52.66
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   51.6{txt}){col 67}= {res}      3.64
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0007

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-26322.43{col 26}{space 2} 14796.14{col 37}{space 1}   -1.78{col 46}{space 3}0.082{col 54}{space 4}-56076.09{col 67}{space 3}  3431.23
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}    65664{col 26}{space 2} 13933.72{col 37}{space 1}    4.71{col 46}{space 3}0.000{col 54}{space 4} 37067.81{col 67}{space 3} 94260.19
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 8.911254{col 26}{space 2} 799.6669{col 37}{space 1}    0.01{col 46}{space 3}0.991{col 54}{space 4}-1597.188{col 67}{space 3}  1615.01
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 4641.422{col 26}{space 2} 11684.51{col 37}{space 1}    0.40{col 46}{space 3}0.693{col 54}{space 4} -18802.5{col 67}{space 3} 28085.35
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-7.722172{col 26}{space 2} 8.983771{col 37}{space 1}   -0.86{col 46}{space 3}0.394{col 54}{space 4}-25.76152{col 67}{space 3} 10.31718
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 153.6543{col 26}{space 2} 962.5297{col 37}{space 1}    0.16{col 46}{space 3}0.874{col 54}{space 4}-1786.788{col 67}{space 3} 2094.097
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-32483.48{col 26}{space 2} 31620.95{col 37}{space 1}   -1.03{col 46}{space 3}0.331{col 54}{space 4}-104160.7{col 67}{space 3} 39193.72
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-31919.44{col 26}{space 2} 749390.9{col 37}{space 1}   -0.04{col 46}{space 3}0.966{col 54}{space 4} -1535848{col 67}{space 3}  1472009
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 84.31624{col 26}{space 2} 1705.993{col 37}{space 1}    0.05{col 46}{space 3}0.961{col 54}{space 4}-3344.423{col 67}{space 3} 3513.056
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 250.3045{col 26}{space 2} 255.6615{col 37}{space 1}    0.98{col 46}{space 3}0.332{col 54}{space 4}-262.9619{col 67}{space 3}  763.571
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-4347.335{col 26}{space 2} 4156.816{col 37}{space 1}   -1.05{col 46}{space 3}0.300{col 54}{space 4} -12686.1{col 67}{space 3} 3991.432
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 473245.2{col 26}{space 2} 762194.7{col 37}{space 1}    0.62{col 46}{space 3}0.537{col 54}{space 4} -1056244{col 67}{space 3}  2002734
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0181
{txt}{col 49}Largest FMI{col 67}= {res}    0.1864
{txt}{col 49}Complete DF{col 67}= {res}        84
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     45.47
{txt}{col 49}        avg{col 67}= {res}     77.80
{txt}{col 49}        max{col 67}= {res}     82.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   81.9{txt}){col 67}= {res}      7.98
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 30142.67{col 26}{space 2} 23860.22{col 37}{space 1}    1.26{col 46}{space 3}0.210{col 54}{space 4}-17325.97{col 67}{space 3}  77611.3
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 180319.3{col 26}{space 2} 25399.18{col 37}{space 1}    7.10{col 46}{space 3}0.000{col 54}{space 4} 129732.1{col 67}{space 3} 230906.5
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2531.676{col 26}{space 2} 1347.454{col 37}{space 1}   -1.88{col 46}{space 3}0.064{col 54}{space 4}-5212.192{col 67}{space 3} 148.8398
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-22403.29{col 26}{space 2} 22830.76{col 37}{space 1}   -0.98{col 46}{space 3}0.329{col 54}{space 4}-67821.54{col 67}{space 3} 23014.95
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-26.29061{col 26}{space 2} 15.84411{col 37}{space 1}   -1.66{col 46}{space 3}0.101{col 54}{space 4}-57.81123{col 67}{space 3} 5.230008
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 2272.531{col 26}{space 2} 1629.786{col 37}{space 1}    1.39{col 46}{space 3}0.167{col 54}{space 4}-969.6446{col 67}{space 3} 5514.707
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 15377.81{col 26}{space 2} 61370.97{col 37}{space 1}    0.25{col 46}{space 3}0.803{col 54}{space 4}-108194.6{col 67}{space 3} 138950.3
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}  2089916{col 26}{space 2}  1886126{col 37}{space 1}    1.11{col 46}{space 3}0.271{col 54}{space 4} -1663094{col 67}{space 3}  5842927
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-37.85673{col 26}{space 2} 2713.422{col 37}{space 1}   -0.01{col 46}{space 3}0.989{col 54}{space 4}-5440.064{col 67}{space 3}  5364.35
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 173.9681{col 26}{space 2} 441.9396{col 37}{space 1}    0.39{col 46}{space 3}0.695{col 54}{space 4}-705.2214{col 67}{space 3} 1053.158
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-21222.07{col 26}{space 2}  7949.64{col 37}{space 1}   -2.67{col 46}{space 3}0.009{col 54}{space 4}-37036.65{col 67}{space 3}-5407.479
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -1056648{col 26}{space 2}  1892394{col 37}{space 1}   -0.56{col 46}{space 3}0.578{col 54}{space 4} -4822175{col 67}{space 3}  2708879
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0297
{txt}{col 49}Largest FMI{col 67}= {res}    0.2785
{txt}{col 49}Complete DF{col 67}= {res}        84
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     31.19
{txt}{col 49}        avg{col 67}= {res}     76.37
{txt}{col 49}        max{col 67}= {res}     82.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   81.7{txt}){col 67}= {res}      8.31
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 7752.371{col 26}{space 2} 12264.94{col 37}{space 1}    0.63{col 46}{space 3}0.529{col 54}{space 4}-16649.26{col 67}{space 3}    32154
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 91750.68{col 26}{space 2} 13115.96{col 37}{space 1}    7.00{col 46}{space 3}0.000{col 54}{space 4} 65614.37{col 67}{space 3}   117887
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2035.129{col 26}{space 2} 691.8287{col 37}{space 1}   -2.94{col 46}{space 3}0.004{col 54}{space 4}-3411.402{col 67}{space 3}-658.8553
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-16617.22{col 26}{space 2} 11712.74{col 37}{space 1}   -1.42{col 46}{space 3}0.160{col 54}{space 4} -39917.4{col 67}{space 3}  6682.96
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-6.982421{col 26}{space 2} 8.138851{col 37}{space 1}   -0.86{col 46}{space 3}0.393{col 54}{space 4}-23.17439{col 67}{space 3} 9.209551
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  1252.81{col 26}{space 2} 837.3853{col 37}{space 1}    1.50{col 46}{space 3}0.138{col 54}{space 4}-413.0679{col 67}{space 3} 2918.689
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 11411.06{col 26}{space 2} 33152.67{col 37}{space 1}    0.34{col 46}{space 3}0.733{col 54}{space 4}-56187.29{col 67}{space 3} 79009.42
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}   981817{col 26}{space 2}   964099{col 37}{space 1}    1.02{col 46}{space 3}0.312{col 54}{space 4}-936206.3{col 67}{space 3}  2899840
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 184.2143{col 26}{space 2} 1398.793{col 37}{space 1}    0.13{col 46}{space 3}0.896{col 54}{space 4}-2601.529{col 67}{space 3} 2969.958
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 194.6267{col 26}{space 2} 227.1485{col 37}{space 1}    0.86{col 46}{space 3}0.394{col 54}{space 4}-257.2789{col 67}{space 3} 646.5323
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-8999.576{col 26}{space 2}  4086.36{col 37}{space 1}   -2.20{col 46}{space 3}0.030{col 54}{space 4}-17129.12{col 67}{space 3}-870.0354
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-369792.7{col 26}{space 2} 967331.2{col 37}{space 1}   -0.38{col 46}{space 3}0.703{col 54}{space 4} -2294266{col 67}{space 3}  1554681
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0042
{txt}{col 49}Largest FMI{col 67}= {res}    0.0401
{txt}{col 49}Complete DF{col 67}= {res}        84
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     76.75
{txt}{col 49}        avg{col 67}= {res}     81.44
{txt}{col 49}        max{col 67}= {res}     82.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   82.0{txt}){col 67}= {res}      5.70
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 16374.43{col 26}{space 2} 12278.85{col 37}{space 1}    1.33{col 46}{space 3}0.186{col 54}{space 4}-8052.393{col 67}{space 3} 40801.26
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  78937.9{col 26}{space 2} 12855.84{col 37}{space 1}    6.14{col 46}{space 3}0.000{col 54}{space 4} 53360.95{col 67}{space 3} 104514.8
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-841.4639{col 26}{space 2}  694.276{col 37}{space 1}   -1.21{col 46}{space 3}0.229{col 54}{space 4}-2222.585{col 67}{space 3} 539.6569
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-9746.673{col 26}{space 2} 11758.71{col 37}{space 1}   -0.83{col 46}{space 3}0.410{col 54}{space 4}-33138.22{col 67}{space 3} 13644.88
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-16.24007{col 26}{space 2} 8.152351{col 37}{space 1}   -1.99{col 46}{space 3}0.050{col 54}{space 4}-32.45762{col 67}{space 3}-.0225216
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1071.983{col 26}{space 2} 839.8222{col 37}{space 1}    1.28{col 46}{space 3}0.205{col 54}{space 4}-598.6829{col 67}{space 3}  2742.65
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-85.69677{col 26}{space 2} 29370.41{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-58572.74{col 67}{space 3} 58401.34
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 703866.5{col 26}{space 2} 967930.2{col 37}{space 1}    0.73{col 46}{space 3}0.469{col 54}{space 4} -1221778{col 67}{space 3}  2629511
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-115.6474{col 26}{space 2} 1378.024{col 37}{space 1}   -0.08{col 46}{space 3}0.933{col 54}{space 4}-2857.072{col 67}{space 3} 2625.777
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 35.58694{col 26}{space 2} 227.7228{col 37}{space 1}    0.16{col 46}{space 3}0.876{col 54}{space 4}-417.4385{col 67}{space 3} 488.6124
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-10623.85{col 26}{space 2} 4094.695{col 37}{space 1}   -2.59{col 46}{space 3}0.011{col 54}{space 4}-18769.43{col 67}{space 3}-2478.257
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-289152.9{col 26}{space 2} 970890.6{col 37}{space 1}   -0.30{col 46}{space 3}0.767{col 54}{space 4} -2220686{col 67}{space 3}  1642381
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. **INTERACTION BY Race**
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0230
{txt}{col 49}Largest FMI{col 67}= {res}    0.2458
{txt}{col 49}Complete DF{col 67}= {res}       149
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     46.78
{txt}{col 49}        avg{col 67}= {res}    137.66
{txt}{col 49}        max{col 67}= {res}    146.90
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  146.6{txt}){col 67}= {res}     12.82
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 29995.01{col 28}{space 2} 20426.11{col 39}{space 1}    1.47{col 48}{space 3}0.144{col 56}{space 4}-10372.37{col 69}{space 3} 70362.39
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 58571.42{col 28}{space 2} 59116.31{col 39}{space 1}    0.99{col 48}{space 3}0.323{col 56}{space 4}-58261.26{col 69}{space 3} 175404.1
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-60183.01{col 28}{space 2} 29267.78{col 39}{space 1}   -2.06{col 48}{space 3}0.042{col 56}{space 4}-118024.6{col 69}{space 3}-2341.387
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 174758.6{col 28}{space 2} 18078.33{col 39}{space 1}    9.67{col 48}{space 3}0.000{col 56}{space 4} 138990.9{col 69}{space 3} 210526.3
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1996.521{col 28}{space 2} 962.6057{col 39}{space 1}   -2.07{col 48}{space 3}0.040{col 56}{space 4}-3898.886{col 69}{space 3}-94.15612
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2475.925{col 28}{space 2}  16443.8{col 39}{space 1}   -0.15{col 48}{space 3}0.881{col 56}{space 4} -34972.9{col 69}{space 3} 30021.05
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-18.74235{col 28}{space 2} 11.63173{col 39}{space 1}   -1.61{col 48}{space 3}0.109{col 56}{space 4}-41.73008{col 69}{space 3} 4.245374
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1974.567{col 28}{space 2} 1195.572{col 39}{space 1}    1.65{col 48}{space 3}0.101{col 56}{space 4}-388.3382{col 69}{space 3} 4337.472
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-31790.01{col 28}{space 2} 39045.76{col 39}{space 1}   -0.81{col 48}{space 3}0.420{col 56}{space 4}-110349.7{col 69}{space 3} 46769.67
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} 606742.9{col 28}{space 2}  1195742{col 39}{space 1}    0.51{col 48}{space 3}0.613{col 56}{space 4} -1756372{col 69}{space 3}  2969858
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2}  589.432{col 28}{space 2} 2081.898{col 39}{space 1}    0.28{col 48}{space 3}0.778{col 56}{space 4}-3526.754{col 69}{space 3} 4705.618
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 323.6457{col 28}{space 2} 331.1732{col 39}{space 1}    0.98{col 48}{space 3}0.330{col 56}{space 4}-330.8414{col 69}{space 3} 978.1328
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2} -16546.6{col 28}{space 2} 5819.676{col 39}{space 1}   -2.84{col 48}{space 3}0.005{col 56}{space 4}-28047.87{col 69}{space 3}-5045.333
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 402077.9{col 28}{space 2}  1203720{col 39}{space 1}    0.33{col 48}{space 3}0.739{col 56}{space 4} -1976802{col 69}{space 3}  2780958
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0155
{txt}{col 49}Largest FMI{col 67}= {res}    0.1860
{txt}{col 49}Complete DF{col 67}= {res}       149
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     64.06
{txt}{col 49}        avg{col 67}= {res}    139.54
{txt}{col 49}        max{col 67}= {res}    146.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  146.8{txt}){col 67}= {res}     14.00
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 9124.392{col 28}{space 2} 10972.53{col 39}{space 1}    0.83{col 48}{space 3}0.407{col 56}{space 4}-12560.23{col 69}{space 3} 30809.02
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 5769.944{col 28}{space 2} 31738.28{col 39}{space 1}    0.18{col 48}{space 3}0.856{col 56}{space 4}-56954.28{col 69}{space 3} 68494.17
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-24250.76{col 28}{space 2} 15710.37{col 39}{space 1}   -1.54{col 48}{space 3}0.125{col 56}{space 4}-55298.57{col 69}{space 3} 6797.044
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 89741.79{col 28}{space 2} 9654.391{col 39}{space 1}    9.30{col 48}{space 3}0.000{col 56}{space 4}  70648.3{col 69}{space 3} 108835.3
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1947.314{col 28}{space 2} 516.6682{col 39}{space 1}   -3.77{col 48}{space 3}0.000{col 56}{space 4}-2968.373{col 69}{space 3}-926.2555
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3883.555{col 28}{space 2}   8830.7{col 39}{space 1}   -0.44{col 48}{space 3}0.661{col 56}{space 4} -21335.1{col 69}{space 3} 13567.99
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-6.122703{col 28}{space 2} 6.242909{col 39}{space 1}   -0.98{col 48}{space 3}0.328{col 56}{space 4}-18.46032{col 69}{space 3} 6.214915
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1038.002{col 28}{space 2} 640.6469{col 39}{space 1}    1.62{col 48}{space 3}0.107{col 56}{space 4}-228.0894{col 69}{space 3} 2304.094
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-7361.502{col 28}{space 2} 20295.17{col 39}{space 1}   -0.36{col 48}{space 3}0.718{col 56}{space 4}-47904.98{col 69}{space 3} 33181.97
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}   249461{col 28}{space 2} 643839.8{col 39}{space 1}    0.39{col 48}{space 3}0.699{col 56}{space 4} -1023011{col 69}{space 3}  1521934
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 713.3689{col 28}{space 2} 1114.201{col 39}{space 1}    0.64{col 48}{space 3}0.523{col 56}{space 4}-1489.183{col 69}{space 3} 2915.921
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 266.7589{col 28}{space 2} 177.7682{col 39}{space 1}    1.50{col 48}{space 3}0.136{col 56}{space 4}-84.55407{col 69}{space 3} 618.0718
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-7886.115{col 28}{space 2} 3123.371{col 39}{space 1}   -2.52{col 48}{space 3}0.013{col 56}{space 4}-14058.64{col 69}{space 3}-1713.585
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 358168.6{col 28}{space 2} 648213.5{col 39}{space 1}    0.55{col 48}{space 3}0.581{col 56}{space 4}-922951.2{col 69}{space 3}  1639288
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0388
{txt}{col 49}Largest FMI{col 67}= {res}    0.3538
{txt}{col 49}Complete DF{col 67}= {res}       149
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     28.26
{txt}{col 49}        avg{col 67}= {res}    132.97
{txt}{col 49}        max{col 67}= {res}    146.80
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  146.1{txt}){col 67}= {res}      8.22
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}  14964.8{col 28}{space 2} 10207.86{col 39}{space 1}    1.47{col 48}{space 3}0.145{col 56}{space 4}-5209.578{col 69}{space 3} 35139.18
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 44256.65{col 28}{space 2} 29552.06{col 39}{space 1}    1.50{col 48}{space 3}0.136{col 56}{space 4}-14151.33{col 69}{space 3} 102664.6
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-30577.94{col 28}{space 2} 14621.32{col 39}{space 1}   -2.09{col 48}{space 3}0.038{col 56}{space 4}-59475.12{col 69}{space 3}-1680.761
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 73855.01{col 28}{space 2}   9178.2{col 39}{space 1}    8.05{col 48}{space 3}0.000{col 56}{space 4} 55665.96{col 69}{space 3} 92044.06
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-525.1406{col 28}{space 2} 481.5598{col 39}{space 1}   -1.09{col 48}{space 3}0.277{col 56}{space 4}-1476.902{col 69}{space 3}  426.621
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -3803.84{col 28}{space 2} 8202.206{col 39}{space 1}   -0.46{col 48}{space 3}0.644{col 56}{space 4} -20013.5{col 69}{space 3} 12405.82
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-10.49254{col 28}{space 2} 5.806542{col 39}{space 1}   -1.81{col 48}{space 3}0.073{col 56}{space 4}-21.96825{col 69}{space 3} .9831698
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}  846.371{col 28}{space 2} 599.6453{col 39}{space 1}    1.41{col 48}{space 3}0.160{col 56}{space 4}-338.9795{col 69}{space 3} 2031.722
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-22118.61{col 28}{space 2} 20773.59{col 39}{space 1}   -1.06{col 48}{space 3}0.296{col 56}{space 4} -64653.6{col 69}{space 3} 20416.37
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} 111963.9{col 28}{space 2} 600762.8{col 39}{space 1}    0.19{col 48}{space 3}0.852{col 56}{space 4} -1075565{col 69}{space 3}  1299492
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 141.2378{col 28}{space 2} 1051.551{col 39}{space 1}    0.13{col 48}{space 3}0.893{col 56}{space 4}-1939.515{col 69}{space 3} 2221.991
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 97.11619{col 28}{space 2} 165.3145{col 39}{space 1}    0.59{col 48}{space 3}0.558{col 56}{space 4}-229.5965{col 69}{space 3} 423.8289
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-7521.814{col 28}{space 2} 2906.351{col 39}{space 1}   -2.59{col 48}{space 3}0.011{col 56}{space 4}-13265.74{col 69}{space 3}-1777.888
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 291311.4{col 28}{space 2} 604732.7{col 39}{space 1}    0.48{col 48}{space 3}0.631{col 56}{space 4}-904060.7{col 69}{space 3}  1486683
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0265
{txt}{col 49}Largest FMI{col 67}= {res}    0.2720
{txt}{col 49}Complete DF{col 67}= {res}       150
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     41.19
{txt}{col 49}        avg{col 67}= {res}    137.16
{txt}{col 49}        max{col 67}= {res}    147.92
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  147.5{txt}){col 67}= {res}     13.21
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 9329.772{col 26}{space 2} 17979.31{col 37}{space 1}    0.52{col 46}{space 3}0.605{col 54}{space 4}-26200.16{col 67}{space 3}  44859.7
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}   176357{col 26}{space 2} 18297.14{col 37}{space 1}    9.64{col 46}{space 3}0.000{col 54}{space 4} 140151.7{col 67}{space 3} 212562.2
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -2023.82{col 26}{space 2} 972.2186{col 37}{space 1}   -2.08{col 46}{space 3}0.039{col 54}{space 4}-3945.052{col 67}{space 3}-102.5874
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-58786.47{col 26}{space 2} 15506.58{col 37}{space 1}   -3.79{col 46}{space 3}0.000{col 54}{space 4}-89434.87{col 67}{space 3}-28138.08
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-1655.043{col 26}{space 2} 16617.63{col 37}{space 1}   -0.10{col 46}{space 3}0.921{col 54}{space 4}-34493.78{col 67}{space 3} 31183.69
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-17.53062{col 26}{space 2}  11.7397{col 37}{space 1}   -1.49{col 46}{space 3}0.138{col 54}{space 4}-40.73034{col 67}{space 3} 5.669101
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 2238.811{col 26}{space 2} 1199.784{col 37}{space 1}    1.87{col 46}{space 3}0.064{col 54}{space 4}-132.2111{col 67}{space 3} 4609.833
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-25399.46{col 26}{space 2} 39853.81{col 37}{space 1}   -0.64{col 46}{space 3}0.527{col 54}{space 4}-105874.6{col 67}{space 3} 55075.71
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}   900230{col 26}{space 2}  1199887{col 37}{space 1}    0.75{col 46}{space 3}0.454{col 54}{space 4} -1470943{col 67}{space 3}  3271403
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 387.7648{col 26}{space 2} 2101.515{col 37}{space 1}    0.18{col 46}{space 3}0.854{col 54}{space 4}-3766.948{col 67}{space 3} 4542.477
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 287.6616{col 26}{space 2} 334.0214{col 37}{space 1}    0.86{col 46}{space 3}0.391{col 54}{space 4}-372.4086{col 67}{space 3} 947.7319
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-18119.04{col 26}{space 2} 5830.139{col 37}{space 1}   -3.11{col 46}{space 3}0.002{col 54}{space 4} -29640.3{col 67}{space 3}-6597.784
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 202246.3{col 26}{space 2}  1209076{col 37}{space 1}    0.17{col 46}{space 3}0.867{col 54}{space 4} -2187084{col 67}{space 3}  2591577
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0187
{txt}{col 49}Largest FMI{col 67}= {res}    0.2080
{txt}{col 49}Complete DF{col 67}= {res}       150
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     57.08
{txt}{col 49}        avg{col 67}= {res}    139.21
{txt}{col 49}        max{col 67}= {res}    148.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  147.7{txt}){col 67}= {res}     14.79
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 798.5513{col 26}{space 2} 9598.006{col 37}{space 1}    0.08{col 46}{space 3}0.934{col 54}{space 4}-18168.56{col 67}{space 3} 19765.66
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 90387.43{col 26}{space 2} 9704.484{col 37}{space 1}    9.31{col 46}{space 3}0.000{col 54}{space 4} 71193.97{col 67}{space 3} 109580.9
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1958.404{col 26}{space 2} 519.1432{col 37}{space 1}   -3.77{col 46}{space 3}0.000{col 54}{space 4}-2984.302{col 67}{space 3}-932.5055
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-41519.29{col 26}{space 2} 8255.397{col 37}{space 1}   -5.03{col 46}{space 3}0.000{col 54}{space 4}-57834.45{col 67}{space 3}-25204.12
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-3553.775{col 26}{space 2} 8870.033{col 37}{space 1}   -0.40{col 46}{space 3}0.689{col 54}{space 4}-21082.11{col 67}{space 3} 13974.56
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-5.633947{col 26}{space 2} 6.264717{col 37}{space 1}   -0.90{col 46}{space 3}0.370{col 54}{space 4}-18.01401{col 67}{space 3} 6.746118
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1144.569{col 26}{space 2} 639.8681{col 37}{space 1}    1.79{col 46}{space 3}0.076{col 54}{space 4}-119.9132{col 67}{space 3} 2409.052
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-4799.462{col 26}{space 2} 20527.23{col 37}{space 1}   -0.23{col 46}{space 3}0.816{col 54}{space 4}-45903.32{col 67}{space 3}  36304.4
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 367834.4{col 26}{space 2} 641723.4{col 37}{space 1}    0.57{col 46}{space 3}0.567{col 54}{space 4}-900362.5{col 67}{space 3}  1636031
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 632.0936{col 26}{space 2} 1117.588{col 37}{space 1}    0.57{col 46}{space 3}0.573{col 54}{space 4}-1576.995{col 67}{space 3} 2841.182
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 252.2629{col 26}{space 2} 178.2857{col 37}{space 1}    1.41{col 46}{space 3}0.159{col 54}{space 4}-100.0515{col 67}{space 3} 604.5773
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-8519.256{col 26}{space 2} 3110.897{col 37}{space 1}   -2.74{col 46}{space 3}0.007{col 54}{space 4} -14666.8{col 67}{space 3} -2371.71
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   295369{col 26}{space 2} 646698.1{col 37}{space 1}    0.46{col 46}{space 3}0.649{col 54}{space 4}-982661.5{col 67}{space 3}  1573399
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0408
{txt}{col 49}Largest FMI{col 67}= {res}    0.3628
{txt}{col 49}Complete DF{col 67}= {res}       150
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     27.25
{txt}{col 49}        avg{col 67}= {res}    132.74
{txt}{col 49}        max{col 67}= {res}    147.90
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  146.9{txt}){col 67}= {res}      8.35
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 4464.218{col 26}{space 2}  8979.07{col 37}{space 1}    0.50{col 46}{space 3}0.620{col 54}{space 4}-13280.18{col 67}{space 3} 22208.62
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 74665.15{col 26}{space 2} 9290.863{col 37}{space 1}    8.04{col 46}{space 3}0.000{col 54}{space 4} 56249.64{col 67}{space 3} 93080.65
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-538.9607{col 26}{space 2} 486.1341{col 37}{space 1}   -1.11{col 46}{space 3}0.269{col 54}{space 4}-1499.669{col 67}{space 3} 421.7477
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-15371.48{col 26}{space 2} 7767.688{col 37}{space 1}   -1.98{col 46}{space 3}0.050{col 54}{space 4}-30726.51{col 67}{space 3}-16.44161
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-3386.286{col 26}{space 2} 8289.729{col 37}{space 1}   -0.41{col 46}{space 3}0.684{col 54}{space 4} -19767.9{col 67}{space 3} 12995.33
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-9.877103{col 26}{space 2} 5.861904{col 37}{space 1}   -1.68{col 46}{space 3}0.094{col 54}{space 4}-21.46146{col 67}{space 3} 1.707255
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 980.5584{col 26}{space 2} 601.6489{col 37}{space 1}    1.63{col 46}{space 3}0.105{col 54}{space 4}-208.5959{col 67}{space 3} 2169.713
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-18858.63{col 26}{space 2} 21020.91{col 37}{space 1}   -0.90{col 46}{space 3}0.378{col 54}{space 4} -61971.5{col 67}{space 3} 24254.24
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 260981.5{col 26}{space 2} 602398.1{col 37}{space 1}    0.43{col 46}{space 3}0.665{col 54}{space 4}-929656.4{col 67}{space 3}  1451619
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 38.69651{col 26}{space 2}  1061.45{col 37}{space 1}    0.04{col 46}{space 3}0.971{col 54}{space 4}-2061.415{col 67}{space 3} 2138.808
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 78.82853{col 26}{space 2} 166.7606{col 37}{space 1}    0.47{col 46}{space 3}0.637{col 54}{space 4}-250.7164{col 67}{space 3} 408.3734
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-8321.065{col 26}{space 2} 2910.302{col 37}{space 1}   -2.86{col 46}{space 3}0.005{col 54}{space 4}-14072.33{col 67}{space 3}-2569.798
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 175379.4{col 26}{space 2} 606940.4{col 37}{space 1}    0.29{col 46}{space 3}0.773{col 54}{space 4} -1024231{col 67}{space 3}  1374989
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. ***********MODEL 5: MODEL2+OXIDATIVE STRESS******
. 
. //Overall//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0092
{txt}{col 49}Largest FMI{col 67}= {res}    0.0814
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    114.53
{txt}{col 49}        avg{col 67}= {res}    145.96
{txt}{col 49}        max{col 67}= {res}    149.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  149.9{txt}){col 67}= {res}     14.00
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 9013.723{col 26}{space 2} 18697.31{col 37}{space 1}    0.48{col 46}{space 3}0.630{col 54}{space 4}-27931.81{col 67}{space 3} 45959.26
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 146772.1{col 26}{space 2} 14541.23{col 37}{space 1}   10.09{col 46}{space 3}0.000{col 54}{space 4} 118039.9{col 67}{space 3} 175504.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2715.268{col 26}{space 2} 951.7821{col 37}{space 1}   -2.85{col 46}{space 3}0.005{col 54}{space 4}-4595.904{col 67}{space 3}-834.6326
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-63980.45{col 26}{space 2} 17291.97{col 37}{space 1}   -3.70{col 46}{space 3}0.000{col 54}{space 4}-98155.57{col 67}{space 3}-29805.34
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} -2068.22{col 26}{space 2} 17007.47{col 37}{space 1}   -0.12{col 46}{space 3}0.903{col 54}{space 4}-35673.61{col 67}{space 3} 31537.17
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.52147{col 26}{space 2} 12.31394{col 37}{space 1}   -1.26{col 46}{space 3}0.209{col 54}{space 4}-39.85294{col 67}{space 3} 8.810002
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 818.3685{col 26}{space 2} 1163.655{col 37}{space 1}    0.70{col 46}{space 3}0.483{col 54}{space 4}-1480.912{col 67}{space 3} 3117.649
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 363.5096{col 26}{space 2} 848.3177{col 37}{space 1}    0.43{col 46}{space 3}0.669{col 54}{space 4}-1316.917{col 67}{space 3} 2043.936
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}  4146.95{col 26}{space 2} 27996.37{col 37}{space 1}    0.15{col 46}{space 3}0.882{col 54}{space 4}-51171.24{col 67}{space 3} 59465.14
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-3822.918{col 26}{space 2} 3694.515{col 37}{space 1}   -1.03{col 46}{space 3}0.302{col 54}{space 4}-11124.26{col 67}{space 3} 3478.423
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1129953{col 26}{space 2} 156265.6{col 37}{space 1}    7.23{col 46}{space 3}0.000{col 54}{space 4} 821182.4{col 67}{space 3}  1438724
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0051
{txt}{col 49}Largest FMI{col 67}= {res}    0.0470
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    133.43
{txt}{col 49}        avg{col 67}= {res}    148.13
{txt}{col 49}        max{col 67}= {res}    150.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  150.0{txt}){col 67}= {res}     16.08
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  3638.36{col 26}{space 2} 9917.107{col 37}{space 1}    0.37{col 46}{space 3}0.714{col 54}{space 4}-15957.29{col 67}{space 3} 23234.01
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 76034.11{col 26}{space 2}   7717.9{col 37}{space 1}    9.85{col 46}{space 3}0.000{col 54}{space 4} 60784.26{col 67}{space 3} 91283.96
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2203.377{col 26}{space 2} 505.1962{col 37}{space 1}   -4.36{col 46}{space 3}0.000{col 54}{space 4}-3201.596{col 67}{space 3}-1205.158
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-44417.97{col 26}{space 2} 9143.202{col 37}{space 1}   -4.86{col 46}{space 3}0.000{col 54}{space 4}-62485.86{col 67}{space 3}-26350.08
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-4067.756{col 26}{space 2} 9025.853{col 37}{space 1}   -0.45{col 46}{space 3}0.653{col 54}{space 4}   -21902{col 67}{space 3} 13766.49
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-4.083533{col 26}{space 2} 6.535122{col 37}{space 1}   -0.62{col 46}{space 3}0.533{col 54}{space 4}-16.99639{col 67}{space 3} 8.829323
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 666.7024{col 26}{space 2} 617.6477{col 37}{space 1}    1.08{col 46}{space 3}0.282{col 54}{space 4}-553.7116{col 67}{space 3} 1887.116
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 80.63806{col 26}{space 2} 442.6836{col 37}{space 1}    0.18{col 46}{space 3}0.856{col 54}{space 4}-794.9473{col 67}{space 3} 956.2234
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}  9361.64{col 26}{space 2} 14861.93{col 37}{space 1}    0.63{col 46}{space 3}0.530{col 54}{space 4} -20004.1{col 67}{space 3} 38727.38
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-540.3312{col 26}{space 2} 1955.005{col 37}{space 1}   -0.28{col 46}{space 3}0.783{col 54}{space 4}-4403.561{col 67}{space 3} 3322.899
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 647893.9{col 26}{space 2} 82918.55{col 37}{space 1}    7.81{col 46}{space 3}0.000{col 54}{space 4} 484053.6{col 67}{space 3} 811734.3
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0089
{txt}{col 49}Largest FMI{col 67}= {res}    0.0719
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    119.93
{txt}{col 49}        avg{col 67}= {res}    146.31
{txt}{col 49}        max{col 67}= {res}    149.98
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  149.9{txt}){col 67}= {res}      9.01
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2527.272{col 26}{space 2} 9251.392{col 37}{space 1}    0.27{col 46}{space 3}0.785{col 54}{space 4}-15753.41{col 67}{space 3} 20807.95
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 59628.27{col 26}{space 2} 7195.808{col 37}{space 1}    8.29{col 46}{space 3}0.000{col 54}{space 4} 45409.88{col 67}{space 3} 73846.67
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-870.4763{col 26}{space 2}  470.915{col 37}{space 1}   -1.85{col 46}{space 3}0.067{col 54}{space 4}-1800.965{col 67}{space 3} 60.01255
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-16842.94{col 26}{space 2} 8554.551{col 37}{space 1}   -1.97{col 46}{space 3}0.051{col 54}{space 4}-33749.85{col 67}{space 3}  63.9739
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-3784.743{col 26}{space 2} 8414.742{col 37}{space 1}   -0.45{col 46}{space 3}0.654{col 54}{space 4}-20411.65{col 67}{space 3} 12842.16
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.704019{col 26}{space 2} 6.091559{col 37}{space 1}   -1.43{col 46}{space 3}0.155{col 54}{space 4}-20.74051{col 67}{space 3} 3.332472
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 251.6252{col 26}{space 2}  575.746{col 37}{space 1}    0.44{col 46}{space 3}0.663{col 54}{space 4}-886.0029{col 67}{space 3} 1389.253
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}  293.415{col 26}{space 2} 417.6322{col 37}{space 1}    0.70{col 46}{space 3}0.484{col 54}{space 4}-533.4725{col 67}{space 3} 1120.302
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 3791.806{col 26}{space 2} 13849.37{col 37}{space 1}    0.27{col 46}{space 3}0.785{col 54}{space 4}-23573.26{col 67}{space 3} 31156.88
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-2569.524{col 26}{space 2} 1830.713{col 37}{space 1}   -1.40{col 46}{space 3}0.163{col 54}{space 4}-6187.722{col 67}{space 3} 1048.675
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 431943.2{col 26}{space 2} 77302.47{col 37}{space 1}    5.59{col 46}{space 3}0.000{col 54}{space 4} 279198.3{col 67}{space 3} 584688.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. //AFRICAN-AMERICAN//
. 
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0210
{txt}{col 49}Largest FMI{col 67}= {res}    0.1804
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     35.18
{txt}{col 49}        avg{col 67}= {res}     52.89
{txt}{col 49}        max{col 67}= {res}     55.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   54.9{txt}){col 67}= {res}      5.93
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-46014.29{col 26}{space 2} 31233.76{col 37}{space 1}   -1.47{col 46}{space 3}0.146{col 54}{space 4}-108607.2{col 67}{space 3} 16578.65
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 124615.9{col 26}{space 2} 21158.68{col 37}{space 1}    5.89{col 46}{space 3}0.000{col 54}{space 4} 82211.94{col 67}{space 3} 167019.9
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -1543.87{col 26}{space 2} 1548.989{col 37}{space 1}   -1.00{col 46}{space 3}0.323{col 54}{space 4}-4648.562{col 67}{space 3} 1560.822
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 25582.69{col 26}{space 2} 25424.75{col 37}{space 1}    1.01{col 46}{space 3}0.319{col 54}{space 4}-25374.61{col 67}{space 3} 76539.99
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-16.89282{col 26}{space 2} 19.82835{col 37}{space 1}   -0.85{col 46}{space 3}0.398{col 54}{space 4}-56.63656{col 67}{space 3} 22.85092
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-218.4271{col 26}{space 2} 1906.219{col 37}{space 1}   -0.11{col 46}{space 3}0.909{col 54}{space 4}-4038.538{col 67}{space 3} 3601.684
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 667.2162{col 26}{space 2} 1744.458{col 37}{space 1}    0.38{col 46}{space 3}0.704{col 54}{space 4}-2873.571{col 67}{space 3} 4208.004
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 19440.14{col 26}{space 2} 37921.39{col 37}{space 1}    0.51{col 46}{space 3}0.610{col 54}{space 4}-56554.82{col 67}{space 3} 95435.09
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 1161.651{col 26}{space 2} 5734.914{col 37}{space 1}    0.20{col 46}{space 3}0.840{col 54}{space 4}-10331.54{col 67}{space 3} 12654.85
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 993513.3{col 26}{space 2} 210635.3{col 37}{space 1}    4.72{col 46}{space 3}0.000{col 54}{space 4} 571346.1{col 67}{space 3}  1415680
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0204
{txt}{col 49}Largest FMI{col 67}= {res}    0.1802
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     35.20
{txt}{col 49}        avg{col 67}= {res}     52.95
{txt}{col 49}        max{col 67}= {res}     55.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   54.9{txt}){col 67}= {res}      5.83
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-17606.41{col 26}{space 2} 18175.47{col 37}{space 1}   -0.97{col 46}{space 3}0.337{col 54}{space 4}-54033.54{col 67}{space 3} 18820.72
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 65177.13{col 26}{space 2} 12283.55{col 37}{space 1}    5.31{col 46}{space 3}0.000{col 54}{space 4} 40560.47{col 67}{space 3} 89793.78
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1735.747{col 26}{space 2} 898.3571{col 37}{space 1}   -1.93{col 46}{space 3}0.059{col 54}{space 4}-3536.201{col 67}{space 3} 64.70763
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 12530.94{col 26}{space 2} 14762.65{col 37}{space 1}    0.85{col 46}{space 3}0.400{col 54}{space 4}-17056.28{col 67}{space 3} 42118.16
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.488955{col 26}{space 2} 11.50955{col 37}{space 1}   -0.74{col 46}{space 3}0.464{col 54}{space 4}-31.55763{col 67}{space 3} 14.57972
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 78.35652{col 26}{space 2} 1107.157{col 37}{space 1}    0.07{col 46}{space 3}0.944{col 54}{space 4}  -2140.4{col 67}{space 3} 2297.113
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 2.192544{col 26}{space 2}  1013.41{col 37}{space 1}    0.00{col 46}{space 3}0.998{col 54}{space 4}-2054.718{col 67}{space 3} 2059.103
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 11239.81{col 26}{space 2} 22023.96{col 37}{space 1}    0.51{col 46}{space 3}0.612{col 54}{space 4} -32896.1{col 67}{space 3} 55375.73
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 2097.167{col 26}{space 2} 3329.146{col 37}{space 1}    0.63{col 46}{space 3}0.531{col 54}{space 4}-4574.474{col 67}{space 3} 8768.808
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 582787.7{col 26}{space 2}   122171{col 37}{space 1}    4.77{col 46}{space 3}0.000{col 54}{space 4}   337945{col 67}{space 3} 827630.4
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0086
{txt}{col 49}Largest FMI{col 67}= {res}    0.0564
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     50.41
{txt}{col 49}        avg{col 67}= {res}     54.39
{txt}{col 49}        max{col 67}= {res}     55.00
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   55.0{txt}){col 67}= {res}      4.34
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0003

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-26889.16{col 26}{space 2} 14503.24{col 37}{space 1}   -1.85{col 46}{space 3}0.069{col 54}{space 4}-55954.26{col 67}{space 3} 2175.945
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 48859.23{col 26}{space 2} 9832.541{col 37}{space 1}    4.97{col 46}{space 3}0.000{col 54}{space 4} 29152.85{col 67}{space 3} 68565.61
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-253.5619{col 26}{space 2} 719.5528{col 37}{space 1}   -0.35{col 46}{space 3}0.726{col 54}{space 4}-1695.841{col 67}{space 3} 1188.717
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 5139.255{col 26}{space 2} 11795.13{col 37}{space 1}    0.44{col 46}{space 3}0.665{col 54}{space 4}-18500.27{col 67}{space 3} 28778.78
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-5.456873{col 26}{space 2} 9.183667{col 37}{space 1}   -0.59{col 46}{space 3}0.555{col 54}{space 4}-23.86232{col 67}{space 3} 12.94858
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-419.7237{col 26}{space 2} 886.1261{col 37}{space 1}   -0.47{col 46}{space 3}0.638{col 54}{space 4}-2195.665{col 67}{space 3} 1356.217
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 519.8021{col 26}{space 2} 760.6414{col 37}{space 1}    0.68{col 46}{space 3}0.497{col 54}{space 4} -1007.68{col 67}{space 3} 2047.285
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 8668.108{col 26}{space 2} 17648.23{col 37}{space 1}    0.49{col 46}{space 3}0.625{col 54}{space 4}-26703.68{col 67}{space 3} 44039.89
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-579.2983{col 26}{space 2} 2661.724{col 37}{space 1}   -0.22{col 46}{space 3}0.829{col 54}{space 4}-5913.546{col 67}{space 3} 4754.949
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   410403{col 26}{space 2} 97739.74{col 37}{space 1}    4.20{col 46}{space 3}0.000{col 54}{space 4} 214511.6{col 67}{space 3} 606294.3
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0042
{txt}{col 49}Largest FMI{col 67}= {res}    0.0217
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     81.63
{txt}{col 49}        avg{col 67}= {res}     83.57
{txt}{col 49}        max{col 67}= {res}     84.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.0{txt}){col 67}= {res}      8.39
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 32471.13{col 26}{space 2} 24860.29{col 37}{space 1}    1.31{col 46}{space 3}0.195{col 54}{space 4}-16967.39{col 67}{space 3} 81909.65
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 157070.6{col 26}{space 2} 19964.87{col 37}{space 1}    7.87{col 46}{space 3}0.000{col 54}{space 4} 117368.7{col 67}{space 3} 196772.6
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2843.376{col 26}{space 2} 1356.466{col 37}{space 1}   -2.10{col 46}{space 3}0.039{col 54}{space 4}-5540.831{col 67}{space 3}-145.9199
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-22941.47{col 26}{space 2} 23272.35{col 37}{space 1}   -0.99{col 46}{space 3}0.327{col 54}{space 4}-69220.68{col 67}{space 3} 23337.74
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -17.8218{col 26}{space 2} 16.43184{col 37}{space 1}   -1.08{col 46}{space 3}0.281{col 54}{space 4}-50.49817{col 67}{space 3} 14.85457
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 834.4128{col 26}{space 2} 1580.507{col 37}{space 1}    0.53{col 46}{space 3}0.599{col 54}{space 4}-2308.592{col 67}{space 3} 3977.417
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}  233.602{col 26}{space 2} 994.8526{col 37}{space 1}    0.23{col 46}{space 3}0.815{col 54}{space 4} -1745.61{col 67}{space 3} 2212.814
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 5282.911{col 26}{space 2} 41082.72{col 37}{space 1}    0.13{col 46}{space 3}0.898{col 54}{space 4}-76413.88{col 67}{space 3} 86979.71
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} -5635.01{col 26}{space 2} 4916.487{col 37}{space 1}   -1.15{col 46}{space 3}0.255{col 54}{space 4}-15415.69{col 67}{space 3} 4145.672
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1041657{col 26}{space 2} 217248.5{col 37}{space 1}    4.79{col 46}{space 3}0.000{col 54}{space 4} 609636.4{col 67}{space 3}  1473677
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0044
{txt}{col 49}Largest FMI{col 67}= {res}    0.0322
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     79.97
{txt}{col 49}        avg{col 67}= {res}     83.51
{txt}{col 49}        max{col 67}= {res}     84.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.0{txt}){col 67}= {res}      9.26
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 10763.95{col 26}{space 2} 12634.42{col 37}{space 1}    0.85{col 46}{space 3}0.397{col 54}{space 4} -14361.4{col 67}{space 3} 35889.31
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 81091.05{col 26}{space 2} 10147.98{col 37}{space 1}    7.99{col 46}{space 3}0.000{col 54}{space 4}  60910.9{col 67}{space 3} 101271.2
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2083.392{col 26}{space 2}  689.503{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4}-3454.533{col 67}{space 3}-712.2511
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -16964.6{col 26}{space 2} 11828.54{col 37}{space 1}   -1.43{col 46}{space 3}0.155{col 54}{space 4} -40486.7{col 67}{space 3} 6557.494
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-2.259523{col 26}{space 2}  8.35207{col 37}{space 1}   -0.27{col 46}{space 3}0.787{col 54}{space 4}-18.86845{col 67}{space 3}  14.3494
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 870.8156{col 26}{space 2} 803.5006{col 37}{space 1}    1.08{col 46}{space 3}0.282{col 54}{space 4}-727.0385{col 67}{space 3}  2468.67
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 102.4313{col 26}{space 2}  508.283{col 37}{space 1}    0.20{col 46}{space 3}0.841{col 54}{space 4}-909.0899{col 67}{space 3} 1113.953
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 14843.93{col 26}{space 2} 20881.34{col 37}{space 1}    0.71{col 46}{space 3}0.479{col 54}{space 4}-26680.51{col 67}{space 3} 56368.37
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-1764.918{col 26}{space 2} 2488.774{col 37}{space 1}   -0.71{col 46}{space 3}0.480{col 54}{space 4} -6715.03{col 67}{space 3} 3185.194
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 561062.2{col 26}{space 2} 110431.7{col 37}{space 1}    5.08{col 46}{space 3}0.000{col 54}{space 4} 341457.5{col 67}{space 3} 780666.8
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0059
{txt}{col 49}Largest FMI{col 67}= {res}    0.0333
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     79.78
{txt}{col 49}        avg{col 67}= {res}     83.31
{txt}{col 49}        max{col 67}= {res}     84.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.0{txt}){col 67}= {res}      5.89
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 16270.18{col 26}{space 2}  12722.1{col 37}{space 1}    1.28{col 46}{space 3}0.204{col 54}{space 4}-9030.111{col 67}{space 3} 41570.48
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 64558.91{col 26}{space 2} 10213.04{col 37}{space 1}    6.32{col 46}{space 3}0.000{col 54}{space 4} 44249.27{col 67}{space 3} 84868.55
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1031.465{col 26}{space 2} 693.8498{col 37}{space 1}   -1.49{col 46}{space 3}0.141{col 54}{space 4}-2411.252{col 67}{space 3}  348.322
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-10951.73{col 26}{space 2} 11903.95{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-34623.88{col 67}{space 3} 12720.41
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-12.23015{col 26}{space 2} 8.406126{col 37}{space 1}   -1.45{col 46}{space 3}0.149{col 54}{space 4}-28.94668{col 67}{space 3} 4.486386
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 293.8149{col 26}{space 2} 808.4839{col 37}{space 1}    0.36{col 46}{space 3}0.717{col 54}{space 4}-1313.947{col 67}{space 3} 1901.577
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 194.6783{col 26}{space 2} 511.7412{col 37}{space 1}    0.38{col 46}{space 3}0.705{col 54}{space 4}-823.7613{col 67}{space 3} 1213.118
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 5758.979{col 26}{space 2} 21015.08{col 37}{space 1}    0.27{col 46}{space 3}0.785{col 54}{space 4} -36031.6{col 67}{space 3} 47549.56
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-3155.345{col 26}{space 2}  2518.73{col 37}{space 1}   -1.25{col 46}{space 3}0.214{col 54}{space 4}-8166.459{col 67}{space 3}  1855.77
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   396943{col 26}{space 2} 111132.4{col 37}{space 1}    3.57{col 46}{space 3}0.001{col 54}{space 4} 175944.4{col 67}{space 3} 617941.7
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. **********INTERACTION BY Race***************
. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0093
{txt}{col 49}Largest FMI{col 67}= {res}    0.0909
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    108.59
{txt}{col 49}        avg{col 67}= {res}    145.22
{txt}{col 49}        max{col 67}= {res}    148.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  148.9{txt}){col 67}= {res}     13.64
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 33568.55{col 28}{space 2} 21057.76{col 39}{space 1}    1.59{col 48}{space 3}0.113{col 56}{space 4}-8043.332{col 69}{space 3} 75180.43
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 72951.51{col 28}{space 2} 59414.79{col 39}{space 1}    1.23{col 48}{space 3}0.221{col 56}{space 4}-44454.17{col 69}{space 3} 190357.2
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-70663.89{col 28}{space 2} 29379.13{col 39}{space 1}   -2.41{col 48}{space 3}0.017{col 56}{space 4}-128717.5{col 69}{space 3} -12610.3
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 144326.8{col 28}{space 2} 14353.53{col 39}{space 1}   10.06{col 48}{space 3}0.000{col 56}{space 4} 115963.9{col 69}{space 3} 172689.7
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2545.783{col 28}{space 2} 939.7172{col 39}{space 1}   -2.71{col 48}{space 3}0.008{col 56}{space 4}-4402.678{col 69}{space 3}-688.8875
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3375.578{col 28}{space 2} 16754.04{col 39}{space 1}   -0.20{col 48}{space 3}0.841{col 56}{space 4}-36481.99{col 69}{space 3} 29730.84
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-17.20944{col 28}{space 2} 12.14644{col 39}{space 1}   -1.42{col 48}{space 3}0.159{col 56}{space 4} -41.2113{col 69}{space 3} 6.792406
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 607.7382{col 28}{space 2} 1149.078{col 39}{space 1}    0.53{col 48}{space 3}0.598{col 56}{space 4}-1662.863{col 69}{space 3} 2878.339
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 282.7104{col 28}{space 2} 840.3174{col 39}{space 1}    0.34{col 48}{space 3}0.737{col 56}{space 4}-1382.841{col 69}{space 3} 1948.262
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 7778.125{col 28}{space 2} 27607.03{col 39}{space 1}    0.28{col 48}{space 3}0.779{col 56}{space 4}-46773.76{col 69}{space 3}    62330
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-3605.605{col 28}{space 2} 3639.552{col 39}{space 1}   -0.99{col 48}{space 3}0.323{col 56}{space 4}-10798.77{col 69}{space 3} 3587.563
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1005830{col 28}{space 2} 151750.8{col 39}{space 1}    6.63{col 48}{space 3}0.000{col 56}{space 4} 705965.2{col 69}{space 3}  1305694
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0051
{txt}{col 49}Largest FMI{col 67}= {res}    0.0520
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    130.04
{txt}{col 49}        avg{col 67}= {res}    147.24
{txt}{col 49}        max{col 67}= {res}    149.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}     15.18
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 13911.75{col 28}{space 2} 11251.03{col 39}{space 1}    1.24{col 48}{space 3}0.218{col 56}{space 4}-8320.853{col 69}{space 3} 36144.35
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 12870.64{col 28}{space 2} 31756.43{col 39}{space 1}    0.41{col 48}{space 3}0.686{col 56}{space 4}-49880.67{col 69}{space 3} 75621.94
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-29564.11{col 28}{space 2} 15708.01{col 39}{space 1}   -1.88{col 48}{space 3}0.062{col 56}{space 4} -60603.3{col 69}{space 3} 1475.082
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 75011.04{col 28}{space 2}  7673.42{col 39}{space 1}    9.78{col 48}{space 3}0.000{col 56}{space 4} 59848.25{col 69}{space 3} 90173.83
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2132.469{col 28}{space 2} 502.4252{col 39}{space 1}   -4.24{col 48}{space 3}0.000{col 56}{space 4}-3125.267{col 69}{space 3}-1139.671
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4614.757{col 28}{space 2} 8955.882{col 39}{space 1}   -0.52{col 48}{space 3}0.607{col 56}{space 4}-22311.71{col 69}{space 3}  13082.2
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-4.789839{col 28}{space 2} 6.492531{col 39}{space 1}   -0.74{col 48}{space 3}0.462{col 56}{space 4}-17.61926{col 69}{space 3} 8.039577
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}  578.575{col 28}{space 2} 614.3367{col 39}{space 1}    0.94{col 48}{space 3}0.348{col 56}{space 4}-635.3632{col 69}{space 3} 1792.513
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2}  46.7823{col 28}{space 2} 440.6738{col 39}{space 1}    0.11{col 48}{space 3}0.916{col 56}{space 4}-825.0354{col 69}{space 3}    918.6
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 10880.96{col 28}{space 2} 14761.42{col 39}{space 1}    0.74{col 48}{space 3}0.462{col 56}{space 4}-18287.79{col 69}{space 3} 40049.71
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} -449.416{col 28}{space 2} 1939.562{col 39}{space 1}   -0.23{col 48}{space 3}0.817{col 56}{space 4}-4282.346{col 69}{space 3} 3383.514
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 578314.3{col 28}{space 2} 81115.26{col 39}{space 1}    7.13{col 48}{space 3}0.000{col 56}{space 4}   418029{col 69}{space 3} 738599.5
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0088
{txt}{col 49}Largest FMI{col 67}= {res}    0.0788
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    115.40
{txt}{col 49}        avg{col 67}= {res}    145.65
{txt}{col 49}        max{col 67}= {res}    148.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  148.9{txt}){col 67}= {res}      8.95
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 14500.78{col 28}{space 2} 10423.13{col 39}{space 1}    1.39{col 48}{space 3}0.166{col 56}{space 4}-6096.234{col 69}{space 3} 35097.79
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 49931.84{col 28}{space 2} 29417.47{col 39}{space 1}    1.70{col 48}{space 3}0.092{col 56}{space 4}-8198.507{col 69}{space 3} 108062.2
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-34458.64{col 28}{space 2} 14543.62{col 39}{space 1}   -2.37{col 48}{space 3}0.019{col 56}{space 4}-63197.15{col 69}{space 3}-5720.129
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 58435.88{col 28}{space 2} 7106.768{col 39}{space 1}    8.22{col 48}{space 3}0.000{col 56}{space 4} 44392.66{col 69}{space 3} 72479.11
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -787.826{col 28}{space 2} 465.1763{col 39}{space 1}   -1.69{col 48}{space 3}0.092{col 56}{space 4}-1707.024{col 69}{space 3} 131.3721
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4422.183{col 28}{space 2} 8293.654{col 39}{space 1}   -0.53{col 48}{space 3}0.595{col 56}{space 4}-20810.71{col 69}{space 3} 11966.34
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-9.526965{col 28}{space 2} 6.011689{col 39}{space 1}   -1.58{col 48}{space 3}0.115{col 56}{space 4}-21.40631{col 69}{space 3} 2.352378
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 148.9257{col 28}{space 2}  568.803{col 39}{space 1}    0.26{col 48}{space 3}0.794{col 56}{space 4}-975.0434{col 69}{space 3} 1272.895
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 254.1197{col 28}{space 2}  413.362{col 39}{space 1}    0.61{col 48}{space 3}0.540{col 56}{space 4}-564.6408{col 69}{space 3}  1072.88
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 5562.244{col 28}{space 2} 13663.68{col 39}{space 1}    0.41{col 48}{space 3}0.685{col 56}{space 4}-21437.37{col 69}{space 3} 32561.86
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-2463.539{col 28}{space 2} 1804.511{col 39}{space 1}   -1.37{col 48}{space 3}0.174{col 56}{space 4}-6030.181{col 69}{space 3} 1103.104
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 385770.1{col 28}{space 2}    75117{col 39}{space 1}    5.14{col 48}{space 3}0.000{col 56}{space 4} 237336.1{col 69}{space 3}   534204
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***********MODEL 6: MODEL 2+lifestyle/health-related factors*******  
. 
. 
. //Overall//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0026
{txt}{col 49}Largest FMI{col 67}= {res}    0.0255
{txt}{col 49}Complete DF{col 67}= {res}       153
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    144.04
{txt}{col 49}        avg{col 67}= {res}    150.28
{txt}{col 49}        max{col 67}= {res}    151.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  151.0{txt}){col 67}= {res}     15.83
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 16427.25{col 26}{space 2} 18396.38{col 37}{space 1}    0.89{col 46}{space 3}0.373{col 54}{space 4}-19920.35{col 67}{space 3} 52774.84
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 143434.8{col 26}{space 2} 14185.92{col 37}{space 1}   10.11{col 46}{space 3}0.000{col 54}{space 4} 115406.3{col 67}{space 3} 171463.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2914.328{col 26}{space 2} 964.6819{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4}-4820.353{col 67}{space 3}-1008.302
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-63842.62{col 26}{space 2} 15184.22{col 37}{space 1}   -4.20{col 46}{space 3}0.000{col 54}{space 4} -93843.7{col 67}{space 3}-33841.54
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 1265.655{col 26}{space 2} 17270.55{col 37}{space 1}    0.07{col 46}{space 3}0.942{col 54}{space 4}-32857.58{col 67}{space 3} 35388.89
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-18.64032{col 26}{space 2} 12.09463{col 37}{space 1}   -1.54{col 46}{space 3}0.125{col 54}{space 4}-42.53691{col 67}{space 3} 5.256274
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 876.0742{col 26}{space 2}  1111.55{col 37}{space 1}    0.79{col 46}{space 3}0.432{col 54}{space 4}-1320.129{col 67}{space 3} 3072.277
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-999.3952{col 26}{space 2} 18003.89{col 37}{space 1}   -0.06{col 46}{space 3}0.956{col 54}{space 4}-36585.34{col 67}{space 3} 34586.55
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 11202.51{col 26}{space 2} 9252.897{col 37}{space 1}    1.21{col 46}{space 3}0.228{col 54}{space 4}-7079.324{col 67}{space 3} 29484.34
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1120751{col 26}{space 2} 73718.08{col 37}{space 1}   15.20{col 46}{space 3}0.000{col 54}{space 4} 975099.2{col 67}{space 3}  1266404
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0059
{txt}{col 49}Largest FMI{col 67}= {res}    0.0420
{txt}{col 49}Complete DF{col 67}= {res}       153
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    136.76
{txt}{col 49}        avg{col 67}= {res}    149.08
{txt}{col 49}        max{col 67}= {res}    151.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  151.0{txt}){col 67}= {res}     18.63
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 7032.999{col 26}{space 2} 9713.771{col 37}{space 1}    0.72{col 46}{space 3}0.470{col 54}{space 4}-12160.66{col 67}{space 3} 26226.66
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 75086.03{col 26}{space 2} 7468.211{col 37}{space 1}   10.05{col 46}{space 3}0.000{col 54}{space 4} 60330.36{col 67}{space 3}  89841.7
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2389.731{col 26}{space 2} 509.4927{col 37}{space 1}   -4.69{col 46}{space 3}0.000{col 54}{space 4}-3396.459{col 67}{space 3}-1383.002
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-43011.18{col 26}{space 2} 7998.822{col 37}{space 1}   -5.38{col 46}{space 3}0.000{col 54}{space 4}-58815.49{col 67}{space 3}-27206.87
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-3295.701{col 26}{space 2} 9104.034{col 37}{space 1}   -0.36{col 46}{space 3}0.718{col 54}{space 4}-21283.94{col 67}{space 3} 14692.54
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-5.674939{col 26}{space 2}  6.38339{col 37}{space 1}   -0.89{col 46}{space 3}0.375{col 54}{space 4}-18.28789{col 67}{space 3}  6.93801
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  484.489{col 26}{space 2} 585.4899{col 37}{space 1}    0.83{col 46}{space 3}0.409{col 54}{space 4}-672.3342{col 67}{space 3} 1641.312
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-10567.94{col 26}{space 2} 9555.539{col 37}{space 1}   -1.11{col 46}{space 3}0.271{col 54}{space 4}-29463.65{col 67}{space 3} 8327.775
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 6909.204{col 26}{space 2}  4875.77{col 37}{space 1}    1.42{col 46}{space 3}0.159{col 54}{space 4} -2724.48{col 67}{space 3} 16542.89
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 684881.7{col 26}{space 2} 38825.56{col 37}{space 1}   17.64{col 46}{space 3}0.000{col 54}{space 4} 608169.5{col 67}{space 3} 761593.8
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0036
{txt}{col 49}Largest FMI{col 67}= {res}    0.0194
{txt}{col 49}Complete DF{col 67}= {res}       153
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    146.27
{txt}{col 49}        avg{col 67}= {res}    150.31
{txt}{col 49}        max{col 67}= {res}    150.95
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  151.0{txt}){col 67}= {res}     10.01
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  5251.48{col 26}{space 2} 9139.404{col 37}{space 1}    0.57{col 46}{space 3}0.566{col 54}{space 4}-12806.52{col 67}{space 3} 23309.48
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 58763.99{col 26}{space 2} 7042.995{col 37}{space 1}    8.34{col 46}{space 3}0.000{col 54}{space 4} 44848.36{col 67}{space 3} 72679.61
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-865.0422{col 26}{space 2} 478.9143{col 37}{space 1}   -1.81{col 46}{space 3}0.073{col 54}{space 4}-1811.291{col 67}{space 3} 81.20654
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-19370.74{col 26}{space 2} 7538.507{col 37}{space 1}   -2.57{col 46}{space 3}0.011{col 54}{space 4}-34265.49{col 67}{space 3}-4475.988
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-1337.179{col 26}{space 2} 8570.333{col 37}{space 1}   -0.16{col 46}{space 3}0.876{col 54}{space 4}-18270.48{col 67}{space 3} 15596.12
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-10.79621{col 26}{space 2} 6.012252{col 37}{space 1}   -1.80{col 46}{space 3}0.075{col 54}{space 4}-22.67561{col 67}{space 3}  1.08318
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}   360.57{col 26}{space 2} 551.7074{col 37}{space 1}    0.65{col 46}{space 3}0.514{col 54}{space 4}-729.4976{col 67}{space 3} 1450.638
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 10096.25{col 26}{space 2} 8907.465{col 37}{space 1}    1.13{col 46}{space 3}0.259{col 54}{space 4}-7507.707{col 67}{space 3}  27700.2
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 3116.298{col 26}{space 2} 4597.163{col 37}{space 1}    0.68{col 46}{space 3}0.499{col 54}{space 4}-5966.941{col 67}{space 3} 12199.54
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 435959.4{col 26}{space 2}  36597.5{col 37}{space 1}   11.91{col 46}{space 3}0.000{col 54}{space 4} 363649.5{col 67}{space 3} 508269.3
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0040
{txt}{col 49}Largest FMI{col 67}= {res}    0.0372
{txt}{col 49}Complete DF{col 67}= {res}        58
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     53.30
{txt}{col 49}        avg{col 67}= {res}     55.76
{txt}{col 49}        max{col 67}= {res}     56.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   56.1{txt}){col 67}= {res}      7.09
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-45560.94{col 26}{space 2} 30677.32{col 37}{space 1}   -1.49{col 46}{space 3}0.143{col 54}{space 4}-107013.7{col 67}{space 3} 15891.84
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 119518.8{col 26}{space 2} 21314.92{col 37}{space 1}    5.61{col 46}{space 3}0.000{col 54}{space 4} 76820.55{col 67}{space 3}   162217
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1514.645{col 26}{space 2} 1518.286{col 37}{space 1}   -1.00{col 46}{space 3}0.323{col 54}{space 4}-4556.066{col 67}{space 3} 1526.776
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 25242.57{col 26}{space 2} 24956.82{col 37}{space 1}    1.01{col 46}{space 3}0.316{col 54}{space 4} -24750.6{col 67}{space 3} 75235.75
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-19.85106{col 26}{space 2} 18.74753{col 37}{space 1}   -1.06{col 46}{space 3}0.294{col 54}{space 4} -57.4059{col 67}{space 3} 17.70379
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-839.7384{col 26}{space 2} 1822.274{col 37}{space 1}   -0.46{col 46}{space 3}0.647{col 54}{space 4}-4490.055{col 67}{space 3} 2810.578
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 2384.445{col 26}{space 2} 22983.85{col 37}{space 1}    0.10{col 46}{space 3}0.918{col 54}{space 4} -43709.2{col 67}{space 3} 48478.09
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}  15120.8{col 26}{space 2} 13107.62{col 37}{space 1}    1.15{col 46}{space 3}0.254{col 54}{space 4}-11136.24{col 67}{space 3} 41377.84
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1086860{col 26}{space 2} 94041.82{col 37}{space 1}   11.56{col 46}{space 3}0.000{col 54}{space 4}   898478{col 67}{space 3}  1275242
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0037
{txt}{col 49}Largest FMI{col 67}= {res}    0.0116
{txt}{col 49}Complete DF{col 67}= {res}        58
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     55.45
{txt}{col 49}        avg{col 67}= {res}     55.89
{txt}{col 49}        max{col 67}= {res}     56.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   56.1{txt}){col 67}= {res}      7.33
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} -14975.6{col 26}{space 2} 17637.87{col 37}{space 1}   -0.85{col 46}{space 3}0.399{col 54}{space 4}-50310.96{col 67}{space 3} 20359.77
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 65680.05{col 26}{space 2} 12228.57{col 37}{space 1}    5.37{col 46}{space 3}0.000{col 54}{space 4} 41183.94{col 67}{space 3} 90176.16
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1922.299{col 26}{space 2} 872.3679{col 37}{space 1}   -2.20{col 46}{space 3}0.032{col 54}{space 4}-3669.922{col 67}{space 3}-174.6755
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 10760.14{col 26}{space 2} 14323.96{col 37}{space 1}    0.75{col 46}{space 3}0.456{col 54}{space 4}-17933.63{col 67}{space 3} 39453.92
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.562181{col 26}{space 2} 10.78768{col 37}{space 1}   -0.79{col 46}{space 3}0.431{col 54}{space 4}-30.17478{col 67}{space 3} 13.05042
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-371.2533{col 26}{space 2} 1046.184{col 37}{space 1}   -0.35{col 46}{space 3}0.724{col 54}{space 4}-2466.973{col 67}{space 3} 1724.466
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-15171.63{col 26}{space 2} 13026.38{col 37}{space 1}   -1.16{col 46}{space 3}0.249{col 54}{space 4}-41272.31{col 67}{space 3} 10929.05
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 8543.223{col 26}{space 2} 7530.697{col 37}{space 1}    1.13{col 46}{space 3}0.261{col 54}{space 4}-6543.009{col 67}{space 3} 23629.45
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 640912.3{col 26}{space 2} 54005.19{col 37}{space 1}   11.87{col 46}{space 3}0.000{col 54}{space 4} 532727.2{col 67}{space 3} 749097.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0109
{txt}{col 49}Largest FMI{col 67}= {res}    0.0736
{txt}{col 49}Complete DF{col 67}= {res}        58
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     49.26
{txt}{col 49}        avg{col 67}= {res}     55.06
{txt}{col 49}        max{col 67}= {res}     56.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   56.0{txt}){col 67}= {res}      5.31
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-28854.12{col 26}{space 2} 14192.77{col 37}{space 1}   -2.03{col 46}{space 3}0.047{col 54}{space 4}-57292.96{col 67}{space 3}-415.2853
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 44462.23{col 26}{space 2} 9829.545{col 37}{space 1}    4.52{col 46}{space 3}0.000{col 54}{space 4} 24769.59{col 67}{space 3} 64154.86
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-83.85399{col 26}{space 2} 701.9102{col 37}{space 1}   -0.12{col 46}{space 3}0.905{col 54}{space 4}-1490.246{col 67}{space 3} 1322.538
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 6439.339{col 26}{space 2} 11505.88{col 37}{space 1}    0.56{col 46}{space 3}0.578{col 54}{space 4}-16611.06{col 67}{space 3} 29489.73
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-8.028909{col 26}{space 2}   8.6347{col 37}{space 1}   -0.93{col 46}{space 3}0.356{col 54}{space 4}-25.32645{col 67}{space 3} 9.268635
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-579.3323{col 26}{space 2} 839.3838{col 37}{space 1}   -0.69{col 46}{space 3}0.493{col 54}{space 4}-2260.827{col 67}{space 3} 1102.162
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 14979.69{col 26}{space 2} 10766.43{col 37}{space 1}    1.39{col 46}{space 3}0.170{col 54}{space 4}-6653.361{col 67}{space 3} 36612.73
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 5375.395{col 26}{space 2} 6032.711{col 37}{space 1}    0.89{col 46}{space 3}0.377{col 54}{space 4}-6709.299{col 67}{space 3} 17460.09
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 448801.3{col 26}{space 2} 43373.05{col 37}{space 1}   10.35{col 46}{space 3}0.000{col 54}{space 4} 361908.6{col 67}{space 3} 535694.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0116
{txt}{col 49}Largest FMI{col 67}= {res}    0.0973
{txt}{col 49}Complete DF{col 67}= {res}        87
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     66.60
{txt}{col 49}        avg{col 67}= {res}     82.79
{txt}{col 49}        max{col 67}= {res}     85.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   85.0{txt}){col 67}= {res}      9.42
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 42119.06{col 26}{space 2} 24345.21{col 37}{space 1}    1.73{col 46}{space 3}0.087{col 54}{space 4}-6285.626{col 67}{space 3} 90523.74
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 158318.8{col 26}{space 2} 19743.42{col 37}{space 1}    8.02{col 46}{space 3}0.000{col 54}{space 4}   119059{col 67}{space 3} 197578.5
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-3058.583{col 26}{space 2} 1378.265{col 37}{space 1}   -2.22{col 46}{space 3}0.029{col 54}{space 4}-5798.959{col 67}{space 3}-318.2068
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-15461.47{col 26}{space 2} 24107.73{col 37}{space 1}   -0.64{col 46}{space 3}0.523{col 54}{space 4}-63394.61{col 67}{space 3} 32471.68
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -24.3104{col 26}{space 2} 16.41246{col 37}{space 1}   -1.48{col 46}{space 3}0.142{col 54}{space 4}-56.94256{col 67}{space 3} 8.321752
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1133.056{col 26}{space 2} 1516.214{col 37}{space 1}    0.75{col 46}{space 3}0.457{col 54}{space 4}-1881.668{col 67}{space 3} 4147.781
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 13479.93{col 26}{space 2}    29562{col 37}{space 1}    0.46{col 46}{space 3}0.650{col 54}{space 4}-45532.65{col 67}{space 3} 72492.52
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 11575.35{col 26}{space 2} 13228.17{col 37}{space 1}    0.88{col 46}{space 3}0.384{col 54}{space 4}-14725.57{col 67}{space 3} 37876.28
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1009298{col 26}{space 2} 103864.2{col 37}{space 1}    9.72{col 46}{space 3}0.000{col 54}{space 4} 802764.2{col 67}{space 3}  1215832
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0102
{txt}{col 49}Largest FMI{col 67}= {res}    0.0887
{txt}{col 49}Complete DF{col 67}= {res}        87
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     68.67
{txt}{col 49}        avg{col 67}= {res}     83.04
{txt}{col 49}        max{col 67}= {res}     85.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   85.0{txt}){col 67}= {res}     10.49
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  14035.5{col 26}{space 2} 12354.63{col 37}{space 1}    1.14{col 46}{space 3}0.259{col 54}{space 4} -10528.7{col 67}{space 3} 38599.69
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 82940.65{col 26}{space 2} 10013.79{col 37}{space 1}    8.28{col 46}{space 3}0.000{col 54}{space 4} 63028.73{col 67}{space 3} 102852.6
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2211.377{col 26}{space 2} 699.7206{col 37}{space 1}   -3.16{col 46}{space 3}0.002{col 54}{space 4}-3602.631{col 67}{space 3}-820.1229
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-13183.91{col 26}{space 2} 12238.16{col 37}{space 1}   -1.08{col 46}{space 3}0.284{col 54}{space 4} -37517.1{col 67}{space 3} 11149.28
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-6.042768{col 26}{space 2} 8.329827{col 37}{space 1}   -0.73{col 46}{space 3}0.470{col 54}{space 4} -22.6046{col 67}{space 3} 10.51907
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 807.4413{col 26}{space 2}  769.471{col 37}{space 1}    1.05{col 46}{space 3}0.297{col 54}{space 4}-722.5141{col 67}{space 3} 2337.397
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 2562.223{col 26}{space 2} 14939.13{col 37}{space 1}    0.17{col 46}{space 3}0.864{col 54}{space 4}-27243.09{col 67}{space 3} 32367.54
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 6140.028{col 26}{space 2} 6713.325{col 37}{space 1}    0.91{col 46}{space 3}0.363{col 54}{space 4}-7207.732{col 67}{space 3} 19487.79
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 610415.8{col 26}{space 2} 52675.07{col 37}{space 1}   11.59{col 46}{space 3}0.000{col 54}{space 4} 505674.2{col 67}{space 3} 715157.4
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0135
{txt}{col 49}Largest FMI{col 67}= {res}    0.0970
{txt}{col 49}Complete DF{col 67}= {res}        87
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     66.66
{txt}{col 49}        avg{col 67}= {res}     82.71
{txt}{col 49}        max{col 67}= {res}     85.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   84.9{txt}){col 67}= {res}      6.59
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  20602.1{col 26}{space 2} 12464.67{col 37}{space 1}    1.65{col 46}{space 3}0.102{col 54}{space 4}-4181.822{col 67}{space 3} 45386.02
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 66740.43{col 26}{space 2} 10103.08{col 37}{space 1}    6.61{col 46}{space 3}0.000{col 54}{space 4}    46650{col 67}{space 3} 86830.85
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1076.583{col 26}{space 2} 704.5779{col 37}{space 1}   -1.53{col 46}{space 3}0.130{col 54}{space 4}-2477.464{col 67}{space 3} 324.2968
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -6684.44{col 26}{space 2} 12323.99{col 37}{space 1}   -0.54{col 46}{space 3}0.589{col 54}{space 4}-31187.79{col 67}{space 3} 17818.91
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.93825{col 26}{space 2} 8.409329{col 37}{space 1}   -1.90{col 46}{space 3}0.061{col 54}{space 4}-32.65911{col 67}{space 3} .7826194
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 459.8797{col 26}{space 2} 775.2815{col 37}{space 1}    0.59{col 46}{space 3}0.555{col 54}{space 4}-1081.623{col 67}{space 3} 2001.382
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 14415.77{col 26}{space 2} 15115.86{col 37}{space 1}    0.95{col 46}{space 3}0.344{col 54}{space 4}-15758.46{col 67}{space 3} 44590.01
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 4262.816{col 26}{space 2} 6766.531{col 37}{space 1}    0.63{col 46}{space 3}0.530{col 54}{space 4}-9190.828{col 67}{space 3} 17716.46
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 393224.7{col 26}{space 2}  53174.5{col 37}{space 1}    7.39{col 46}{space 3}0.000{col 54}{space 4} 287482.6{col 67}{space 3} 498966.8
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. ******************INTERACTION BY Race***********************
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0027
{txt}{col 49}Largest FMI{col 67}= {res}    0.0293
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    141.61
{txt}{col 49}        avg{col 67}= {res}    149.23
{txt}{col 49}        max{col 67}= {res}    150.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  150.0{txt}){col 67}= {res}     15.32
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 40635.15{col 28}{space 2} 20583.75{col 39}{space 1}    1.97{col 48}{space 3}0.050{col 56}{space 4}-36.31738{col 69}{space 3} 81306.61
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 76012.32{col 28}{space 2} 58621.43{col 39}{space 1}    1.30{col 48}{space 3}0.197{col 56}{space 4}-39817.87{col 69}{space 3} 191842.5
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-72188.48{col 28}{space 2} 29262.69{col 39}{space 1}   -2.47{col 48}{space 3}0.015{col 56}{space 4}-130008.8{col 69}{space 3} -14368.2
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 141578.4{col 28}{space 2}  13976.5{col 39}{space 1}   10.13{col 48}{space 3}0.000{col 56}{space 4} 113962.1{col 69}{space 3} 169194.6
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -2719.47{col 28}{space 2} 952.2195{col 39}{space 1}   -2.86{col 48}{space 3}0.005{col 56}{space 4} -4600.97{col 69}{space 3}-837.9707
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} 622.0674{col 28}{space 2} 16991.36{col 39}{space 1}    0.04{col 48}{space 3}0.971{col 56}{space 4}-32951.31{col 69}{space 3} 34195.44
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-20.69429{col 28}{space 2} 11.92703{col 39}{space 1}   -1.74{col 48}{space 3}0.085{col 56}{space 4}-44.26098{col 69}{space 3} 2.872392
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 646.9506{col 28}{space 2} 1097.486{col 39}{space 1}    0.59{col 48}{space 3}0.556{col 56}{space 4}-1521.581{col 69}{space 3} 2815.483
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2} 2319.162{col 28}{space 2} 17806.26{col 39}{space 1}    0.13{col 48}{space 3}0.897{col 56}{space 4}-32881.28{col 69}{space 3} 37519.61
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 11511.48{col 28}{space 2} 9103.892{col 39}{space 1}    1.26{col 48}{space 3}0.208{col 56}{space 4} -6476.92{col 69}{space 3} 29499.88
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1008920{col 28}{space 2} 71773.44{col 39}{space 1}   14.06{col 48}{space 3}0.000{col 56}{space 4} 867101.5{col 69}{space 3}  1150739
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0048
{txt}{col 49}Largest FMI{col 67}= {res}    0.0381
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    137.77
{txt}{col 49}        avg{col 67}= {res}    148.51
{txt}{col 49}        max{col 67}= {res}    150.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  150.0{txt}){col 67}= {res}     17.36
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 16502.04{col 28}{space 2} 10958.22{col 39}{space 1}    1.51{col 48}{space 3}0.134{col 56}{space 4}-5151.281{col 69}{space 3} 38155.36
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 11691.45{col 28}{space 2} 31153.77{col 39}{space 1}    0.38{col 48}{space 3}0.708{col 56}{space 4}-49865.94{col 69}{space 3} 73248.83
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-28234.59{col 28}{space 2} 15554.53{col 39}{space 1}   -1.82{col 48}{space 3}0.071{col 56}{space 4}-58969.26{col 69}{space 3} 2500.086
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 74359.45{col 28}{space 2} 7423.138{col 39}{space 1}   10.02{col 48}{space 3}0.000{col 56}{space 4} 59692.06{col 69}{space 3} 89026.84
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2313.607{col 28}{space 2} 507.2492{col 39}{space 1}   -4.56{col 48}{space 3}0.000{col 56}{space 4}-3315.946{col 69}{space 3}-1311.268
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3548.477{col 28}{space 2} 9037.435{col 39}{space 1}   -0.39{col 48}{space 3}0.695{col 56}{space 4} -21406.1{col 69}{space 3} 14309.14
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-6.478543{col 28}{space 2} 6.348287{col 39}{space 1}   -1.02{col 48}{space 3}0.309{col 56}{space 4}-19.02267{col 69}{space 3} 6.065587
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 394.7672{col 28}{space 2} 583.0842{col 39}{space 1}    0.68{col 48}{space 3}0.499{col 56}{space 4}-757.3595{col 69}{space 3} 1546.894
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-9281.169{col 28}{space 2} 9498.712{col 39}{space 1}   -0.98{col 48}{space 3}0.330{col 56}{space 4}-28063.29{col 69}{space 3} 9500.946
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 7030.279{col 28}{space 2} 4838.954{col 39}{space 1}    1.45{col 48}{space 3}0.148{col 56}{space 4}-2531.141{col 69}{space 3}  16591.7
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 623110.3{col 28}{space 2} 38137.52{col 39}{space 1}   16.34{col 48}{space 3}0.000{col 56}{space 4}   547753{col 69}{space 3} 698467.5
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0055
{txt}{col 49}Largest FMI{col 67}= {res}    0.0341
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    139.56
{txt}{col 49}        avg{col 67}= {res}    148.64
{txt}{col 49}        max{col 67}= {res}    149.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  150.0{txt}){col 67}= {res}      9.94
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 17556.23{col 28}{space 2} 10228.67{col 39}{space 1}    1.72{col 48}{space 3}0.088{col 56}{space 4}-2655.525{col 69}{space 3} 37767.99
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 51718.81{col 28}{space 2} 29094.65{col 39}{space 1}    1.78{col 48}{space 3}0.077{col 56}{space 4} -5770.51{col 69}{space 3} 109208.1
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-36695.19{col 28}{space 2} 14533.92{col 39}{space 1}   -2.52{col 48}{space 3}0.013{col 56}{space 4}-65413.83{col 69}{space 3}-7976.558
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 57820.83{col 28}{space 2} 6932.756{col 39}{space 1}    8.34{col 48}{space 3}0.000{col 56}{space 4} 44122.25{col 69}{space 3} 71519.42
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-765.9029{col 28}{space 2} 472.5475{col 39}{space 1}   -1.62{col 48}{space 3}0.107{col 56}{space 4}-1699.631{col 69}{space 3}  167.825
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-1663.277{col 28}{space 2} 8423.169{col 39}{space 1}   -0.20{col 48}{space 3}0.844{col 56}{space 4}-18306.67{col 69}{space 3} 14980.12
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-11.84003{col 28}{space 2} 5.925683{col 39}{space 1}   -2.00{col 48}{space 3}0.048{col 56}{space 4}-23.54911{col 69}{space 3}-.1309547
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 244.2097{col 28}{space 2} 544.3126{col 39}{space 1}    0.45{col 48}{space 3}0.654{col 56}{space 4}-831.3098{col 69}{space 3} 1319.729
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2} 11794.68{col 28}{space 2} 8848.651{col 39}{space 1}    1.33{col 48}{space 3}0.185{col 56}{space 4}-5700.058{col 69}{space 3} 29289.41
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 3273.153{col 28}{space 2} 4520.439{col 39}{space 1}    0.72{col 48}{space 3}0.470{col 56}{space 4}-5659.048{col 69}{space 3} 12205.35
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 392185.2{col 28}{space 2} 35652.68{col 39}{space 1}   11.00{col 48}{space 3}0.000{col 56}{space 4} 321735.6{col 69}{space 3} 462634.9
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. ////////////////////////////////////////LnNFLw3 exposure/////////////////////////////////////////////
> 
. 
. ***********************LnNFLw3, MODELS 1 AND 2*********************
. 
. *********************AFRICAN-AMERICAN*******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final2==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        67
{txt}{hline 13}{c +}{hline 34}   F(5, 61)        = {res}    10.68
{txt}       Model {c |} {res} 3.3719e+11         5  6.7438e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.8526e+11        61  6.3158e+09   {txt}R-squared       ={res}    0.4667
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4230
{txt}       Total {c |} {res} 7.2245e+11        66  1.0946e+10   {txt}Root MSE        =   {res}  79472

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-18079.79{col 26}{space 2} 23287.02{col 37}{space 1}   -0.78{col 46}{space 3}0.441{col 67}{space 3}-.0849274
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 129565.6{col 26}{space 2} 19971.78{col 37}{space 1}    6.49{col 46}{space 3}0.000{col 67}{space 3} .6154018
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2311.501{col 26}{space 2}  1246.42{col 37}{space 1}   -1.85{col 46}{space 3}0.069{col 67}{space 3}-.2181289
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 24735.19{col 26}{space 2} 24654.17{col 37}{space 1}    1.00{col 46}{space 3}0.320{col 67}{space 3}  .115204
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-18.09144{col 26}{space 2} 18.65743{col 37}{space 1}   -0.97{col 46}{space 3}0.336{col 67}{space 3}-.1032732
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1068207{col 26}{space 2} 77224.15{col 37}{space 1}   13.83{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final2==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        67
{txt}{hline 13}{c +}{hline 34}   F(5, 61)        = {res}    10.81
{txt}       Model {c |} {res} 1.1359e+11         5  2.2718e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.2815e+11        61  2.1008e+09   {txt}R-squared       ={res}    0.4699
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4264
{txt}       Total {c |} {res} 2.4174e+11        66  3.6627e+09   {txt}Root MSE        =   {res}  45835

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-8661.968{col 26}{space 2} 13430.53{col 37}{space 1}   -0.64{col 46}{space 3}0.521{col 67}{space 3}-.0703397
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 68480.97{col 26}{space 2}  11518.5{col 37}{space 1}    5.95{col 46}{space 3}0.000{col 67}{space 3} .5623006
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2008.107{col 26}{space 2} 718.8591{col 37}{space 1}   -2.79{col 46}{space 3}0.007{col 67}{space 3}-.3275938
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 12773.24{col 26}{space 2} 14219.02{col 37}{space 1}    0.90{col 46}{space 3}0.373{col 67}{space 3} .1028449
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-9.137972{col 26}{space 2} 10.76046{col 37}{space 1}   -0.85{col 46}{space 3}0.399{col 67}{space 3}-.0901766
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 632624.6{col 26}{space 2} 44538.18{col 37}{space 1}   14.20{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final2==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        67
{txt}{hline 13}{c +}{hline 34}   F(5, 61)        = {res}     7.15
{txt}       Model {c |} {res} 4.9668e+10         5  9.9336e+09   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 8.4767e+10        61  1.3896e+09   {txt}R-squared       ={res}    0.3695
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3178
{txt}       Total {c |} {res} 1.3443e+11        66  2.0369e+09   {txt}Root MSE        =   {res}  37278

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-7093.696{col 26}{space 2} 10923.15{col 37}{space 1}   -0.65{col 46}{space 3}0.519{col 67}{space 3} -.077246
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 50836.49{col 26}{space 2}  9368.08{col 37}{space 1}    5.43{col 46}{space 3}0.000{col 67}{space 3} .5597494
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-823.6415{col 26}{space 2} 584.6533{col 37}{space 1}   -1.41{col 46}{space 3}0.164{col 67}{space 3}-.1801799
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 4021.317{col 26}{space 2} 11564.43{col 37}{space 1}    0.35{col 46}{space 3}0.729{col 67}{space 3}  .043418
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-5.875419{col 26}{space 2} 8.751564{col 37}{space 1}   -0.67{col 46}{space 3}0.505{col 67}{space 3}-.0777504
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 433060.3{col 26}{space 2} 36223.22{col 37}{space 1}   11.96{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        60
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     58.10
{txt}{col 49}        avg{col 67}= {res}     58.10
{txt}{col 49}        max{col 67}= {res}     58.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   58.1{txt}){col 67}= {res}      8.79
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} -15478.4{col 26}{space 2} 24562.64{col 37}{space 1}   -0.63{col 46}{space 3}0.531{col 54}{space 4}-64644.14{col 67}{space 3} 33687.35
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 130356.4{col 26}{space 2} 20237.93{col 37}{space 1}    6.44{col 46}{space 3}0.000{col 54}{space 4} 89847.18{col 67}{space 3} 170865.6
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2489.088{col 26}{space 2} 1350.512{col 37}{space 1}   -1.84{col 46}{space 3}0.070{col 54}{space 4}-5192.337{col 67}{space 3} 214.1611
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 23603.65{col 26}{space 2} 25034.17{col 37}{space 1}    0.94{col 46}{space 3}0.350{col 54}{space 4}-26505.95{col 67}{space 3} 73713.24
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-17.92245{col 26}{space 2} 18.79831{col 37}{space 1}   -0.95{col 46}{space 3}0.344{col 54}{space 4}-55.55004{col 67}{space 3} 19.70514
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 581.1937{col 26}{space 2} 1629.054{col 37}{space 1}    0.36{col 46}{space 3}0.723{col 54}{space 4}-2679.597{col 67}{space 3} 3841.985
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1054030{col 26}{space 2} 87345.69{col 37}{space 1}   12.07{col 46}{space 3}0.000{col 54}{space 4} 879194.4{col 67}{space 3}  1228865
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        60
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     58.10
{txt}{col 49}        avg{col 67}= {res}     58.10
{txt}{col 49}        max{col 67}= {res}     58.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   58.1{txt}){col 67}= {res}      8.90
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-7262.297{col 26}{space 2} 14168.18{col 37}{space 1}   -0.51{col 46}{space 3}0.610{col 54}{space 4}   -35622{col 67}{space 3}  21097.4
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 68906.43{col 26}{space 2} 11673.61{col 37}{space 1}    5.90{col 46}{space 3}0.000{col 54}{space 4} 45539.98{col 67}{space 3} 92272.88
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2103.657{col 26}{space 2}      779{col 37}{space 1}   -2.70{col 46}{space 3}0.009{col 54}{space 4}-3662.941{col 67}{space 3}-544.3738
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 12164.42{col 26}{space 2} 14440.17{col 37}{space 1}    0.84{col 46}{space 3}0.403{col 54}{space 4}-16739.71{col 67}{space 3} 41068.55
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-9.047045{col 26}{space 2} 10.84321{col 37}{space 1}   -0.83{col 46}{space 3}0.408{col 54}{space 4}-30.75133{col 67}{space 3} 12.65724
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 312.7096{col 26}{space 2} 939.6679{col 37}{space 1}    0.33{col 46}{space 3}0.740{col 54}{space 4}-1568.174{col 67}{space 3} 2193.594
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 624996.5{col 26}{space 2} 50382.59{col 37}{space 1}   12.41{col 46}{space 3}0.000{col 54}{space 4} 524148.3{col 67}{space 3} 725844.7
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        60
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     58.10
{txt}{col 49}        avg{col 67}= {res}     58.10
{txt}{col 49}        max{col 67}= {res}     58.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   58.1{txt}){col 67}= {res}      5.87
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-6462.473{col 26}{space 2} 11530.44{col 37}{space 1}   -0.56{col 46}{space 3}0.577{col 54}{space 4}-29542.36{col 67}{space 3} 16617.41
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 51028.36{col 26}{space 2} 9500.294{col 37}{space 1}    5.37{col 46}{space 3}0.000{col 54}{space 4} 32012.12{col 67}{space 3}  70044.6
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-866.7325{col 26}{space 2} 633.9711{col 37}{space 1}   -1.37{col 46}{space 3}0.177{col 54}{space 4}-2135.719{col 67}{space 3} 402.2543
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 3746.751{col 26}{space 2}  11751.8{col 37}{space 1}    0.32{col 46}{space 3}0.751{col 54}{space 4}-19776.21{col 67}{space 3} 27269.71
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-5.834413{col 26}{space 2} 8.824494{col 37}{space 1}   -0.66{col 46}{space 3}0.511{col 54}{space 4}-23.49794{col 67}{space 3} 11.82911
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 141.0256{col 26}{space 2}  764.727{col 37}{space 1}    0.18{col 46}{space 3}0.854{col 54}{space 4}-1389.688{col 67}{space 3} 1671.739
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 429620.1{col 26}{space 2} 41002.71{col 37}{space 1}   10.48{col 46}{space 3}0.000{col 54}{space 4} 347547.2{col 67}{space 3} 511693.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. *********************WHITES******************************************************
. 
. **Model 1**
. 
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final2==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        96
{txt}{hline 13}{c +}{hline 34}   F(5, 90)        = {res}    14.58
{txt}       Model {c |} {res} 6.0828e+11         5  1.2166e+11   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 7.5114e+11        90  8.3460e+09   {txt}R-squared       ={res}    0.4475
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4168
{txt}       Total {c |} {res} 1.3594e+12        95  1.4310e+10   {txt}Root MSE        =   {res}  91356

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 16822.43{col 26}{space 2} 20436.91{col 37}{space 1}    0.82{col 46}{space 3}0.413{col 67}{space 3} .0734807
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 154724.2{col 26}{space 2} 18960.06{col 37}{space 1}    8.16{col 46}{space 3}0.000{col 67}{space 3} .6431602
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2292.996{col 26}{space 2} 1232.944{col 37}{space 1}   -1.86{col 46}{space 3}0.066{col 67}{space 3}-.1665872
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-25969.79{col 26}{space 2} 22961.38{col 37}{space 1}   -1.13{col 46}{space 3}0.261{col 67}{space 3}-.0944992
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -18.2634{col 26}{space 2} 15.50569{col 37}{space 1}   -1.18{col 46}{space 3}0.242{col 67}{space 3}-.0977991
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1089846{col 26}{space 2} 74147.76{col 37}{space 1}   14.70{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final2==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        96
{txt}{hline 13}{c +}{hline 34}   F(5, 90)        = {res}    16.51
{txt}       Model {c |} {res} 1.7628e+11         5  3.5256e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.9216e+11        90  2.1351e+09   {txt}R-squared       ={res}    0.4784
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4495
{txt}       Total {c |} {res} 3.6844e+11        95  3.8783e+09   {txt}Root MSE        =   {res}  46208

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}  2764.12{col 26}{space 2} 10336.88{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 67}{space 3} .0231917
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 81427.83{col 26}{space 2} 9589.896{col 37}{space 1}    8.49{col 46}{space 3}0.000{col 67}{space 3}  .650168
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1908.482{col 26}{space 2} 623.6165{col 37}{space 1}   -3.06{col 46}{space 3}0.003{col 67}{space 3} -.266329
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-17371.25{col 26}{space 2} 11613.74{col 37}{space 1}   -1.50{col 46}{space 3}0.138{col 67}{space 3}-.1214178
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-3.944724{col 26}{space 2} 7.842692{col 37}{space 1}   -0.50{col 46}{space 3}0.616{col 67}{space 3}-.0405753
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 660053.4{col 26}{space 2} 37503.53{col 37}{space 1}   17.60{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN     if sample_final2==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        96
{txt}{hline 13}{c +}{hline 34}   F(5, 90)        = {res}     9.93
{txt}       Model {c |} {res} 1.0876e+11         5  2.1752e+10   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.9723e+11        90  2.1914e+09   {txt}R-squared       ={res}    0.3554
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3196
{txt}       Total {c |} {res} 3.0598e+11        95  3.2209e+09   {txt}Root MSE        =   {res}  46812

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 7921.951{col 26}{space 2} 10472.17{col 37}{space 1}    0.76{col 46}{space 3}0.451{col 67}{space 3} .0729363
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 63962.94{col 26}{space 2} 9715.414{col 37}{space 1}    6.58{col 46}{space 3}0.000{col 67}{space 3} .5604232
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-724.0062{col 26}{space 2} 631.7787{col 37}{space 1}   -1.15{col 46}{space 3}0.255{col 67}{space 3}-.1108683
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-12425.64{col 26}{space 2} 11765.75{col 37}{space 1}   -1.06{col 46}{space 3}0.294{col 67}{space 3}-.0953027
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-12.59659{col 26}{space 2} 7.945341{col 37}{space 1}   -1.59{col 46}{space 3}0.116{col 67}{space 3}-.1421783
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 431179.8{col 26}{space 2}  37994.4{col 37}{space 1}   11.35{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        89
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     87.07
{txt}{col 49}        avg{col 67}= {res}     87.07
{txt}{col 49}        max{col 67}= {res}     87.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   87.1{txt}){col 67}= {res}     12.12
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}  17713.8{col 26}{space 2} 20568.08{col 37}{space 1}    0.86{col 46}{space 3}0.391{col 54}{space 4}-23167.06{col 67}{space 3} 58594.65
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 156194.4{col 26}{space 2} 19194.06{col 37}{space 1}    8.14{col 46}{space 3}0.000{col 54}{space 4} 118044.6{col 67}{space 3} 194344.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2224.392{col 26}{space 2} 1242.983{col 37}{space 1}   -1.79{col 46}{space 3}0.077{col 54}{space 4} -4694.93{col 67}{space 3} 246.1458
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-26019.39{col 26}{space 2}  23045.7{col 37}{space 1}   -1.13{col 46}{space 3}0.262{col 54}{space 4}-71824.73{col 67}{space 3} 19785.96
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-17.01486{col 26}{space 2} 15.70754{col 37}{space 1}   -1.08{col 46}{space 3}0.282{col 54}{space 4}-48.23496{col 67}{space 3} 14.20524
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  878.369{col 26}{space 2} 1498.089{col 37}{space 1}    0.59{col 46}{space 3}0.559{col 54}{space 4}-2099.214{col 67}{space 3} 3855.952
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1054266{col 26}{space 2} 96025.21{col 37}{space 1}   10.98{col 46}{space 3}0.000{col 54}{space 4} 863407.1{col 67}{space 3}  1245124
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        89
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     87.07
{txt}{col 49}        avg{col 67}= {res}     87.07
{txt}{col 49}        max{col 67}= {res}     87.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   87.1{txt}){col 67}= {res}     13.89
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 3484.589{col 26}{space 2} 10371.96{col 37}{space 1}    0.34{col 46}{space 3}0.738{col 54}{space 4}-17130.58{col 67}{space 3} 24099.76
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 82616.16{col 26}{space 2} 9679.072{col 37}{space 1}    8.54{col 46}{space 3}0.000{col 54}{space 4} 63378.16{col 67}{space 3} 101854.2
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1853.031{col 26}{space 2} 626.8048{col 37}{space 1}   -2.96{col 46}{space 3}0.004{col 54}{space 4} -3098.86{col 67}{space 3}-607.2018
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-17411.33{col 26}{space 2} 11621.36{col 37}{space 1}   -1.50{col 46}{space 3}0.138{col 54}{space 4} -40509.8{col 67}{space 3} 5687.135
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-2.935556{col 26}{space 2} 7.920909{col 37}{space 1}   -0.37{col 46}{space 3}0.712{col 54}{space 4}-18.67905{col 67}{space 3} 12.80794
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 709.9682{col 26}{space 2}  755.448{col 37}{space 1}    0.94{col 46}{space 3}0.350{col 54}{space 4}-791.5507{col 67}{space 3} 2211.487
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 631294.2{col 26}{space 2} 48423.06{col 37}{space 1}   13.04{col 46}{space 3}0.000{col 54}{space 4} 535049.2{col 67}{space 3} 727539.3
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        89
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     87.07
{txt}{col 49}        avg{col 67}= {res}     87.07
{txt}{col 49}        max{col 67}= {res}     87.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   6{txt},{res}   87.1{txt}){col 67}= {res}      8.21
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}  8197.21{col 26}{space 2} 10552.34{col 37}{space 1}    0.78{col 46}{space 3}0.439{col 54}{space 4}-12776.49{col 67}{space 3} 29170.91
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 64416.95{col 26}{space 2} 9847.404{col 37}{space 1}    6.54{col 46}{space 3}0.000{col 54}{space 4} 44844.37{col 67}{space 3} 83989.53
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-702.8207{col 26}{space 2} 637.7058{col 37}{space 1}   -1.10{col 46}{space 3}0.273{col 54}{space 4}-1970.317{col 67}{space 3} 564.6752
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-12440.96{col 26}{space 2} 11823.47{col 37}{space 1}   -1.05{col 46}{space 3}0.296{col 54}{space 4}-35941.14{col 67}{space 3} 11059.22
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-12.21103{col 26}{space 2} 8.058665{col 37}{space 1}   -1.52{col 46}{space 3}0.133{col 54}{space 4}-28.22833{col 67}{space 3}  3.80627
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 271.2477{col 26}{space 2} 768.5863{col 37}{space 1}    0.35{col 46}{space 3}0.725{col 54}{space 4}-1256.385{col 67}{space 3}  1798.88
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 420192.2{col 26}{space 2}  49265.2{col 37}{space 1}    8.53{col 46}{space 3}0.000{col 54}{space 4} 322273.3{col 67}{space 3} 518111.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //INTERACTION BY Race//
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       154
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    152.04
{txt}{col 49}        avg{col 67}= {res}    152.04
{txt}{col 49}        max{col 67}= {res}    152.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  152.0{txt}){col 67}= {res}     18.11
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 21644.64{col 28}{space 2} 18539.95{col 39}{space 1}    1.17{col 48}{space 3}0.245{col 56}{space 4}-14984.56{col 69}{space 3} 58273.83
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 24599.14{col 28}{space 2} 61171.13{col 39}{space 1}    0.40{col 48}{space 3}0.688{col 56}{space 4}-96256.05{col 69}{space 3} 145454.3
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-42488.55{col 28}{space 2} 27761.02{col 39}{space 1}   -1.53{col 48}{space 3}0.128{col 56}{space 4}-97335.72{col 69}{space 3} 12358.61
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}   144821{col 28}{space 2}  13993.6{col 39}{space 1}   10.35{col 48}{space 3}0.000{col 56}{space 4} 117173.9{col 69}{space 3}   172468
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2456.083{col 28}{space 2}  882.844{col 39}{space 1}   -2.78{col 48}{space 3}0.006{col 56}{space 4}-4200.309{col 69}{space 3}-711.8571
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3323.795{col 28}{space 2} 16732.33{col 39}{space 1}   -0.20{col 48}{space 3}0.843{col 56}{space 4}-36381.69{col 69}{space 3}  29734.1
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-16.54277{col 28}{space 2}   11.877{col 39}{space 1}   -1.39{col 48}{space 3}0.166{col 56}{space 4}-40.00804{col 69}{space 3} 6.922497
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 751.3839{col 28}{space 2} 1074.279{col 39}{space 1}    0.70{col 48}{space 3}0.485{col 56}{space 4}-1371.059{col 69}{space 3} 2873.827
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1047255{col 28}{space 2} 70178.79{col 39}{space 1}   14.92{col 48}{space 3}0.000{col 56}{space 4} 908603.6{col 69}{space 3}  1185907
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       154
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    152.04
{txt}{col 49}        avg{col 67}= {res}    152.04
{txt}{col 49}        max{col 67}= {res}    152.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  152.0{txt}){col 67}= {res}     20.70
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 6411.501{col 28}{space 2} 9842.525{col 39}{space 1}    0.65{col 48}{space 3}0.516{col 56}{space 4}-13034.28{col 69}{space 3} 25857.28
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-9385.139{col 28}{space 2} 32474.65{col 39}{space 1}   -0.29{col 48}{space 3}0.773{col 56}{space 4}-73544.98{col 69}{space 3}  54774.7
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-17148.24{col 28}{space 2} 14737.82{col 39}{space 1}   -1.16{col 48}{space 3}0.246{col 56}{space 4}-46265.61{col 69}{space 3} 11969.13
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 76625.27{col 28}{space 2} 7428.952{col 39}{space 1}   10.31{col 48}{space 3}0.000{col 56}{space 4} 61947.96{col 69}{space 3} 91302.58
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2070.733{col 28}{space 2} 468.6859{col 39}{space 1}   -4.42{col 48}{space 3}0.000{col 56}{space 4}-2996.711{col 69}{space 3}-1144.755
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4363.322{col 28}{space 2} 8882.893{col 39}{space 1}   -0.49{col 48}{space 3}0.624{col 56}{space 4}-21913.16{col 69}{space 3} 13186.52
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-4.852199{col 28}{space 2} 6.305285{col 39}{space 1}   -0.77{col 48}{space 3}0.443{col 56}{space 4}-17.30949{col 69}{space 3} 7.605089
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 512.4651{col 28}{space 2} 570.3155{col 39}{space 1}    0.90{col 48}{space 3}0.370{col 56}{space 4}-614.3015{col 69}{space 3} 1639.232
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 636788.3{col 28}{space 2} 37256.66{col 39}{space 1}   17.09{col 48}{space 3}0.000{col 56}{space 4} 563180.7{col 69}{space 3} 710395.9
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI   if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       154
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    152.04
{txt}{col 49}        avg{col 67}= {res}    152.04
{txt}{col 49}        max{col 67}= {res}    152.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}  152.0{txt}){col 67}= {res}     11.33
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 9433.738{col 28}{space 2} 9224.969{col 39}{space 1}    1.02{col 48}{space 3}0.308{col 56}{space 4}-8791.941{col 69}{space 3} 27659.42
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 19912.27{col 28}{space 2} 30437.07{col 39}{space 1}    0.65{col 48}{space 3}0.514{col 56}{space 4}-40221.95{col 69}{space 3} 80046.49
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-17969.53{col 28}{space 2} 13813.12{col 39}{space 1}   -1.30{col 48}{space 3}0.195{col 56}{space 4}-45259.97{col 69}{space 3} 9320.916
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 58566.63{col 28}{space 2} 6962.833{col 39}{space 1}    8.41{col 48}{space 3}0.000{col 56}{space 4} 44810.23{col 69}{space 3} 72323.02
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-788.5021{col 28}{space 2} 439.2789{col 39}{space 1}   -1.79{col 48}{space 3}0.075{col 56}{space 4}-1656.381{col 69}{space 3} 79.37673
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4243.587{col 28}{space 2} 8325.548{col 39}{space 1}   -0.51{col 48}{space 3}0.611{col 56}{space 4}-20692.29{col 69}{space 3} 12205.11
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-9.678976{col 28}{space 2} 5.909668{col 39}{space 1}   -1.64{col 48}{space 3}0.104{col 56}{space 4}-21.35465{col 69}{space 3} 1.996696
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 227.0774{col 28}{space 2} 534.5318{col 39}{space 1}    0.42{col 48}{space 3}0.672{col 56}{space 4}-828.9918{col 69}{space 3} 1283.147
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 416253.9{col 28}{space 2} 34919.04{col 39}{space 1}   11.92{col 48}{space 3}0.000{col 56}{space 4} 347264.7{col 69}{space 3} 485243.1
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. *********************LnNFLw3, MODELS 3-6***************************
. 
. ***********MODEL 3: MODEL 2+w1dxDiabetes w1Glucose******
. 
. //AFRICAN-AMERICAN//
. 
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0142
{txt}{col 49}Largest FMI{col 67}= {res}    0.1024
{txt}{col 49}Complete DF{col 67}= {res}        58
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     45.62
{txt}{col 49}        avg{col 67}= {res}     54.10
{txt}{col 49}        max{col 67}= {res}     56.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   56.0{txt}){col 67}= {res}      7.13
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-29484.47{col 26}{space 2} 25709.94{col 37}{space 1}   -1.15{col 46}{space 3}0.257{col 54}{space 4} -81035.9{col 67}{space 3} 22066.95
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 127926.5{col 26}{space 2} 20292.48{col 37}{space 1}    6.30{col 46}{space 3}0.000{col 54}{space 4} 87273.25{col 67}{space 3} 168579.8
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1611.577{col 26}{space 2} 1425.251{col 37}{space 1}   -1.13{col 46}{space 3}0.263{col 54}{space 4}-4468.426{col 67}{space 3} 1245.272
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 25002.48{col 26}{space 2} 24728.02{col 37}{space 1}    1.01{col 46}{space 3}0.316{col 54}{space 4}-24532.34{col 67}{space 3}  74537.3
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-21.32347{col 26}{space 2} 18.64527{col 37}{space 1}   -1.14{col 46}{space 3}0.258{col 54}{space 4}-58.67351{col 67}{space 3} 16.02658
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 192.0695{col 26}{space 2} 1632.014{col 37}{space 1}    0.12{col 46}{space 3}0.907{col 54}{space 4}-3077.191{col 67}{space 3}  3461.33
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-34144.69{col 26}{space 2} 19537.78{col 37}{space 1}   -1.75{col 46}{space 3}0.087{col 54}{space 4}-73481.12{col 67}{space 3} 5191.745
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 816.8327{col 26}{space 2} 553.0637{col 37}{space 1}    1.48{col 46}{space 3}0.146{col 54}{space 4}-292.2714{col 67}{space 3} 1925.937
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 996624.1{col 26}{space 2}  94705.7{col 37}{space 1}   10.52{col 46}{space 3}0.000{col 54}{space 4} 806878.2{col 67}{space 3}  1186370
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0077
{txt}{col 49}Largest FMI{col 67}= {res}    0.0330
{txt}{col 49}Complete DF{col 67}= {res}        58
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     53.70
{txt}{col 49}        avg{col 67}= {res}     55.37
{txt}{col 49}        max{col 67}= {res}     56.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   56.1{txt}){col 67}= {res}      7.83
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-17543.62{col 26}{space 2} 14473.07{col 37}{space 1}   -1.21{col 46}{space 3}0.231{col 54}{space 4}-46552.09{col 67}{space 3} 11464.84
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  67452.3{col 26}{space 2} 11507.02{col 37}{space 1}    5.86{col 46}{space 3}0.000{col 54}{space 4} 44397.11{col 67}{space 3} 90507.49
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1458.678{col 26}{space 2} 802.8901{col 37}{space 1}   -1.82{col 46}{space 3}0.075{col 54}{space 4}-3067.546{col 67}{space 3} 150.1894
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 13357.79{col 26}{space 2} 14000.47{col 37}{space 1}    0.95{col 46}{space 3}0.344{col 54}{space 4}-14688.34{col 67}{space 3} 41403.92
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}  -11.635{col 26}{space 2} 10.55169{col 37}{space 1}   -1.10{col 46}{space 3}0.275{col 54}{space 4}-32.77207{col 67}{space 3}  9.50207
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 51.30769{col 26}{space 2} 923.9754{col 37}{space 1}    0.06{col 46}{space 3}0.956{col 54}{space 4}-1799.641{col 67}{space 3} 1902.257
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} -25573.8{col 26}{space 2} 10684.01{col 37}{space 1}   -2.39{col 46}{space 3}0.020{col 54}{space 4}-46996.67{col 67}{space 3}-4150.932
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 555.5474{col 26}{space 2} 309.6049{col 37}{space 1}    1.79{col 46}{space 3}0.078{col 54}{space 4}-64.84262{col 67}{space 3} 1175.937
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 585994.9{col 26}{space 2} 53540.66{col 37}{space 1}   10.94{col 46}{space 3}0.000{col 54}{space 4} 478730.1{col 67}{space 3} 693259.7
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0213
{txt}{col 49}Largest FMI{col 67}= {res}    0.1694
{txt}{col 49}Complete DF{col 67}= {res}        58
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     36.99
{txt}{col 49}        avg{col 67}= {res}     52.74
{txt}{col 49}        max{col 67}= {res}     56.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   55.9{txt}){col 67}= {res}      4.42
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0003

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-10336.52{col 26}{space 2} 12302.38{col 37}{space 1}   -0.84{col 46}{space 3}0.405{col 54}{space 4}-35004.65{col 67}{space 3} 14331.61
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 50104.48{col 26}{space 2} 9692.192{col 37}{space 1}    5.17{col 46}{space 3}0.000{col 54}{space 4} 30688.95{col 67}{space 3} 69520.02
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-624.6759{col 26}{space 2} 683.3596{col 37}{space 1}   -0.91{col 46}{space 3}0.365{col 54}{space 4}-1994.665{col 67}{space 3}  745.313
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}  4008.98{col 26}{space 2} 11826.83{col 37}{space 1}    0.34{col 46}{space 3}0.736{col 54}{space 4} -19682.1{col 67}{space 3} 27700.06
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-6.706763{col 26}{space 2} 8.921966{col 37}{space 1}   -0.75{col 46}{space 3}0.455{col 54}{space 4}-24.57938{col 67}{space 3} 11.16586
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}   15.366{col 26}{space 2}  780.673{col 37}{space 1}    0.02{col 46}{space 3}0.984{col 54}{space 4}-1548.477{col 67}{space 3} 1579.209
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-9078.956{col 26}{space 2} 9670.826{col 37}{space 1}   -0.94{col 46}{space 3}0.354{col 54}{space 4}-28674.13{col 67}{space 3} 10516.22
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 259.2637{col 26}{space 2} 268.3274{col 37}{space 1}    0.97{col 46}{space 3}0.339{col 54}{space 4}-279.6068{col 67}{space 3} 798.1342
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 411369.4{col 26}{space 2} 45388.02{col 37}{space 1}    9.06{col 46}{space 3}0.000{col 54}{space 4} 320423.9{col 67}{space 3}   502315
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        87
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     85.07
{txt}{col 49}        avg{col 67}= {res}     85.07
{txt}{col 49}        max{col 67}= {res}     85.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   85.1{txt}){col 67}= {res}      9.44
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 23184.47{col 26}{space 2} 21790.86{col 37}{space 1}    1.06{col 46}{space 3}0.290{col 54}{space 4}-20141.12{col 67}{space 3} 66510.05
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 153088.9{col 26}{space 2}  19732.7{col 37}{space 1}    7.76{col 46}{space 3}0.000{col 54}{space 4} 113855.4{col 67}{space 3} 192322.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2455.928{col 26}{space 2}  1250.54{col 37}{space 1}   -1.96{col 46}{space 3}0.053{col 54}{space 4} -4942.31{col 67}{space 3} 30.45302
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-28338.54{col 26}{space 2}  23168.3{col 37}{space 1}   -1.22{col 46}{space 3}0.225{col 54}{space 4} -74402.8{col 67}{space 3} 17725.73
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.42095{col 26}{space 2} 16.01455{col 37}{space 1}   -0.90{col 46}{space 3}0.370{col 54}{space 4}-46.26181{col 67}{space 3} 17.41991
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 734.6118{col 26}{space 2} 1556.726{col 37}{space 1}    0.47{col 46}{space 3}0.638{col 54}{space 4}-2360.542{col 67}{space 3} 3829.765
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 29797.59{col 26}{space 2} 20175.63{col 37}{space 1}    1.48{col 46}{space 3}0.143{col 54}{space 4}-10316.53{col 67}{space 3}  69911.7
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-588.3429{col 26}{space 2} 431.4168{col 37}{space 1}   -1.36{col 46}{space 3}0.176{col 54}{space 4}-1446.105{col 67}{space 3} 269.4196
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1107511{col 26}{space 2} 102150.5{col 37}{space 1}   10.84{col 46}{space 3}0.000{col 54}{space 4} 904410.8{col 67}{space 3}  1310611
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        87
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     85.07
{txt}{col 49}        avg{col 67}= {res}     85.07
{txt}{col 49}        max{col 67}= {res}     85.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   85.1{txt}){col 67}= {res}     10.65
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 4785.567{col 26}{space 2} 11019.43{col 37}{space 1}    0.43{col 46}{space 3}0.665{col 54}{space 4}-17123.77{col 67}{space 3}  26694.9
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 80521.32{col 26}{space 2}  9978.64{col 37}{space 1}    8.07{col 46}{space 3}0.000{col 54}{space 4} 60681.33{col 67}{space 3} 100361.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1965.768{col 26}{space 2} 632.3865{col 37}{space 1}   -3.11{col 46}{space 3}0.003{col 54}{space 4}-3223.108{col 67}{space 3}-708.4286
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-18844.52{col 26}{space 2} 11715.99{col 37}{space 1}   -1.61{col 46}{space 3}0.111{col 54}{space 4}-42138.79{col 67}{space 3}  4449.74
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-1.314835{col 26}{space 2} 8.098408{col 37}{space 1}   -0.16{col 46}{space 3}0.871{col 54}{space 4}-17.41646{col 67}{space 3} 14.78679
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 574.7947{col 26}{space 2} 787.2216{col 37}{space 1}    0.73{col 46}{space 3}0.467{col 54}{space 4} -990.395{col 67}{space 3} 2139.985
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 14159.11{col 26}{space 2} 10202.63{col 37}{space 1}    1.39{col 46}{space 3}0.169{col 54}{space 4}-6126.222{col 67}{space 3} 34444.43
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-221.8161{col 26}{space 2} 218.1634{col 37}{space 1}   -1.02{col 46}{space 3}0.312{col 54}{space 4}-655.5785{col 67}{space 3} 211.9463
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 656280.4{col 26}{space 2} 51656.56{col 37}{space 1}   12.70{col 46}{space 3}0.000{col 54}{space 4} 553574.5{col 67}{space 3} 758986.3
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        87
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     85.07
{txt}{col 49}        avg{col 67}= {res}     85.07
{txt}{col 49}        max{col 67}= {res}     85.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   85.1{txt}){col 67}= {res}      6.28
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}  10830.4{col 26}{space 2} 11249.63{col 37}{space 1}    0.96{col 46}{space 3}0.338{col 54}{space 4}-11536.62{col 67}{space 3} 33197.42
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 63628.46{col 26}{space 2} 10187.09{col 37}{space 1}    6.25{col 46}{space 3}0.000{col 54}{space 4} 43374.02{col 67}{space 3}  83882.9
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-784.2319{col 26}{space 2} 645.5969{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}-2067.837{col 67}{space 3}  499.373
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-13098.11{col 26}{space 2} 11960.73{col 37}{space 1}   -1.10{col 46}{space 3}0.277{col 54}{space 4}-36878.99{col 67}{space 3} 10682.76
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-11.48525{col 26}{space 2} 8.267581{col 37}{space 1}   -1.39{col 46}{space 3}0.168{col 54}{space 4}-27.92323{col 67}{space 3} 4.952728
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 254.6406{col 26}{space 2} 803.6665{col 37}{space 1}    0.32{col 46}{space 3}0.752{col 54}{space 4}-1343.246{col 67}{space 3} 1852.527
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 10659.29{col 26}{space 2} 10415.76{col 37}{space 1}    1.02{col 46}{space 3}0.309{col 54}{space 4}-10049.79{col 67}{space 3} 31368.38
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-240.5368{col 26}{space 2} 222.7208{col 37}{space 1}   -1.08{col 46}{space 3}0.283{col 54}{space 4}-683.3604{col 67}{space 3} 202.2868
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 439403.3{col 26}{space 2} 52735.65{col 37}{space 1}    8.33{col 46}{space 3}0.000{col 54}{space 4} 334551.9{col 67}{space 3} 544254.7
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. //INTERACTION BY Race//
. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0074
{txt}{col 49}Largest FMI{col 67}= {res}    0.0786
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    116.15
{txt}{col 49}        avg{col 67}= {res}    145.79
{txt}{col 49}        max{col 67}= {res}    150.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  150.0{txt}){col 67}= {res}     14.20
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 22716.59{col 28}{space 2} 19642.33{col 39}{space 1}    1.16{col 48}{space 3}0.249{col 56}{space 4}-16094.97{col 69}{space 3} 61528.16
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 26580.15{col 28}{space 2} 62643.99{col 39}{space 1}    0.42{col 48}{space 3}0.672{col 56}{space 4}-97198.83{col 69}{space 3} 150359.1
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-43479.33{col 28}{space 2} 28496.83{col 39}{space 1}   -1.53{col 48}{space 3}0.129{col 56}{space 4}-99786.48{col 69}{space 3} 12827.82
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 145255.9{col 28}{space 2} 14342.45{col 39}{space 1}   10.13{col 48}{space 3}0.000{col 56}{space 4} 116916.5{col 69}{space 3} 173595.3
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2462.693{col 28}{space 2} 910.2179{col 39}{space 1}   -2.71{col 48}{space 3}0.008{col 56}{space 4}-4261.258{col 69}{space 3}-664.1284
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3156.358{col 28}{space 2} 16906.16{col 39}{space 1}   -0.19{col 48}{space 3}0.852{col 56}{space 4}-36561.32{col 69}{space 3}  30248.6
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-16.72059{col 28}{space 2} 12.11356{col 39}{space 1}   -1.38{col 48}{space 3}0.170{col 56}{space 4}-40.65601{col 69}{space 3}  7.21483
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 791.6824{col 28}{space 2} 1107.831{col 39}{space 1}    0.71{col 48}{space 3}0.476{col 56}{space 4}-1397.289{col 69}{space 3} 2980.654
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} 388.9963{col 28}{space 2} 14358.16{col 39}{space 1}    0.03{col 48}{space 3}0.978{col 56}{space 4}-28048.75{col 69}{space 3} 28826.74
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2}-51.74718{col 28}{space 2} 339.3108{col 39}{space 1}   -0.15{col 48}{space 3}0.879{col 56}{space 4}-722.5802{col 69}{space 3} 619.0858
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1048614{col 28}{space 2} 74723.74{col 39}{space 1}   14.03{col 48}{space 3}0.000{col 56}{space 4} 900954.5{col 69}{space 3}  1196274
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0033
{txt}{col 49}Largest FMI{col 67}= {res}    0.0358
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    138.82
{txt}{col 49}        avg{col 67}= {res}    148.58
{txt}{col 49}        max{col 67}= {res}    150.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  150.0{txt}){col 67}= {res}     16.36
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}  5422.35{col 28}{space 2} 10415.87{col 39}{space 1}    0.52{col 48}{space 3}0.603{col 56}{space 4}-15158.46{col 69}{space 3} 26003.16
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-8633.989{col 28}{space 2} 33227.79{col 39}{space 1}   -0.26{col 48}{space 3}0.795{col 56}{space 4}-74289.27{col 69}{space 3} 57021.29
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-17359.73{col 28}{space 2} 15115.33{col 39}{space 1}   -1.15{col 48}{space 3}0.253{col 56}{space 4}-47226.29{col 69}{space 3} 12506.83
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 76827.26{col 28}{space 2} 7606.729{col 39}{space 1}   10.10{col 48}{space 3}0.000{col 56}{space 4} 61797.04{col 69}{space 3} 91857.48
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2010.811{col 28}{space 2} 482.3949{col 39}{space 1}   -4.17{col 48}{space 3}0.000{col 56}{space 4}-2963.996{col 69}{space 3}-1057.627
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4182.453{col 28}{space 2} 8965.939{col 39}{space 1}   -0.47{col 48}{space 3}0.642{col 56}{space 4}-21898.27{col 69}{space 3} 13533.36
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-5.207971{col 28}{space 2} 6.422532{col 39}{space 1}   -0.81{col 48}{space 3}0.419{col 56}{space 4} -17.8983{col 69}{space 3} 7.482357
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 519.1095{col 28}{space 2} 587.5406{col 39}{space 1}    0.88{col 48}{space 3}0.378{col 56}{space 4} -641.816{col 69}{space 3} 1680.035
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-4236.175{col 28}{space 2} 7454.499{col 39}{space 1}   -0.57{col 48}{space 3}0.571{col 56}{space 4}-18975.21{col 69}{space 3} 10502.86
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 82.91906{col 28}{space 2} 178.3162{col 39}{space 1}    0.47{col 48}{space 3}0.643{col 56}{space 4}-269.4776{col 69}{space 3} 435.3157
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 629366.3{col 28}{space 2} 39555.47{col 39}{space 1}   15.91{col 48}{space 3}0.000{col 56}{space 4} 551205.4{col 69}{space 3} 707527.3
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0093
{txt}{col 49}Largest FMI{col 67}= {res}    0.0980
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    105.21
{txt}{col 49}        avg{col 67}= {res}    144.36
{txt}{col 49}        max{col 67}= {res}    149.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  149.9{txt}){col 67}= {res}      8.87
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 10226.38{col 28}{space 2}  9771.64{col 39}{space 1}    1.05{col 48}{space 3}0.297{col 56}{space 4}-9081.575{col 69}{space 3} 29534.34
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 20466.96{col 28}{space 2} 31159.95{col 39}{space 1}    0.66{col 48}{space 3}0.512{col 56}{space 4}-41102.29{col 69}{space 3} 82036.21
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-18304.33{col 28}{space 2} 14174.75{col 39}{space 1}   -1.29{col 48}{space 3}0.199{col 56}{space 4}-46312.34{col 69}{space 3} 9703.668
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}  58669.2{col 28}{space 2} 7134.439{col 39}{space 1}    8.22{col 48}{space 3}0.000{col 56}{space 4} 44572.18{col 69}{space 3} 72766.22
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-813.5718{col 28}{space 2} 452.9296{col 39}{space 1}   -1.80{col 48}{space 3}0.074{col 56}{space 4}-1708.554{col 69}{space 3} 81.41078
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4255.525{col 28}{space 2} 8410.206{col 39}{space 1}   -0.51{col 48}{space 3}0.614{col 56}{space 4} -20873.3{col 69}{space 3} 12362.25
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-9.609257{col 28}{space 2} 6.026755{col 39}{space 1}   -1.59{col 48}{space 3}0.113{col 56}{space 4}-21.51767{col 69}{space 3} 2.299158
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 240.6124{col 28}{space 2} 551.0835{col 39}{space 1}    0.44{col 48}{space 3}0.663{col 56}{space 4}-848.2783{col 69}{space 3} 1329.503
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} 1777.503{col 28}{space 2} 7212.503{col 39}{space 1}    0.25{col 48}{space 3}0.806{col 56}{space 4}-12523.23{col 69}{space 3} 16078.23
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2}-51.99397{col 28}{space 2} 169.5266{col 39}{space 1}   -0.31{col 48}{space 3}0.760{col 56}{space 4}-387.2432{col 69}{space 3} 283.2553
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 419597.5{col 28}{space 2} 37202.61{col 39}{space 1}   11.28{col 48}{space 3}0.000{col 56}{space 4} 346080.6{col 69}{space 3} 493114.3
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 4: MODEL 2+liver/kidney disease******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.1095
{txt}{col 49}Largest FMI{col 67}= {res}    0.6122
{txt}{col 49}Complete DF{col 67}= {res}        55
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      8.58
{txt}{col 49}        avg{col 67}= {res}     45.60
{txt}{col 49}        max{col 67}= {res}     52.93
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   51.6{txt}){col 67}= {res}      4.75
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-21106.74{col 26}{space 2} 26303.63{col 37}{space 1}   -0.80{col 46}{space 3}0.426{col 54}{space 4}-73881.76{col 67}{space 3} 31668.28
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 167478.9{col 26}{space 2} 30863.04{col 37}{space 1}    5.43{col 46}{space 3}0.000{col 54}{space 4} 103862.9{col 67}{space 3} 231094.9
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1743.946{col 26}{space 2} 1551.212{col 37}{space 1}   -1.12{col 46}{space 3}0.266{col 54}{space 4}-4855.609{col 67}{space 3} 1367.718
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 25214.25{col 26}{space 2} 25385.07{col 37}{space 1}    0.99{col 46}{space 3}0.325{col 54}{space 4}-25707.18{col 67}{space 3} 76135.67
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-17.86296{col 26}{space 2} 19.28698{col 37}{space 1}   -0.93{col 46}{space 3}0.359{col 54}{space 4} -56.5593{col 67}{space 3} 20.83338
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1980.781{col 26}{space 2} 1895.379{col 37}{space 1}    1.05{col 46}{space 3}0.301{col 54}{space 4}-1828.218{col 67}{space 3} 5789.781
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-55232.39{col 26}{space 2} 69693.64{col 37}{space 1}   -0.79{col 46}{space 3}0.449{col 54}{space 4}-214071.7{col 67}{space 3} 103606.9
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}   143930{col 26}{space 2}  1619319{col 37}{space 1}    0.09{col 46}{space 3}0.930{col 54}{space 4} -3104992{col 67}{space 3}  3392852
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 26.40974{col 26}{space 2} 3777.046{col 37}{space 1}    0.01{col 46}{space 3}0.994{col 54}{space 4}-7574.417{col 67}{space 3} 7627.237
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 698.7143{col 26}{space 2} 574.3849{col 37}{space 1}    1.22{col 46}{space 3}0.229{col 54}{space 4}-454.4453{col 67}{space 3} 1851.874
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-11280.18{col 26}{space 2} 9031.599{col 37}{space 1}   -1.25{col 46}{space 3}0.217{col 54}{space 4}-29395.84{col 67}{space 3} 6835.489
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 850238.9{col 26}{space 2}  1644862{col 37}{space 1}    0.52{col 46}{space 3}0.607{col 54}{space 4} -2449907{col 67}{space 3}  4150385
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0877
{txt}{col 49}Largest FMI{col 67}= {res}    0.5667
{txt}{col 49}Complete DF{col 67}= {res}        55
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      9.84
{txt}{col 49}        avg{col 67}= {res}     46.78
{txt}{col 49}        max{col 67}= {res}     52.96
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   52.1{txt}){col 67}= {res}      4.72
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-13361.58{col 26}{space 2} 15267.11{col 37}{space 1}   -0.88{col 46}{space 3}0.385{col 54}{space 4}-43985.47{col 67}{space 3} 17262.32
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 86542.33{col 26}{space 2} 17400.56{col 37}{space 1}    4.97{col 46}{space 3}0.000{col 54}{space 4} 51012.31{col 67}{space 3} 122072.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -1823.45{col 26}{space 2} 903.7834{col 37}{space 1}   -2.02{col 46}{space 3}0.049{col 54}{space 4}-3636.349{col 67}{space 3}-10.55097
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 14511.11{col 26}{space 2} 14807.71{col 37}{space 1}    0.98{col 46}{space 3}0.332{col 54}{space 4}-15193.72{col 67}{space 3} 44215.94
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -9.34922{col 26}{space 2} 11.21326{col 37}{space 1}   -0.83{col 46}{space 3}0.408{col 54}{space 4} -31.8434{col 67}{space 3} 13.14496
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 865.5422{col 26}{space 2} 1094.797{col 37}{space 1}    0.79{col 46}{space 3}0.433{col 54}{space 4}-1332.602{col 67}{space 3} 3063.686
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-12927.38{col 26}{space 2} 38738.75{col 37}{space 1}   -0.33{col 46}{space 3}0.746{col 54}{space 4}-99434.07{col 67}{space 3} 73579.31
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-162918.4{col 26}{space 2} 939339.5{col 37}{space 1}   -0.17{col 46}{space 3}0.863{col 54}{space 4} -2047032{col 67}{space 3}  1721195
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 1187.884{col 26}{space 2} 2176.393{col 37}{space 1}    0.55{col 46}{space 3}0.588{col 54}{space 4}-3185.643{col 67}{space 3} 5561.411
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}  415.016{col 26}{space 2} 333.2557{col 37}{space 1}    1.25{col 46}{space 3}0.219{col 54}{space 4}-253.7879{col 67}{space 3}  1083.82
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-6806.859{col 26}{space 2} 5267.677{col 37}{space 1}   -1.29{col 46}{space 3}0.202{col 54}{space 4}-17373.09{col 67}{space 3} 3759.371
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 751765.8{col 26}{space 2}   954309{col 37}{space 1}    0.79{col 46}{space 3}0.434{col 54}{space 4} -1162376{col 67}{space 3}  2665908
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.1161
{txt}{col 49}Largest FMI{col 67}= {res}    0.6137
{txt}{col 49}Complete DF{col 67}= {res}        55
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      8.54
{txt}{col 49}        avg{col 67}= {res}     45.11
{txt}{col 49}        max{col 67}= {res}     52.89
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   51.5{txt}){col 67}= {res}      3.22
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0022

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-7493.207{col 26}{space 2} 12425.71{col 37}{space 1}   -0.60{col 46}{space 3}0.549{col 54}{space 4}-32429.15{col 67}{space 3} 17442.73
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 67102.63{col 26}{space 2} 14543.52{col 37}{space 1}    4.61{col 46}{space 3}0.000{col 54}{space 4} 37119.27{col 67}{space 3} 97085.99
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-606.2216{col 26}{space 2} 733.5121{col 37}{space 1}   -0.83{col 46}{space 3}0.412{col 54}{space 4}-2077.983{col 67}{space 3} 865.5401
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 3641.831{col 26}{space 2} 11966.15{col 37}{space 1}    0.30{col 46}{space 3}0.762{col 54}{space 4} -20363.1{col 67}{space 3} 27646.76
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -5.73335{col 26}{space 2} 9.115668{col 37}{space 1}   -0.63{col 46}{space 3}0.532{col 54}{space 4}-24.02697{col 67}{space 3} 12.56027
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 778.6048{col 26}{space 2} 899.5319{col 37}{space 1}    0.87{col 46}{space 3}0.391{col 54}{space 4}-1030.792{col 67}{space 3} 2588.001
{txt}w1Creatinine {c |}{col 14}{res}{space 2} -33874.4{col 26}{space 2} 32895.52{col 37}{space 1}   -1.03{col 46}{space 3}0.331{col 54}{space 4}  -108901{col 67}{space 3} 41152.22
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 102164.6{col 26}{space 2} 765831.2{col 37}{space 1}    0.13{col 46}{space 3}0.894{col 54}{space 4} -1434808{col 67}{space 3}  1639137
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-162.5327{col 26}{space 2} 1780.532{col 37}{space 1}   -0.09{col 46}{space 3}0.928{col 54}{space 4}-3746.152{col 67}{space 3} 3421.086
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 241.9636{col 26}{space 2} 271.7268{col 37}{space 1}    0.89{col 46}{space 3}0.377{col 54}{space 4}-303.7988{col 67}{space 3} 787.7259
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-3683.617{col 26}{space 2} 4254.443{col 37}{space 1}   -0.87{col 46}{space 3}0.390{col 54}{space 4}-12217.37{col 67}{space 3} 4850.139
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   309663{col 26}{space 2} 777732.3{col 37}{space 1}    0.40{col 46}{space 3}0.692{col 54}{space 4} -1251157{col 67}{space 3}  1870482
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0213
{txt}{col 49}Largest FMI{col 67}= {res}    0.2145
{txt}{col 49}Complete DF{col 67}= {res}        84
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     40.48
{txt}{col 49}        avg{col 67}= {res}     77.05
{txt}{col 49}        max{col 67}= {res}     82.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   81.9{txt}){col 67}= {res}      7.87
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 23067.37{col 26}{space 2} 21207.05{col 37}{space 1}    1.09{col 46}{space 3}0.280{col 54}{space 4}-19123.55{col 67}{space 3}  65258.3
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 182854.7{col 26}{space 2} 25730.79{col 37}{space 1}    7.11{col 46}{space 3}0.000{col 54}{space 4} 131583.7{col 67}{space 3} 234125.8
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -2115.63{col 26}{space 2}  1227.35{col 37}{space 1}   -1.72{col 46}{space 3}0.089{col 54}{space 4} -4557.25{col 67}{space 3} 325.9903
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -24563.2{col 26}{space 2} 22763.36{col 37}{space 1}   -1.08{col 46}{space 3}0.284{col 54}{space 4}-69847.07{col 67}{space 3} 20720.68
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-24.85939{col 26}{space 2} 15.77923{col 37}{space 1}   -1.58{col 46}{space 3}0.119{col 54}{space 4}-56.25171{col 67}{space 3} 6.532923
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 2456.991{col 26}{space 2} 1644.725{col 37}{space 1}    1.49{col 46}{space 3}0.139{col 54}{space 4}-814.9075{col 67}{space 3}  5728.89
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 14450.49{col 26}{space 2} 63234.34{col 37}{space 1}    0.23{col 46}{space 3}0.820{col 54}{space 4}  -113304{col 67}{space 3}   142205
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}  2108921{col 26}{space 2}  1893185{col 37}{space 1}    1.11{col 46}{space 3}0.269{col 54}{space 4} -1658332{col 67}{space 3}  5876175
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-12.81054{col 26}{space 2} 2732.716{col 37}{space 1}   -0.00{col 46}{space 3}0.996{col 54}{space 4}-5454.611{col 67}{space 3}  5428.99
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 121.8372{col 26}{space 2} 446.6321{col 37}{space 1}    0.27{col 46}{space 3}0.786{col 54}{space 4}-766.7101{col 67}{space 3} 1010.385
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-23052.68{col 26}{space 2} 7860.319{col 37}{space 1}   -2.93{col 46}{space 3}0.004{col 54}{space 4}-38689.34{col 67}{space 3}-7416.025
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -1080671{col 26}{space 2}  1899720{col 37}{space 1}   -0.57{col 46}{space 3}0.571{col 54}{space 4} -4860983{col 67}{space 3}  2699640
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0304
{txt}{col 49}Largest FMI{col 67}= {res}    0.2804
{txt}{col 49}Complete DF{col 67}= {res}        84
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     30.95
{txt}{col 49}        avg{col 67}= {res}     76.24
{txt}{col 49}        max{col 67}= {res}     82.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   81.7{txt}){col 67}= {res}      8.26
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 3983.586{col 26}{space 2} 10891.09{col 37}{space 1}    0.37{col 46}{space 3}0.715{col 54}{space 4}-17684.99{col 67}{space 3} 25652.16
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 92182.66{col 26}{space 2} 13231.97{col 37}{space 1}    6.97{col 46}{space 3}0.000{col 54}{space 4} 65810.29{col 67}{space 3}   118555
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1884.819{col 26}{space 2} 629.9325{col 37}{space 1}   -2.99{col 46}{space 3}0.004{col 54}{space 4}-3137.995{col 67}{space 3}-631.6426
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-17254.83{col 26}{space 2} 11670.39{col 37}{space 1}   -1.48{col 46}{space 3}0.143{col 54}{space 4}-40470.75{col 67}{space 3} 5961.095
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -6.47528{col 26}{space 2} 8.096818{col 37}{space 1}   -0.80{col 46}{space 3}0.426{col 54}{space 4}-22.58389{col 67}{space 3}  9.63333
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1282.648{col 26}{space 2} 844.3755{col 37}{space 1}    1.52{col 46}{space 3}0.133{col 54}{space 4}-397.1398{col 67}{space 3} 2962.436
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 12276.21{col 26}{space 2} 33656.52{col 37}{space 1}    0.36{col 46}{space 3}0.718{col 54}{space 4}-56371.28{col 67}{space 3} 80923.69
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 985306.9{col 26}{space 2} 965855.2{col 37}{space 1}    1.02{col 46}{space 3}0.311{col 54}{space 4}-936210.4{col 67}{space 3}  2906824
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}  224.906{col 26}{space 2} 1404.613{col 37}{space 1}    0.16{col 46}{space 3}0.873{col 54}{space 4}-2572.623{col 67}{space 3} 3022.435
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}  186.131{col 26}{space 2} 229.3114{col 37}{space 1}    0.81{col 46}{space 3}0.419{col 54}{space 4}-270.0858{col 67}{space 3} 642.3478
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-9457.111{col 26}{space 2} 4036.137{col 37}{space 1}   -2.34{col 46}{space 3}0.022{col 54}{space 4}-17486.54{col 67}{space 3}-1427.682
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-373401.7{col 26}{space 2} 969161.1{col 37}{space 1}   -0.39{col 46}{space 3}0.701{col 54}{space 4} -2301514{col 67}{space 3}  1554711
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0060
{txt}{col 49}Largest FMI{col 67}= {res}    0.0604
{txt}{col 49}Complete DF{col 67}= {res}        84
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     72.79
{txt}{col 49}        avg{col 67}= {res}     81.07
{txt}{col 49}        max{col 67}= {res}     82.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   82.0{txt}){col 67}= {res}      5.60
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 12096.35{col 26}{space 2} 10925.07{col 37}{space 1}    1.11{col 46}{space 3}0.271{col 54}{space 4}-9637.846{col 67}{space 3} 33830.55
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 80273.46{col 26}{space 2} 12993.02{col 37}{space 1}    6.18{col 46}{space 3}0.000{col 54}{space 4} 54421.35{col 67}{space 3} 106125.6
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-605.8772{col 26}{space 2} 632.6773{col 37}{space 1}   -0.96{col 46}{space 3}0.341{col 54}{space 4}-1864.461{col 67}{space 3} 652.7066
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-10940.81{col 26}{space 2} 11735.52{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4} -34286.2{col 67}{space 3} 12404.59
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.42749{col 26}{space 2} 8.120945{col 37}{space 1}   -1.90{col 46}{space 3}0.061{col 54}{space 4}-31.58262{col 67}{space 3} .7276377
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1168.769{col 26}{space 2}  848.109{col 37}{space 1}    1.38{col 46}{space 3}0.172{col 54}{space 4}-518.3783{col 67}{space 3} 2855.917
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-388.5573{col 26}{space 2} 30130.06{col 37}{space 1}   -0.01{col 46}{space 3}0.990{col 54}{space 4}-60440.65{col 67}{space 3} 59663.54
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 713484.8{col 26}{space 2} 970518.9{col 37}{space 1}    0.74{col 46}{space 3}0.464{col 54}{space 4} -1217257{col 67}{space 3}  2644227
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-94.26669{col 26}{space 2} 1385.885{col 37}{space 1}   -0.07{col 46}{space 3}0.946{col 54}{space 4}-2851.402{col 67}{space 3} 2662.868
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} 8.312657{col 26}{space 2} 230.3047{col 37}{space 1}    0.04{col 46}{space 3}0.971{col 54}{space 4}-449.8593{col 67}{space 3} 466.4846
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-11613.14{col 26}{space 2} 4053.836{col 37}{space 1}   -2.86{col 46}{space 3}0.005{col 54}{space 4}-19677.44{col 67}{space 3}-3548.833
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-301224.7{col 26}{space 2} 973566.2{col 37}{space 1}   -0.31{col 46}{space 3}0.758{col 54}{space 4} -2238028{col 67}{space 3}  1635578
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. **INTERACTION BY Race**
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0241
{txt}{col 49}Largest FMI{col 67}= {res}    0.2515
{txt}{col 49}Complete DF{col 67}= {res}       149
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     45.46
{txt}{col 49}        avg{col 67}= {res}    137.18
{txt}{col 49}        max{col 67}= {res}    146.83
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  146.6{txt}){col 67}= {res}     12.47
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 24066.59{col 28}{space 2}  18750.7{col 39}{space 1}    1.28{col 48}{space 3}0.201{col 56}{space 4}-12989.77{col 69}{space 3} 61122.96
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 22565.61{col 28}{space 2} 60764.39{col 39}{space 1}    0.37{col 48}{space 3}0.711{col 56}{space 4}-97530.14{col 69}{space 3} 142661.4
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-37775.42{col 28}{space 2} 27417.16{col 39}{space 1}   -1.38{col 48}{space 3}0.170{col 56}{space 4}-91960.93{col 69}{space 3} 16410.09
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 177006.8{col 28}{space 2} 18240.36{col 39}{space 1}    9.70{col 48}{space 3}0.000{col 56}{space 4} 140914.7{col 69}{space 3} 213098.8
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -1937.11{col 28}{space 2} 897.4539{col 39}{space 1}   -2.16{col 48}{space 3}0.033{col 56}{space 4} -3710.74{col 69}{space 3}-163.4788
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-2700.272{col 28}{space 2}  16531.2{col 39}{space 1}   -0.16{col 48}{space 3}0.870{col 56}{space 4} -35370.1{col 69}{space 3} 29969.56
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-17.62272{col 28}{space 2} 11.71601{col 39}{space 1}   -1.50{col 48}{space 3}0.135{col 56}{space 4}-40.77719{col 69}{space 3} 5.531738
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2250.683{col 28}{space 2} 1192.022{col 39}{space 1}    1.89{col 48}{space 3}0.061{col 56}{space 4}-105.1852{col 69}{space 3} 4606.551
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-30681.53{col 28}{space 2}  39753.8{col 39}{space 1}   -0.77{col 48}{space 3}0.444{col 56}{space 4}-110727.5{col 69}{space 3}  49364.4
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} 778522.2{col 28}{space 2}  1198472{col 39}{space 1}    0.65{col 48}{space 3}0.517{col 56}{space 4} -1590013{col 69}{space 3}  3147057
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2}   372.98{col 28}{space 2} 2107.373{col 39}{space 1}    0.18{col 48}{space 3}0.860{col 56}{space 4}-3794.121{col 69}{space 3} 4540.081
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 292.6561{col 28}{space 2} 337.6685{col 39}{space 1}    0.87{col 48}{space 3}0.388{col 56}{space 4}-374.6666{col 69}{space 3} 959.9788
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-17996.88{col 28}{space 2} 5790.678{col 39}{space 1}   -3.11{col 48}{space 3}0.002{col 56}{space 4}-29440.83{col 69}{space 3}-6552.938
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 231230.3{col 28}{space 2}  1206576{col 39}{space 1}    0.19{col 48}{space 3}0.848{col 56}{space 4} -2153321{col 69}{space 3}  2615782
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0191
{txt}{col 49}Largest FMI{col 67}= {res}    0.2232
{txt}{col 49}Complete DF{col 67}= {res}       149
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     52.54
{txt}{col 49}        avg{col 67}= {res}    138.21
{txt}{col 49}        max{col 67}= {res}    146.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  146.7{txt}){col 67}= {res}     13.73
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 4974.304{col 28}{space 2} 10042.65{col 39}{space 1}    0.50{col 48}{space 3}0.621{col 56}{space 4}-14872.59{col 69}{space 3}  24821.2
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-9038.119{col 28}{space 2}  32502.1{col 39}{space 1}   -0.28{col 48}{space 3}0.781{col 56}{space 4}-73273.36{col 69}{space 3} 55197.12
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-15273.44{col 28}{space 2} 14668.12{col 39}{space 1}   -1.04{col 48}{space 3}0.299{col 56}{space 4}-44261.76{col 69}{space 3} 13714.88
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 90462.01{col 28}{space 2} 9747.609{col 39}{space 1}    9.28{col 48}{space 3}0.000{col 56}{space 4} 71177.97{col 69}{space 3} 109746.1
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-1906.518{col 28}{space 2} 480.0128{col 39}{space 1}   -3.97{col 48}{space 3}0.000{col 56}{space 4}-2855.136{col 69}{space 3}-957.8997
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3834.442{col 28}{space 2} 8853.092{col 39}{space 1}   -0.43{col 48}{space 3}0.666{col 56}{space 4} -21330.3{col 69}{space 3} 13661.41
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-5.520893{col 28}{space 2} 6.271484{col 39}{space 1}   -0.88{col 48}{space 3}0.380{col 56}{space 4} -17.9151{col 69}{space 3} 6.873312
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1122.881{col 28}{space 2} 637.0606{col 39}{space 1}    1.76{col 48}{space 3}0.080{col 56}{space 4}-136.1186{col 69}{space 3}  2381.88
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-6027.905{col 28}{space 2} 20958.36{col 39}{space 1}   -0.29{col 48}{space 3}0.775{col 56}{space 4}-48073.64{col 69}{space 3} 36017.83
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} 317337.3{col 28}{space 2} 643358.3{col 39}{space 1}    0.49{col 48}{space 3}0.623{col 56}{space 4}-954192.2{col 69}{space 3}  1588867
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 677.3781{col 28}{space 2} 1124.375{col 39}{space 1}    0.60{col 48}{space 3}0.548{col 56}{space 4}-1545.497{col 69}{space 3} 2900.253
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 267.3243{col 28}{space 2} 180.7384{col 39}{space 1}    1.48{col 48}{space 3}0.141{col 56}{space 4}-89.85764{col 69}{space 3} 624.5062
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-8300.245{col 28}{space 2} 3099.469{col 39}{space 1}   -2.68{col 48}{space 3}0.008{col 56}{space 4}-14425.54{col 69}{space 3}-2174.949
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 291668.4{col 28}{space 2} 647797.6{col 39}{space 1}    0.45{col 48}{space 3}0.653{col 56}{space 4}-988639.5{col 69}{space 3}  1571976
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0391
{txt}{col 49}Largest FMI{col 67}= {res}    0.3475
{txt}{col 49}Complete DF{col 67}= {res}       149
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     29.05
{txt}{col 49}        avg{col 67}= {res}    132.36
{txt}{col 49}        max{col 67}= {res}    146.74
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  146.0{txt}){col 67}= {res}      7.90
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 12172.49{col 28}{space 2} 9409.995{col 39}{space 1}    1.29{col 48}{space 3}0.198{col 56}{space 4}-6426.495{col 69}{space 3} 30771.47
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 19887.16{col 28}{space 2} 30458.87{col 39}{space 1}    0.65{col 48}{space 3}0.515{col 56}{space 4}-40319.56{col 69}{space 3} 80093.88
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-16247.99{col 28}{space 2} 13730.73{col 39}{space 1}   -1.18{col 48}{space 3}0.239{col 56}{space 4}-43386.63{col 69}{space 3} 10890.66
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 75030.49{col 28}{space 2} 9259.976{col 39}{space 1}    8.10{col 48}{space 3}0.000{col 56}{space 4} 56679.57{col 69}{space 3} 93381.42
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-527.3878{col 28}{space 2} 450.0889{col 39}{space 1}   -1.17{col 48}{space 3}0.243{col 56}{space 4}-1416.995{col 69}{space 3} 362.2191
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3850.953{col 28}{space 2} 8257.281{col 39}{space 1}   -0.47{col 48}{space 3}0.642{col 56}{space 4}-20169.51{col 69}{space 3}  12467.6
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-10.00651{col 28}{space 2} 5.857145{col 39}{space 1}   -1.71{col 48}{space 3}0.090{col 56}{space 4}-21.58234{col 69}{space 3} 1.569325
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1005.837{col 28}{space 2} 599.0167{col 39}{space 1}    1.68{col 48}{space 3}0.095{col 56}{space 4}-178.2792{col 69}{space 3} 2189.953
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}   -21654{col 28}{space 2} 21026.25{col 39}{space 1}   -1.03{col 48}{space 3}0.312{col 56}{space 4}-64654.33{col 69}{space 3} 21346.34
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}   211285{col 28}{space 2} 603200.3{col 39}{space 1}    0.35{col 48}{space 3}0.727{col 56}{space 4}-981102.5{col 69}{space 3}  1403672
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 1.875644{col 28}{space 2} 1066.303{col 39}{space 1}    0.00{col 48}{space 3}0.999{col 56}{space 4}-2108.554{col 69}{space 3} 2112.305
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2} 75.38976{col 28}{space 2} 168.8291{col 39}{space 1}    0.45{col 48}{space 3}0.656{col 56}{space 4}-258.2699{col 69}{space 3} 409.0495
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-8306.682{col 28}{space 2} 2894.266{col 39}{space 1}   -2.87{col 48}{space 3}0.005{col 56}{space 4}-14026.64{col 69}{space 3}-2586.722
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 194069.6{col 28}{space 2}   607248{col 39}{space 1}    0.32{col 48}{space 3}0.750{col 56}{space 4} -1006317{col 69}{space 3}  1394456
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 5: MODEL2+OXIDATIVE STRESS******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0309
{txt}{col 49}Largest FMI{col 67}= {res}    0.2529
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     27.49
{txt}{col 49}        avg{col 67}= {res}     51.97
{txt}{col 49}        max{col 67}= {res}     55.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   54.8{txt}){col 67}= {res}      5.51
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-16937.98{col 26}{space 2}  25858.3{col 37}{space 1}   -0.66{col 46}{space 3}0.515{col 54}{space 4}-68776.41{col 67}{space 3} 34900.45
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 127607.9{col 26}{space 2} 21411.54{col 37}{space 1}    5.96{col 46}{space 3}0.000{col 54}{space 4} 84696.83{col 67}{space 3} 170519.1
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2539.304{col 26}{space 2} 1397.017{col 37}{space 1}   -1.82{col 46}{space 3}0.075{col 54}{space 4}-5339.249{col 67}{space 3} 260.6422
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 25216.31{col 26}{space 2}  25874.3{col 37}{space 1}    0.97{col 46}{space 3}0.334{col 54}{space 4}-26644.73{col 67}{space 3} 77077.35
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-14.01173{col 26}{space 2} 20.22897{col 37}{space 1}   -0.69{col 46}{space 3}0.491{col 54}{space 4}-54.56766{col 67}{space 3} 26.54419
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 915.2634{col 26}{space 2} 1725.174{col 37}{space 1}    0.53{col 46}{space 3}0.598{col 54}{space 4}-2542.032{col 67}{space 3} 4372.559
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 651.6104{col 26}{space 2} 1866.755{col 37}{space 1}    0.35{col 46}{space 3}0.730{col 54}{space 4}-3175.481{col 67}{space 3} 4478.702
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 20383.11{col 26}{space 2} 38495.71{col 37}{space 1}    0.53{col 46}{space 3}0.599{col 54}{space 4}-56763.42{col 67}{space 3} 97529.63
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 2102.373{col 26}{space 2} 5783.516{col 37}{space 1}    0.36{col 46}{space 3}0.718{col 54}{space 4}-9488.187{col 67}{space 3} 13692.93
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 939962.4{col 26}{space 2} 209903.2{col 37}{space 1}    4.48{col 46}{space 3}0.000{col 54}{space 4} 519244.4{col 67}{space 3}  1360680
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0253
{txt}{col 49}Largest FMI{col 67}= {res}    0.2176
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     31.02
{txt}{col 49}        avg{col 67}= {res}     52.42
{txt}{col 49}        max{col 67}= {res}     55.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   54.9{txt}){col 67}= {res}      5.65
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-7019.624{col 26}{space 2} 14899.08{col 37}{space 1}   -0.47{col 46}{space 3}0.639{col 54}{space 4}-36889.06{col 67}{space 3} 22849.81
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 66333.34{col 26}{space 2} 12321.61{col 37}{space 1}    5.38{col 46}{space 3}0.000{col 54}{space 4} 41640.34{col 67}{space 3} 91026.33
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2102.289{col 26}{space 2} 803.4807{col 37}{space 1}   -2.62{col 46}{space 3}0.011{col 54}{space 4}-3712.542{col 67}{space 3}-492.0357
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 12433.58{col 26}{space 2} 14887.55{col 37}{space 1}    0.84{col 46}{space 3}0.407{col 54}{space 4}-17404.77{col 67}{space 3} 42271.93
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-7.346229{col 26}{space 2} 11.62912{col 37}{space 1}   -0.63{col 46}{space 3}0.530{col 54}{space 4}-30.65822{col 67}{space 3} 15.96576
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 502.7627{col 26}{space 2} 993.0502{col 37}{space 1}    0.51{col 46}{space 3}0.615{col 54}{space 4}-1487.293{col 67}{space 3} 2492.818
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 5.280335{col 26}{space 2} 1054.468{col 37}{space 1}    0.01{col 46}{space 3}0.996{col 54}{space 4}-2145.251{col 67}{space 3} 2155.812
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 11610.41{col 26}{space 2} 22159.42{col 37}{space 1}    0.52{col 46}{space 3}0.602{col 54}{space 4}-32796.81{col 67}{space 3} 56017.64
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 2456.338{col 26}{space 2} 3328.781{col 37}{space 1}    0.74{col 46}{space 3}0.464{col 54}{space 4}-4214.585{col 67}{space 3}  9127.26
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 562660.4{col 26}{space 2} 120665.9{col 37}{space 1}    4.66{col 46}{space 3}0.000{col 54}{space 4} 320827.5{col 67}{space 3} 804493.3
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0194
{txt}{col 49}Largest FMI{col 67}= {res}    0.1583
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     37.83
{txt}{col 49}        avg{col 67}= {res}     53.09
{txt}{col 49}        max{col 67}= {res}     54.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   55.0{txt}){col 67}= {res}      3.76
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0010

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} -7746.62{col 26}{space 2} 12082.67{col 37}{space 1}   -0.64{col 46}{space 3}0.524{col 54}{space 4}-31962.94{col 67}{space 3}  16469.7
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  50561.9{col 26}{space 2} 10055.55{col 37}{space 1}    5.03{col 46}{space 3}0.000{col 54}{space 4} 30408.67{col 67}{space 3} 70715.13
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-893.6316{col 26}{space 2} 655.3507{col 37}{space 1}   -1.36{col 46}{space 3}0.178{col 54}{space 4}-2207.082{col 67}{space 3} 419.8187
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 4765.397{col 26}{space 2} 12135.13{col 37}{space 1}    0.39{col 46}{space 3}0.696{col 54}{space 4}-19556.88{col 67}{space 3} 29087.67
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-3.916557{col 26}{space 2} 9.460423{col 37}{space 1}   -0.41{col 46}{space 3}0.681{col 54}{space 4}-22.87928{col 67}{space 3} 15.04616
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 280.8179{col 26}{space 2} 810.0482{col 37}{space 1}    0.35{col 46}{space 3}0.730{col 54}{space 4}-1342.587{col 67}{space 3} 1904.223
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 480.5137{col 26}{space 2} 832.6168{col 37}{space 1}    0.58{col 46}{space 3}0.567{col 54}{space 4}-1205.275{col 67}{space 3} 2166.302
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 9187.302{col 26}{space 2} 18111.35{col 37}{space 1}    0.51{col 46}{space 3}0.614{col 54}{space 4} -27113.1{col 67}{space 3}  45487.7
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-27.51426{col 26}{space 2} 2713.465{col 37}{space 1}   -0.01{col 46}{space 3}0.992{col 54}{space 4}-5465.431{col 67}{space 3} 5410.402
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 377517.5{col 26}{space 2} 98436.98{col 37}{space 1}    3.84{col 46}{space 3}0.000{col 54}{space 4} 180222.9{col 67}{space 3} 574812.1
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0043
{txt}{col 49}Largest FMI{col 67}= {res}    0.0197
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     81.92
{txt}{col 49}        avg{col 67}= {res}     83.60
{txt}{col 49}        max{col 67}= {res}     84.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.0{txt}){col 67}= {res}      8.16
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 16046.36{col 26}{space 2} 20722.85{col 37}{space 1}    0.77{col 46}{space 3}0.441{col 54}{space 4}-25163.01{col 67}{space 3} 57255.73
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 158350.6{col 26}{space 2} 20060.41{col 37}{space 1}    7.89{col 46}{space 3}0.000{col 54}{space 4} 118458.3{col 67}{space 3} 198242.9
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -2276.04{col 26}{space 2}  1257.62{col 37}{space 1}   -1.81{col 46}{space 3}0.074{col 54}{space 4}-4776.949{col 67}{space 3} 224.8698
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-25569.53{col 26}{space 2} 23296.59{col 37}{space 1}   -1.10{col 46}{space 3}0.276{col 54}{space 4}-71896.96{col 67}{space 3}  20757.9
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-15.05583{col 26}{space 2} 16.32566{col 37}{space 1}   -0.92{col 46}{space 3}0.359{col 54}{space 4}-47.52105{col 67}{space 3}  17.4094
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 770.8042{col 26}{space 2} 1590.928{col 37}{space 1}    0.48{col 46}{space 3}0.629{col 54}{space 4}-2392.956{col 67}{space 3} 3934.564
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 502.7599{col 26}{space 2} 974.0372{col 37}{space 1}    0.52{col 46}{space 3}0.607{col 54}{space 4}-1434.913{col 67}{space 3} 2440.433
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-1537.088{col 26}{space 2} 40976.37{col 37}{space 1}   -0.04{col 46}{space 3}0.970{col 54}{space 4}-83022.53{col 67}{space 3} 79948.35
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-6289.665{col 26}{space 2} 4911.031{col 37}{space 1}   -1.28{col 46}{space 3}0.204{col 54}{space 4}-16059.41{col 67}{space 3} 3480.076
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1067895{col 26}{space 2}   217247{col 37}{space 1}    4.92{col 46}{space 3}0.000{col 54}{space 4} 635874.6{col 67}{space 3}  1499915
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0044
{txt}{col 49}Largest FMI{col 67}= {res}    0.0311
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     80.15
{txt}{col 49}        avg{col 67}= {res}     83.53
{txt}{col 49}        max{col 67}= {res}     84.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.0{txt}){col 67}= {res}      9.12
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 3026.068{col 26}{space 2} 10504.59{col 37}{space 1}    0.29{col 46}{space 3}0.774{col 54}{space 4}-17863.27{col 67}{space 3} 23915.41
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 81604.57{col 26}{space 2} 10168.25{col 37}{space 1}    8.03{col 46}{space 3}0.000{col 54}{space 4} 61383.99{col 67}{space 3} 101825.2
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1835.105{col 26}{space 2} 637.4337{col 37}{space 1}   -2.88{col 46}{space 3}0.005{col 54}{space 4}-3102.702{col 67}{space 3}-567.5078
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-17942.37{col 26}{space 2} 11809.38{col 37}{space 1}   -1.52{col 46}{space 3}0.132{col 54}{space 4}-41426.37{col 67}{space 3} 5541.624
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-1.081421{col 26}{space 2} 8.275735{col 37}{space 1}   -0.13{col 46}{space 3}0.896{col 54}{space 4}-17.53852{col 67}{space 3} 15.37568
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 836.6178{col 26}{space 2} 806.6801{col 37}{space 1}    1.04{col 46}{space 3}0.303{col 54}{space 4}-767.5773{col 67}{space 3} 2440.813
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 195.2798{col 26}{space 2} 496.6831{col 37}{space 1}    0.39{col 46}{space 3}0.695{col 54}{space 4}-793.1221{col 67}{space 3} 1183.682
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 12526.72{col 26}{space 2} 20770.62{col 37}{space 1}    0.60{col 46}{space 3}0.548{col 54}{space 4} -28777.5{col 67}{space 3} 53830.94
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-2004.676{col 26}{space 2} 2479.341{col 37}{space 1}   -0.81{col 46}{space 3}0.421{col 54}{space 4}-6935.982{col 67}{space 3} 2926.631
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 572238.2{col 26}{space 2} 110147.5{col 37}{space 1}    5.20{col 46}{space 3}0.000{col 54}{space 4} 353196.5{col 67}{space 3} 791279.8
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0060
{txt}{col 49}Largest FMI{col 67}= {res}    0.0301
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     80.33
{txt}{col 49}        avg{col 67}= {res}     83.37
{txt}{col 49}        max{col 67}= {res}     84.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.0{txt}){col 67}= {res}      5.68
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 7256.291{col 26}{space 2} 10604.35{col 37}{space 1}    0.68{col 46}{space 3}0.496{col 54}{space 4}-13831.57{col 67}{space 3} 28344.15
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 65229.41{col 26}{space 2} 10267.46{col 37}{space 1}    6.35{col 46}{space 3}0.000{col 54}{space 4} 44811.24{col 67}{space 3} 85647.58
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-726.5485{col 26}{space 2} 643.5755{col 37}{space 1}   -1.13{col 46}{space 3}0.262{col 54}{space 4}-2006.373{col 67}{space 3} 553.2757
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-12305.49{col 26}{space 2}    11921{col 37}{space 1}   -1.03{col 46}{space 3}0.305{col 54}{space 4}-36011.58{col 67}{space 3} 11400.59
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-10.75486{col 26}{space 2} 8.354715{col 37}{space 1}   -1.29{col 46}{space 3}0.202{col 54}{space 4}-27.36914{col 67}{space 3} 5.859425
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 257.6138{col 26}{space 2} 814.1101{col 37}{space 1}    0.32{col 46}{space 3}0.752{col 54}{space 4}-1361.352{col 67}{space 3}  1876.58
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 330.7719{col 26}{space 2} 501.0474{col 37}{space 1}    0.66{col 46}{space 3}0.511{col 54}{space 4}-666.2808{col 67}{space 3} 1327.824
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 2325.446{col 26}{space 2}  20969.2{col 37}{space 1}    0.11{col 46}{space 3}0.912{col 54}{space 4}-39374.01{col 67}{space 3}  44024.9
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-3491.016{col 26}{space 2} 2516.237{col 37}{space 1}   -1.39{col 46}{space 3}0.169{col 54}{space 4}-8497.053{col 67}{space 3} 1515.021
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 410918.9{col 26}{space 2}   111171{col 37}{space 1}    3.70{col 46}{space 3}0.000{col 54}{space 4} 189841.9{col 67}{space 3}   631996
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. **********INTERACTION BY Race***************
. 
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0082
{txt}{col 49}Largest FMI{col 67}= {res}    0.0762
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    116.85
{txt}{col 49}        avg{col 67}= {res}    145.90
{txt}{col 49}        max{col 67}= {res}    149.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}     13.04
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 20649.46{col 28}{space 2} 18667.97{col 39}{space 1}    1.11{col 48}{space 3}0.270{col 56}{space 4}-16238.85{col 69}{space 3} 57537.77
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}  28361.9{col 28}{space 2} 62883.06{col 39}{space 1}    0.45{col 48}{space 3}0.653{col 56}{space 4}-95899.82{col 69}{space 3} 152623.6
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-42867.06{col 28}{space 2}  27976.1{col 39}{space 1}   -1.53{col 48}{space 3}0.128{col 56}{space 4}-98148.45{col 69}{space 3} 12414.33
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 146348.3{col 28}{space 2} 14496.23{col 39}{space 1}   10.10{col 48}{space 3}0.000{col 56}{space 4} 117703.3{col 69}{space 3} 174993.3
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2504.355{col 28}{space 2} 893.0134{col 39}{space 1}   -2.80{col 48}{space 3}0.006{col 56}{space 4}-4268.979{col 69}{space 3}-739.7301
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-3091.287{col 28}{space 2} 16901.77{col 39}{space 1}   -0.18{col 48}{space 3}0.855{col 56}{space 4}-36489.75{col 69}{space 3} 30307.18
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-15.28917{col 28}{space 2} 12.26507{col 39}{space 1}   -1.25{col 48}{space 3}0.215{col 56}{space 4}-39.52532{col 69}{space 3} 8.946989
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 745.7972{col 28}{space 2} 1131.915{col 39}{space 1}    0.66{col 48}{space 3}0.511{col 56}{space 4}-1490.892{col 69}{space 3} 2982.486
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 492.7482{col 28}{space 2} 833.1571{col 39}{space 1}    0.59{col 48}{space 3}0.555{col 56}{space 4}-1157.297{col 69}{space 3} 2142.794
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 3428.901{col 28}{space 2}  27774.2{col 39}{space 1}    0.12{col 48}{space 3}0.902{col 56}{space 4}-51453.23{col 69}{space 3} 58311.03
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-3873.218{col 28}{space 2} 3652.626{col 39}{space 1}   -1.06{col 48}{space 3}0.291{col 56}{space 4}-11092.22{col 69}{space 3} 3345.781
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1030188{col 28}{space 2} 152383.5{col 39}{space 1}    6.76{col 48}{space 3}0.000{col 56}{space 4} 729071.8{col 69}{space 3}  1331303
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0043
{txt}{col 49}Largest FMI{col 67}= {res}    0.0416
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    135.27
{txt}{col 49}        avg{col 67}= {res}    147.68
{txt}{col 49}        max{col 67}= {res}    149.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}     14.77
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 6311.697{col 28}{space 2} 9940.592{col 39}{space 1}    0.63{col 48}{space 3}0.526{col 56}{space 4}-13331.06{col 69}{space 3} 25954.45
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-7212.419{col 28}{space 2} 33462.21{col 39}{space 1}   -0.22{col 48}{space 3}0.830{col 56}{space 4}-73335.14{col 69}{space 3}  58910.3
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-17456.65{col 28}{space 2} 14897.25{col 39}{space 1}   -1.17{col 48}{space 3}0.243{col 56}{space 4}-46893.83{col 69}{space 3} 11980.53
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 75932.05{col 28}{space 2} 7717.899{col 39}{space 1}    9.84{col 48}{space 3}0.000{col 56}{space 4} 60681.35{col 69}{space 3} 91182.76
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -2064.31{col 28}{space 2} 475.4197{col 39}{space 1}   -4.34{col 48}{space 3}0.000{col 56}{space 4}-3003.748{col 69}{space 3}-1124.871
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4513.838{col 28}{space 2}  8998.14{col 39}{space 1}   -0.50{col 48}{space 3}0.617{col 56}{space 4}-22294.33{col 69}{space 3} 13266.65
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-3.810745{col 28}{space 2} 6.530407{col 39}{space 1}   -0.58{col 48}{space 3}0.560{col 56}{space 4}-16.71496{col 69}{space 3} 9.093468
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 614.7557{col 28}{space 2} 602.7659{col 39}{space 1}    1.02{col 48}{space 3}0.309{col 56}{space 4}-576.3193{col 69}{space 3} 1805.831
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2}  141.699{col 28}{space 2} 436.1546{col 39}{space 1}    0.32{col 48}{space 3}0.746{col 56}{space 4}-720.8653{col 69}{space 3} 1004.263
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 9026.166{col 28}{space 2}  14792.3{col 39}{space 1}    0.61{col 48}{space 3}0.543{col 56}{space 4}-20203.57{col 69}{space 3} 38255.91
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-571.4548{col 28}{space 2} 1938.896{col 39}{space 1}   -0.29{col 48}{space 3}0.769{col 56}{space 4} -4403.07{col 69}{space 3} 3260.161
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 591336.3{col 28}{space 2} 81126.24{col 39}{space 1}    7.29{col 48}{space 3}0.000{col 56}{space 4}   431029{col 69}{space 3} 751643.7
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct if  sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0080
{txt}{col 49}Largest FMI{col 67}= {res}    0.0676
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    121.62
{txt}{col 49}        avg{col 67}= {res}    146.19
{txt}{col 49}        max{col 67}= {res}    149.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}      8.40
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 8756.444{col 28}{space 2} 9251.378{col 39}{space 1}    0.95{col 48}{space 3}0.345{col 56}{space 4}-9524.557{col 69}{space 3} 27037.45
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 22661.05{col 28}{space 2} 31155.24{col 39}{space 1}    0.73{col 48}{space 3}0.468{col 56}{space 4}-38904.06{col 69}{space 3} 84226.15
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-18258.34{col 28}{space 2} 13862.26{col 39}{space 1}   -1.32{col 48}{space 3}0.190{col 56}{space 4}-45650.51{col 69}{space 3} 9133.827
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 59434.28{col 28}{space 2} 7185.237{col 39}{space 1}    8.27{col 48}{space 3}0.000{col 56}{space 4} 45235.92{col 69}{space 3} 73632.64
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-816.4029{col 28}{space 2} 442.4632{col 39}{space 1}   -1.85{col 48}{space 3}0.067{col 56}{space 4}-1690.726{col 69}{space 3} 57.91993
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4133.171{col 28}{space 2} 8374.816{col 39}{space 1}   -0.49{col 48}{space 3}0.622{col 56}{space 4}-20682.11{col 69}{space 3} 12415.77
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-8.696228{col 28}{space 2} 6.077454{col 39}{space 1}   -1.43{col 48}{space 3}0.155{col 56}{space 4}-20.70549{col 69}{space 3} 3.313033
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 241.6637{col 28}{space 2} 560.8674{col 39}{space 1}    0.43{col 48}{space 3}0.667{col 56}{space 4}-866.6243{col 69}{space 3} 1349.952
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} 338.1265{col 28}{space 2} 411.0298{col 39}{space 1}    0.82{col 48}{space 3}0.412{col 56}{space 4}-475.5735{col 69}{space 3} 1151.826
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 3660.696{col 28}{space 2} 13761.47{col 39}{space 1}    0.27{col 48}{space 3}0.791{col 56}{space 4}-23532.13{col 69}{space 3} 30853.53
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} -2558.34{col 28}{space 2} 1812.258{col 39}{space 1}   -1.41{col 48}{space 3}0.160{col 56}{space 4}-6140.242{col 69}{space 3} 1023.562
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}   397815{col 28}{space 2} 75495.83{col 39}{space 1}    5.27{col 48}{space 3}0.000{col 56}{space 4} 248632.5{col 69}{space 3} 546997.6
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***********MODEL 6: MODEL 2+lifestyle/health-related factors*******  
. 
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0032
{txt}{col 49}Largest FMI{col 67}= {res}    0.0292
{txt}{col 49}Complete DF{col 67}= {res}        58
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     54.06
{txt}{col 49}        avg{col 67}= {res}     55.85
{txt}{col 49}        max{col 67}= {res}     56.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   56.1{txt}){col 67}= {res}      6.71
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-18990.04{col 26}{space 2} 24822.41{col 37}{space 1}   -0.77{col 46}{space 3}0.447{col 54}{space 4} -68713.4{col 67}{space 3} 30733.33
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 123065.4{col 26}{space 2} 21450.98{col 37}{space 1}    5.74{col 46}{space 3}0.000{col 54}{space 4} 80095.08{col 67}{space 3} 166035.8
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2458.394{col 26}{space 2} 1359.778{col 37}{space 1}   -1.81{col 46}{space 3}0.076{col 54}{space 4}-5182.254{col 67}{space 3} 265.4656
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 24323.54{col 26}{space 2} 25300.41{col 37}{space 1}    0.96{col 46}{space 3}0.340{col 54}{space 4} -26357.6{col 67}{space 3} 75004.68
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-16.84109{col 26}{space 2} 18.94538{col 37}{space 1}   -0.89{col 46}{space 3}0.378{col 54}{space 4}-54.79252{col 67}{space 3} 21.11034
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 110.4682{col 26}{space 2} 1684.267{col 37}{space 1}    0.07{col 46}{space 3}0.948{col 54}{space 4}-3263.406{col 67}{space 3} 3484.343
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-2459.814{col 26}{space 2} 22892.33{col 37}{space 1}   -0.11{col 46}{space 3}0.915{col 54}{space 4}-48355.08{col 67}{space 3} 43435.45
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 16758.96{col 26}{space 2} 13377.53{col 37}{space 1}    1.25{col 46}{space 3}0.215{col 54}{space 4}-10038.89{col 67}{space 3} 43556.81
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1044869{col 26}{space 2} 89302.01{col 37}{space 1}   11.70{col 46}{space 3}0.000{col 54}{space 4} 865981.2{col 67}{space 3}  1223757
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0039
{txt}{col 49}Largest FMI{col 67}= {res}    0.0127
{txt}{col 49}Complete DF{col 67}= {res}        58
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     55.38
{txt}{col 49}        avg{col 67}= {res}     55.89
{txt}{col 49}        max{col 67}= {res}     56.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   56.1{txt}){col 67}= {res}      7.24
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}  -8673.4{col 26}{space 2} 14104.21{col 37}{space 1}   -0.61{col 46}{space 3}0.541{col 54}{space 4}-36927.44{col 67}{space 3} 19580.64
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 66814.24{col 26}{space 2}  12178.8{col 37}{space 1}    5.49{col 46}{space 3}0.000{col 54}{space 4} 42417.86{col 67}{space 3} 91210.63
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2161.101{col 26}{space 2} 772.8708{col 37}{space 1}   -2.80{col 46}{space 3}0.007{col 54}{space 4}-3709.366{col 67}{space 3}-612.8366
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 10603.32{col 26}{space 2} 14370.27{col 37}{space 1}    0.74{col 46}{space 3}0.464{col 54}{space 4}-18183.33{col 67}{space 3} 39389.98
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-7.502366{col 26}{space 2} 10.79226{col 37}{space 1}   -0.70{col 46}{space 3}0.490{col 54}{space 4}  -29.125{col 67}{space 3} 14.12027
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-108.8176{col 26}{space 2} 956.7829{col 37}{space 1}   -0.11{col 46}{space 3}0.910{col 54}{space 4}-2025.464{col 67}{space 3} 1807.829
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-16645.63{col 26}{space 2} 12893.85{col 37}{space 1}   -1.29{col 46}{space 3}0.202{col 54}{space 4}-42481.52{col 67}{space 3} 9190.273
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 9234.657{col 26}{space 2} 7602.395{col 37}{space 1}    1.21{col 46}{space 3}0.230{col 54}{space 4}-5995.105{col 67}{space 3} 24464.42
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 629541.5{col 26}{space 2} 50757.03{col 37}{space 1}   12.40{col 46}{space 3}0.000{col 54}{space 4} 527861.2{col 67}{space 3} 731221.7
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0062
{txt}{col 49}Largest FMI{col 67}= {res}    0.0447
{txt}{col 49}Complete DF{col 67}= {res}        58
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     52.55
{txt}{col 49}        avg{col 67}= {res}     55.58
{txt}{col 49}        max{col 67}= {res}     56.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   56.1{txt}){col 67}= {res}      4.60
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0002

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-8182.993{col 26}{space 2} 11625.55{col 37}{space 1}   -0.70{col 46}{space 3}0.484{col 54}{space 4}-31471.55{col 67}{space 3} 15105.56
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 46755.06{col 26}{space 2} 10051.45{col 37}{space 1}    4.65{col 46}{space 3}0.000{col 54}{space 4} 26619.05{col 67}{space 3} 66891.08
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-794.3126{col 26}{space 2} 637.2662{col 37}{space 1}   -1.25{col 46}{space 3}0.218{col 54}{space 4}-2070.939{col 67}{space 3} 482.3138
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 5629.633{col 26}{space 2} 11856.89{col 37}{space 1}    0.47{col 46}{space 3}0.637{col 54}{space 4}-18123.21{col 67}{space 3} 29382.47
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-6.232301{col 26}{space 2} 8.872087{col 37}{space 1}   -0.70{col 46}{space 3}0.485{col 54}{space 4} -24.0053{col 67}{space 3} 11.54069
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 101.6009{col 26}{space 2} 789.0999{col 37}{space 1}    0.13{col 46}{space 3}0.898{col 54}{space 4}-1479.174{col 67}{space 3} 1682.376
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 11744.38{col 26}{space 2} 10795.56{col 37}{space 1}    1.09{col 46}{space 3}0.282{col 54}{space 4}-9913.086{col 67}{space 3} 33401.84
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 6170.791{col 26}{space 2} 6260.129{col 37}{space 1}    0.99{col 46}{space 3}0.329{col 54}{space 4}-6369.369{col 67}{space 3} 18710.95
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 418344.5{col 26}{space 2} 41898.32{col 37}{space 1}    9.98{col 46}{space 3}0.000{col 54}{space 4}   334405{col 67}{space 3}   502284
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0059
{txt}{col 49}Largest FMI{col 67}= {res}    0.0458
{txt}{col 49}Complete DF{col 67}= {res}        87
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     78.36
{txt}{col 49}        avg{col 67}= {res}     84.17
{txt}{col 49}        max{col 67}= {res}     85.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   85.0{txt}){col 67}= {res}      8.97
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  TOTALBRAIN{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 17844.57{col 26}{space 2}  20754.9{col 37}{space 1}    0.86{col 46}{space 3}0.392{col 54}{space 4}-23421.84{col 67}{space 3} 59110.98
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 159070.8{col 26}{space 2} 19959.99{col 37}{space 1}    7.97{col 46}{space 3}0.000{col 54}{space 4} 119382.5{col 67}{space 3}   198759
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2148.494{col 26}{space 2} 1262.629{col 37}{space 1}   -1.70{col 46}{space 3}0.092{col 54}{space 4}-4658.945{col 67}{space 3}  361.957
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-21203.57{col 26}{space 2} 24117.87{col 37}{space 1}   -0.88{col 46}{space 3}0.382{col 54}{space 4}-69156.62{col 67}{space 3} 26749.47
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-19.40213{col 26}{space 2} 16.31085{col 37}{space 1}   -1.19{col 46}{space 3}0.238{col 54}{space 4}-51.83353{col 67}{space 3} 13.02926
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1084.609{col 26}{space 2} 1536.294{col 37}{space 1}    0.71{col 46}{space 3}0.482{col 54}{space 4}-1969.966{col 67}{space 3} 4139.183
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 16981.18{col 26}{space 2} 29101.79{col 37}{space 1}    0.58{col 46}{space 3}0.561{col 54}{space 4}-40951.87{col 67}{space 3} 74914.24
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}  6338.92{col 26}{space 2} 13041.21{col 37}{space 1}    0.49{col 46}{space 3}0.628{col 54}{space 4}-19590.29{col 67}{space 3} 32268.13
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1021911{col 26}{space 2} 105502.3{col 37}{space 1}    9.69{col 46}{space 3}0.000{col 54}{space 4} 812136.1{col 67}{space 3}  1231686
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0076
{txt}{col 49}Largest FMI{col 67}= {res}    0.0662
{txt}{col 49}Complete DF{col 67}= {res}        87
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     73.96
{txt}{col 49}        avg{col 67}= {res}     83.68
{txt}{col 49}        max{col 67}= {res}     85.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   85.0{txt}){col 67}= {res}     10.23
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          GM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 3475.003{col 26}{space 2} 10467.51{col 37}{space 1}    0.33{col 46}{space 3}0.741{col 54}{space 4}-17337.07{col 67}{space 3} 24287.08
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 83260.73{col 26}{space 2} 10072.65{col 37}{space 1}    8.27{col 46}{space 3}0.000{col 54}{space 4} 63232.19{col 67}{space 3} 103289.3
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1842.752{col 26}{space 2} 637.0447{col 37}{space 1}   -2.89{col 46}{space 3}0.005{col 54}{space 4}-3109.373{col 67}{space 3} -576.131
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-15230.85{col 26}{space 2} 12169.55{col 37}{space 1}   -1.25{col 46}{space 3}0.214{col 54}{space 4}-39427.43{col 67}{space 3} 8965.725
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-4.122462{col 26}{space 2} 8.218372{col 37}{space 1}   -0.50{col 46}{space 3}0.617{col 54}{space 4}-20.46268{col 67}{space 3} 12.21775
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 777.4169{col 26}{space 2} 775.3579{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4}-764.2253{col 67}{space 3} 2319.059
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 3672.843{col 26}{space 2} 14831.12{col 37}{space 1}    0.25{col 46}{space 3}0.805{col 54}{space 4}-25879.06{col 67}{space 3} 33224.75
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}  4393.82{col 26}{space 2} 6578.629{col 37}{space 1}    0.67{col 46}{space 3}0.506{col 54}{space 4}-8686.116{col 67}{space 3} 17473.76
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 617096.6{col 26}{space 2}  53265.1{col 37}{space 1}   11.59{col 46}{space 3}0.000{col 54}{space 4} 511184.7{col 67}{space 3} 723008.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0071
{txt}{col 49}Largest FMI{col 67}= {res}    0.0379
{txt}{col 49}Complete DF{col 67}= {res}        87
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     79.88
{txt}{col 49}        avg{col 67}= {res}     84.18
{txt}{col 49}        max{col 67}= {res}     85.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   8{txt},{res}   85.0{txt}){col 67}= {res}      6.23
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}          WM{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 8366.685{col 26}{space 2} 10615.76{col 37}{space 1}    0.79{col 46}{space 3}0.433{col 54}{space 4}-12740.93{col 67}{space 3}  29474.3
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 67116.06{col 26}{space 2} 10203.63{col 37}{space 1}    6.58{col 46}{space 3}0.000{col 54}{space 4} 46827.02{col 67}{space 3} 87405.09
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -621.963{col 26}{space 2} 645.4484{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4}-1905.303{col 67}{space 3} 661.3769
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -9515.98{col 26}{space 2} 12330.57{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-34032.93{col 67}{space 3} 15000.97
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-13.49327{col 26}{space 2} 8.376582{col 37}{space 1}   -1.61{col 46}{space 3}0.111{col 54}{space 4}-30.15185{col 67}{space 3} 3.165305
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 433.9861{col 26}{space 2} 784.8982{col 37}{space 1}    0.55{col 46}{space 3}0.582{col 54}{space 4}-1126.596{col 67}{space 3} 1994.568
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 16103.73{col 26}{space 2} 14814.05{col 37}{space 1}    1.09{col 46}{space 3}0.280{col 54}{space 4}-13377.87{col 67}{space 3} 45585.32
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} 1701.812{col 26}{space 2} 6667.262{col 37}{space 1}    0.26{col 46}{space 3}0.799{col 54}{space 4}-11554.55{col 67}{space 3} 14958.18
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 399771.4{col 26}{space 2} 53906.22{col 37}{space 1}    7.42{col 46}{space 3}0.000{col 54}{space 4} 292587.9{col 67}{space 3} 506954.9
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. ******************INTERACTION BY Race***********************
. 
. 
. //ANALYSIS A//
. mi estimate: reg TOTALBRAIN c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0007
{txt}{col 49}Largest FMI{col 67}= {res}    0.0074
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    148.69
{txt}{col 49}        avg{col 67}= {res}    149.91
{txt}{col 49}        max{col 67}= {res}    150.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  150.0{txt}){col 67}= {res}     14.52
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    TOTALBRAIN{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}  21306.3{col 28}{space 2} 18596.04{col 39}{space 1}    1.15{col 48}{space 3}0.254{col 56}{space 4}-15437.64{col 69}{space 3} 58050.25
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 26325.66{col 28}{space 2} 61361.21{col 39}{space 1}    0.43{col 48}{space 3}0.669{col 56}{space 4}-94918.03{col 69}{space 3} 147569.4
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-43281.09{col 28}{space 2} 27872.25{col 39}{space 1}   -1.55{col 48}{space 3}0.123{col 56}{space 4} -98353.9{col 69}{space 3} 11791.73
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 143059.3{col 28}{space 2} 14157.01{col 39}{space 1}   10.11{col 48}{space 3}0.000{col 56}{space 4} 115086.4{col 69}{space 3} 171032.2
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2460.212{col 28}{space 2} 890.6882{col 39}{space 1}   -2.76{col 48}{space 3}0.006{col 56}{space 4}-4220.125{col 69}{space 3}-700.2996
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-458.4515{col 28}{space 2} 17151.22{col 39}{space 1}   -0.03{col 48}{space 3}0.979{col 56}{space 4} -34347.6{col 69}{space 3}  33430.7
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-18.11843{col 28}{space 2}  12.0463{col 39}{space 1}   -1.50{col 48}{space 3}0.135{col 56}{space 4}-41.92075{col 69}{space 3} 5.683882
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 714.0932{col 28}{space 2} 1091.852{col 39}{space 1}    0.65{col 48}{space 3}0.514{col 56}{space 4}  -1443.3{col 69}{space 3} 2871.486
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2} 1655.304{col 28}{space 2} 17730.85{col 39}{space 1}    0.09{col 48}{space 3}0.926{col 56}{space 4}-33381.68{col 69}{space 3} 36692.29
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 10035.35{col 28}{space 2} 9110.431{col 39}{space 1}    1.10{col 48}{space 3}0.272{col 56}{space 4}-7965.966{col 69}{space 3} 28036.67
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1028676{col 28}{space 2} 73837.18{col 39}{space 1}   13.93{col 48}{space 3}0.000{col 56}{space 4} 882781.1{col 69}{space 3}  1174572
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg GM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0031
{txt}{col 49}Largest FMI{col 67}= {res}    0.0233
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    143.96
{txt}{col 49}        avg{col 67}= {res}    149.23
{txt}{col 49}        max{col 67}= {res}    150.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  150.0{txt}){col 67}= {res}     16.87
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            GM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 5967.338{col 28}{space 2} 9822.488{col 39}{space 1}    0.61{col 48}{space 3}0.544{col 56}{space 4}   -13441{col 69}{space 3} 25375.68
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-8485.891{col 28}{space 2}  32414.4{col 39}{space 1}   -0.26{col 48}{space 3}0.794{col 56}{space 4} -72533.9{col 69}{space 3} 55562.12
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-16898.32{col 28}{space 2}  14724.8{col 39}{space 1}   -1.15{col 48}{space 3}0.253{col 56}{space 4}-45993.26{col 69}{space 3} 12196.62
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}  74995.9{col 28}{space 2} 7476.507{col 39}{space 1}   10.03{col 48}{space 3}0.000{col 56}{space 4} 60223.04{col 69}{space 3} 89768.76
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-2131.608{col 28}{space 2} 470.7044{col 39}{space 1}   -4.53{col 48}{space 3}0.000{col 56}{space 4}-3061.686{col 69}{space 3}-1201.531
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-4053.685{col 28}{space 2} 9068.401{col 39}{space 1}   -0.45{col 48}{space 3}0.656{col 56}{space 4}-21972.36{col 69}{space 3} 13864.99
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-5.247167{col 28}{space 2} 6.376522{col 39}{space 1}   -0.82{col 48}{space 3}0.412{col 56}{space 4}-17.84713{col 69}{space 3} 7.352796
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 386.1013{col 28}{space 2}  577.091{col 39}{space 1}    0.67{col 48}{space 3}0.504{col 56}{space 4} -754.192{col 69}{space 3} 1526.394
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-9446.047{col 28}{space 2} 9437.196{col 39}{space 1}   -1.00{col 48}{space 3}0.319{col 56}{space 4}-28099.41{col 69}{space 3} 9207.321
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 6449.939{col 28}{space 2} 4813.175{col 39}{space 1}    1.34{col 48}{space 3}0.182{col 56}{space 4}-3060.491{col 69}{space 3} 15960.37
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 634275.5{col 28}{space 2} 39048.58{col 39}{space 1}   16.24{col 48}{space 3}0.000{col 56}{space 4} 557117.2{col 69}{space 3} 711433.8
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg WM c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH  if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0022
{txt}{col 49}Largest FMI{col 67}= {res}    0.0081
{txt}{col 49}Complete DF{col 67}= {res}       152
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    148.53
{txt}{col 49}        avg{col 67}= {res}    149.68
{txt}{col 49}        max{col 67}= {res}    149.95
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}  150.0{txt}){col 67}= {res}      9.23
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            WM{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} 9561.409{col 28}{space 2} 9233.443{col 39}{space 1}    1.04{col 48}{space 3}0.302{col 56}{space 4}-8683.052{col 69}{space 3} 27805.87
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 20565.18{col 28}{space 2} 30472.64{col 39}{space 1}    0.67{col 48}{space 3}0.501{col 56}{space 4} -39646.2{col 69}{space 3} 80776.57
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-18942.02{col 28}{space 2} 13839.89{col 39}{space 1}   -1.37{col 48}{space 3}0.173{col 56}{space 4}-46288.43{col 69}{space 3}  8404.38
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 58591.66{col 28}{space 2} 7030.463{col 39}{space 1}    8.33{col 48}{space 3}0.000{col 56}{space 4} 44700.05{col 69}{space 3} 72483.28
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -731.255{col 28}{space 2} 442.2682{col 39}{space 1}   -1.65{col 48}{space 3}0.100{col 56}{space 4}-1605.138{col 69}{space 3} 142.6283
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-1921.699{col 28}{space 2} 8518.658{col 39}{space 1}   -0.23{col 48}{space 3}0.822{col 56}{space 4}-18753.92{col 69}{space 3} 14910.52
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-10.72843{col 28}{space 2}  5.99601{col 39}{space 1}   -1.79{col 48}{space 3}0.076{col 56}{space 4}-22.57661{col 69}{space 3} 1.119747
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 319.7671{col 28}{space 2} 542.0995{col 39}{space 1}    0.59{col 48}{space 3}0.556{col 56}{space 4}-751.3729{col 69}{space 3} 1390.907
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}  11071.4{col 28}{space 2} 8804.465{col 39}{space 1}    1.26{col 48}{space 3}0.211{col 56}{space 4}-6326.796{col 69}{space 3} 28469.59
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2} 2762.874{col 28}{space 2} 4526.976{col 39}{space 1}    0.61{col 48}{space 3}0.543{col 56}{space 4}-6182.151{col 69}{space 3}  11707.9
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 401664.7{col 28}{space 2} 36664.85{col 39}{space 1}   10.96{col 48}{space 3}0.000{col 56}{space 4}   329218{col 69}{space 3} 474111.5
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}