{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. //////////////////////////////////////////////////TABLE S5: NFL at v1 AND v3 vs. Hippocampus and LnLesion volume adjusted for ICV_volM2,  by race///////////////////////////////////////////////////////////////////////////////////
>           
.           ////////////////////////////////////////LnNFLw1 EXPOSURE/////////////////////////////////////////////
> 
. 
. ***********************LnNFLw1, MODELS 1 AND 2*********************
. 
. *********************AFRICAN-AMERICAN*******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final2==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        67
{txt}{hline 13}{c +}{hline 34}   F(6, 60)        = {res}     7.42
{txt}       Model {c |} {res} 2862716.16         6  477119.361   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3859080.52        60  64318.0087   {txt}R-squared       ={res}    0.4259
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3685
{txt}       Total {c |} {res} 6721796.69        66  101845.404   {txt}Root MSE        =   {res} 253.61

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 37.01924{col 26}{space 2} 85.37835{col 37}{space 1}    0.43{col 46}{space 3}0.666{col 67}{space 3} .0536969
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 94.35986{col 26}{space 2}  89.4878{col 37}{space 1}    1.05{col 46}{space 3}0.296{col 67}{space 3} .1469327
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-9.403321{col 26}{space 2} 4.137173{col 37}{space 1}   -2.27{col 46}{space 3}0.027{col 67}{space 3}-.2909126
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-220.4509{col 26}{space 2} 79.69538{col 37}{space 1}   -2.77{col 46}{space 3}0.008{col 67}{space 3}-.3366095
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0363506{col 26}{space 2} .0606334{col 37}{space 1}    0.60{col 46}{space 3}0.551{col 67}{space 3} .0680281
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}  .001177{col 26}{space 2} .0003803{col 37}{space 1}    3.09{col 46}{space 3}0.003{col 67}{space 3} .4406397
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  2354.41{col 26}{space 2} 496.0454{col 37}{space 1}    4.75{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final2==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        67
{txt}{hline 13}{c +}{hline 34}   F(6, 60)        = {res}     7.87
{txt}       Model {c |} {res} 3004910.22         6  500818.369   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3819277.05        60  63654.6176   {txt}R-squared       ={res}    0.4403
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3844
{txt}       Total {c |} {res} 6824187.27        66  103396.777   {txt}Root MSE        =   {res}  252.3

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 51.49343{col 26}{space 2}  84.9369{col 37}{space 1}    0.61{col 46}{space 3}0.547{col 67}{space 3} .0741294
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 28.85917{col 26}{space 2}  89.0251{col 37}{space 1}    0.32{col 46}{space 3}0.747{col 67}{space 3} .0445997
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-9.461436{col 26}{space 2} 4.115782{col 37}{space 1}   -2.30{col 46}{space 3}0.025{col 67}{space 3}-.2905063
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-229.4869{col 26}{space 2} 79.28332{col 37}{space 1}   -2.89{col 46}{space 3}0.005{col 67}{space 3}-.3477681
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0697774{col 26}{space 2} .0603199{col 37}{space 1}    1.16{col 46}{space 3}0.252{col 67}{space 3} .1296012
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0014927{col 26}{space 2} .0003784{col 37}{space 1}    3.95{col 46}{space 3}0.000{col 67}{space 3} .5546154
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2218.356{col 26}{space 2} 493.4806{col 37}{space 1}    4.50{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final2==1 & Race==2,beta 
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        67
{txt}{hline 13}{c +}{hline 34}   F(6, 60)        = {res}     2.20
{txt}       Model {c |} {res} 127.853364         6  21.3088939   {txt}Prob > F        ={res}    0.0552
{txt}    Residual {c |} {res} 580.947536        60  9.68245894   {txt}R-squared       ={res}    0.1804
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0984
{txt}       Total {c |} {res}   708.8009        66  10.7394076   {txt}Root MSE        =   {res} 3.1117

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 1.958856{col 26}{space 2} 1.047549{col 37}{space 1}    1.87{col 46}{space 3}0.066{col 67}{space 3} .2766971
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  .229464{col 26}{space 2}  1.09797{col 37}{space 1}    0.21{col 46}{space 3}0.835{col 67}{space 3} .0347958
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0299782{col 26}{space 2}  .050761{col 37}{space 1}    0.59{col 46}{space 3}0.557{col 67}{space 3} .0903164
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .1085031{col 26}{space 2} .9778217{col 37}{space 1}    0.11{col 46}{space 3}0.912{col 67}{space 3} .0161338
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0009136{col 26}{space 2} .0007439{col 37}{space 1}   -1.23{col 46}{space 3}0.224{col 67}{space 3}-.1664951
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 6.07e-06{col 26}{space 2} 4.67e-06{col 37}{space 1}    1.30{col 46}{space 3}0.198{col 67}{space 3} .2213981
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-5.402901{col 26}{space 2} 6.086224{col 37}{space 1}   -0.89{col 46}{space 3}0.378{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        59
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     57.10
{txt}{col 49}        avg{col 67}= {res}     57.10
{txt}{col 49}        max{col 67}= {res}     57.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   57.1{txt}){col 67}= {res}      6.25
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 32.11934{col 26}{space 2}  99.4511{col 37}{space 1}    0.32{col 46}{space 3}0.748{col 54}{space 4}-167.0207{col 67}{space 3} 231.2594
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 93.04378{col 26}{space 2} 91.22105{col 37}{space 1}    1.02{col 46}{space 3}0.312{col 54}{space 4}-89.61652{col 67}{space 3} 275.7041
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-9.163247{col 26}{space 2} 4.832579{col 37}{space 1}   -1.90{col 46}{space 3}0.063{col 54}{space 4}-18.83996{col 67}{space 3} .5134698
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -219.571{col 26}{space 2} 80.85708{col 37}{space 1}   -2.72{col 46}{space 3}0.009{col 54}{space 4}-381.4786{col 67}{space 3}-57.66346
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0359795{col 26}{space 2} .0612562{col 37}{space 1}    0.59{col 46}{space 3}0.559{col 54}{space 4}-.0866794{col 67}{space 3} .1586384
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-.5734885{col 26}{space 2} 5.827083{col 37}{space 1}   -0.10{col 46}{space 3}0.922{col 54}{space 4}-12.24159{col 67}{space 3} 11.09462
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0011788{col 26}{space 2} .0003839{col 37}{space 1}    3.07{col 46}{space 3}0.003{col 54}{space 4}   .00041{col 67}{space 3} .0019475
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2368.469{col 26}{space 2} 520.1887{col 37}{space 1}    4.55{col 46}{space 3}0.000{col 54}{space 4} 1326.848{col 67}{space 3} 3410.091
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        59
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     57.10
{txt}{col 49}        avg{col 67}= {res}     57.10
{txt}{col 49}        max{col 67}= {res}     57.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   57.1{txt}){col 67}= {res}      6.71
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 24.64736{col 26}{space 2} 98.69839{col 37}{space 1}    0.25{col 46}{space 3}0.804{col 54}{space 4}-172.9855{col 67}{space 3} 222.2802
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 21.64849{col 26}{space 2} 90.53064{col 37}{space 1}    0.24{col 46}{space 3}0.812{col 54}{space 4}-159.6293{col 67}{space 3} 202.9263
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-8.146095{col 26}{space 2} 4.796003{col 37}{space 1}   -1.70{col 46}{space 3}0.095{col 54}{space 4}-17.74957{col 67}{space 3} 1.457383
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-224.6663{col 26}{space 2} 80.24511{col 37}{space 1}   -2.80{col 46}{space 3}0.007{col 54}{space 4}-385.3484{col 67}{space 3}-63.98412
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0677444{col 26}{space 2} .0607926{col 37}{space 1}    1.11{col 46}{space 3}0.270{col 54}{space 4}-.0539862{col 67}{space 3}  .189475
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-3.142084{col 26}{space 2}  5.78298{col 37}{space 1}   -0.54{col 46}{space 3}0.589{col 54}{space 4}-14.72188{col 67}{space 3} 8.437709
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0015023{col 26}{space 2}  .000381{col 37}{space 1}    3.94{col 46}{space 3}0.000{col 54}{space 4} .0007394{col 67}{space 3} .0022653
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2295.383{col 26}{space 2} 516.2516{col 37}{space 1}    4.45{col 46}{space 3}0.000{col 54}{space 4} 1261.645{col 67}{space 3} 3329.121
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final2==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        59
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     57.10
{txt}{col 49}        avg{col 67}= {res}     57.10
{txt}{col 49}        max{col 67}= {res}     57.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   57.1{txt}){col 67}= {res}      2.32
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0370

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}   2.9399{col 26}{space 2} 1.193347{col 37}{space 1}    2.46{col 46}{space 3}0.017{col 54}{space 4} .5503509{col 67}{space 3} 5.329448
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .4929658{col 26}{space 2} 1.094592{col 37}{space 1}    0.45{col 46}{space 3}0.654{col 54}{space 4}-1.698836{col 67}{space 3} 2.684768
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0180887{col 26}{space 2} .0579877{col 37}{space 1}   -0.31{col 46}{space 3}0.756{col 54}{space 4}-.1342029{col 67}{space 3} .0980255
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.0676591{col 26}{space 2} .9702312{col 37}{space 1}   -0.07{col 46}{space 3}0.945{col 54}{space 4}-2.010442{col 67}{space 3} 1.875124
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0008393{col 26}{space 2}  .000735{col 37}{space 1}   -1.14{col 46}{space 3}0.258{col 54}{space 4}-.0023111{col 67}{space 3} .0006325
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  .114822{col 26}{space 2} .0699211{col 37}{space 1}    1.64{col 46}{space 3}0.106{col 54}{space 4}-.0251875{col 67}{space 3} .2548315
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 5.72e-06{col 26}{space 2} 4.61e-06{col 37}{space 1}    1.24{col 46}{space 3}0.219{col 54}{space 4}-3.50e-06{col 67}{space 3} .0000149
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-8.217721{col 26}{space 2} 6.241919{col 37}{space 1}   -1.32{col 46}{space 3}0.193{col 54}{space 4}-20.71649{col 67}{space 3} 4.281046
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. *********************WHITES******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final2==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        96
{txt}{hline 13}{c +}{hline 34}   F(6, 89)        = {res}    10.91
{txt}       Model {c |} {res} 6697729.79         6   1116288.3   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  9105486.1        89  102308.833   {txt}R-squared       ={res}    0.4238
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3850
{txt}       Total {c |} {res} 15803215.9        95  166349.641   {txt}Root MSE        =   {res} 319.86

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-110.6991{col 26}{space 2} 83.62192{col 37}{space 1}   -1.32{col 46}{space 3}0.189{col 67}{space 3}-.1358212
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-80.57232{col 26}{space 2} 92.62782{col 37}{space 1}   -0.87{col 46}{space 3}0.387{col 67}{space 3}-.0982315
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-3.120432{col 26}{space 2}  4.72964{col 37}{space 1}   -0.66{col 46}{space 3}0.511{col 67}{space 3}-.0664901
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-93.39347{col 26}{space 2}   81.673{col 37}{space 1}   -1.14{col 46}{space 3}0.256{col 67}{space 3}-.0996736
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0315047{col 26}{space 2}  .055119{col 37}{space 1}    0.57{col 46}{space 3}0.569{col 67}{space 3} .0494804
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019464{col 26}{space 2} .0003206{col 37}{space 1}    6.07{col 46}{space 3}0.000{col 67}{space 3} .6965927
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1516.627{col 26}{space 2}  448.738{col 37}{space 1}    3.38{col 46}{space 3}0.001{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final2==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        96
{txt}{hline 13}{c +}{hline 34}   F(6, 89)        = {res}    14.43
{txt}       Model {c |} {res} 9177736.02         6  1529622.67   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 9437133.54        89  106035.208   {txt}R-squared       ={res}    0.4930
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4589
{txt}       Total {c |} {res} 18614869.6        95  195945.995   {txt}Root MSE        =   {res} 325.63

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} -118.779{col 26}{space 2} 85.13118{col 37}{space 1}   -1.40{col 46}{space 3}0.166{col 67}{space 3}-.1342784
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-217.8354{col 26}{space 2} 94.29961{col 37}{space 1}   -2.31{col 46}{space 3}0.023{col 67}{space 3}-.2447012
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .1076977{col 26}{space 2} 4.815003{col 37}{space 1}    0.02{col 46}{space 3}0.982{col 67}{space 3} .0021144
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-63.14471{col 26}{space 2} 83.14708{col 37}{space 1}   -0.76{col 46}{space 3}0.450{col 67}{space 3}-.0620931
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0787172{col 26}{space 2} .0561138{col 37}{space 1}    1.40{col 46}{space 3}0.164{col 67}{space 3} .1139121
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0025709{col 26}{space 2} .0003263{col 37}{space 1}    7.88{col 46}{space 3}0.000{col 67}{space 3}  .847794
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 891.1715{col 26}{space 2}  456.837{col 37}{space 1}    1.95{col 46}{space 3}0.054{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final2==1 & Race==1,beta 
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        96
{txt}{hline 13}{c +}{hline 34}   F(6, 89)        = {res}     2.31
{txt}       Model {c |} {res} 252.302212         6  42.0503686   {txt}Prob > F        ={res}    0.0403
{txt}    Residual {c |} {res} 1618.45205        89  18.1848545   {txt}R-squared       ={res}    0.1349
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0765
{txt}       Total {c |} {res} 1870.75426        95  19.6921502   {txt}Root MSE        =   {res} 4.2644

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 3.223887{col 26}{space 2} 1.114855{col 37}{space 1}    2.89{col 46}{space 3}0.005{col 67}{space 3} .3635531
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.1040416{col 26}{space 2} 1.234923{col 37}{space 1}   -0.08{col 46}{space 3}0.933{col 67}{space 3}-.0116583
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0242348{col 26}{space 2}  .063056{col 37}{space 1}   -0.38{col 46}{space 3}0.702{col 67}{space 3}-.0474621
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 2.241165{col 26}{space 2} 1.088872{col 37}{space 1}    2.06{col 46}{space 3}0.042{col 67}{space 3} .2198375
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0010892{col 26}{space 2} .0007349{col 37}{space 1}   -1.48{col 46}{space 3}0.142{col 67}{space 3} -.157232
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.88e-06{col 26}{space 2} 4.27e-06{col 37}{space 1}    0.44{col 46}{space 3}0.661{col 67}{space 3} .0618132
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.457764{col 26}{space 2} 5.982617{col 37}{space 1}   -0.58{col 46}{space 3}0.565{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        88
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     86.07
{txt}{col 49}        avg{col 67}= {res}     86.07
{txt}{col 49}        max{col 67}= {res}     86.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   86.1{txt}){col 67}= {res}     10.00
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-103.3641{col 26}{space 2} 82.78595{col 37}{space 1}   -1.25{col 46}{space 3}0.215{col 54}{space 4}-267.9353{col 67}{space 3} 61.20711
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-65.76058{col 26}{space 2} 91.97635{col 37}{space 1}   -0.71{col 46}{space 3}0.477{col 54}{space 4}-248.6015{col 67}{space 3} 117.0804
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -2.40705{col 26}{space 2} 4.694167{col 37}{space 1}   -0.51{col 46}{space 3}0.609{col 54}{space 4}-11.73864{col 67}{space 3} 6.924544
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-93.35708{col 26}{space 2}  80.7521{col 37}{space 1}   -1.16{col 46}{space 3}0.251{col 54}{space 4}-253.8852{col 67}{space 3} 67.17103
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0443127{col 26}{space 2} .0549901{col 37}{space 1}    0.81{col 46}{space 3}0.423{col 54}{space 4}-.0650027{col 67}{space 3} .1536282
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 8.998849{col 26}{space 2} 5.159918{col 37}{space 1}    1.74{col 46}{space 3}0.085{col 54}{space 4}-1.258617{col 67}{space 3} 19.25632
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019486{col 26}{space 2} .0003169{col 37}{space 1}    6.15{col 46}{space 3}0.000{col 54}{space 4} .0013185{col 67}{space 3} .0025786
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1153.817{col 26}{space 2} 490.0292{col 37}{space 1}    2.35{col 46}{space 3}0.021{col 54}{space 4} 179.6819{col 67}{space 3} 2127.952
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        88
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     86.07
{txt}{col 49}        avg{col 67}= {res}     86.07
{txt}{col 49}        max{col 67}= {res}     86.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   86.1{txt}){col 67}= {res}     13.76
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-108.9208{col 26}{space 2} 83.19112{col 37}{space 1}   -1.31{col 46}{space 3}0.194{col 54}{space 4}-274.2975{col 67}{space 3} 56.45589
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-197.9284{col 26}{space 2} 92.42651{col 37}{space 1}   -2.14{col 46}{space 3}0.035{col 54}{space 4}-381.6642{col 67}{space 3}-14.19259
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.066484{col 26}{space 2} 4.717142{col 37}{space 1}    0.23{col 46}{space 3}0.822{col 54}{space 4}-8.310781{col 67}{space 3} 10.44375
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -63.0958{col 26}{space 2} 81.14732{col 37}{space 1}   -0.78{col 46}{space 3}0.439{col 54}{space 4}-224.4096{col 67}{space 3} 98.21798
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0959312{col 26}{space 2} .0552592{col 37}{space 1}    1.74{col 46}{space 3}0.086{col 54}{space 4}-.0139193{col 67}{space 3} .2057817
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 12.09447{col 26}{space 2} 5.185172{col 37}{space 1}    2.33{col 46}{space 3}0.022{col 54}{space 4} 1.786802{col 67}{space 3} 22.40214
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0025739{col 26}{space 2} .0003185{col 37}{space 1}    8.08{col 46}{space 3}0.000{col 54}{space 4} .0019408{col 67}{space 3} .0032071
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 403.5543{col 26}{space 2} 492.4275{col 37}{space 1}    0.82{col 46}{space 3}0.415{col 54}{space 4}-575.3485{col 67}{space 3} 1382.457
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final2==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        88
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     86.07
{txt}{col 49}        avg{col 67}= {res}     86.07
{txt}{col 49}        max{col 67}= {res}     86.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   86.1{txt}){col 67}= {res}      2.02
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0613

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 3.258852{col 26}{space 2} 1.120222{col 37}{space 1}    2.91{col 46}{space 3}0.005{col 54}{space 4} 1.031949{col 67}{space 3} 5.485754
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.0334366{col 26}{space 2} 1.244582{col 37}{space 1}   -0.03{col 46}{space 3}0.979{col 54}{space 4}-2.507557{col 67}{space 3} 2.440684
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0208342{col 26}{space 2} .0635193{col 37}{space 1}   -0.33{col 46}{space 3}0.744{col 54}{space 4}-.1471051{col 67}{space 3} .1054366
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 2.241338{col 26}{space 2} 1.092701{col 37}{space 1}    2.05{col 46}{space 3}0.043{col 54}{space 4} .0691453{col 67}{space 3} 4.413531
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0010282{col 26}{space 2} .0007441{col 37}{space 1}   -1.38{col 46}{space 3}0.171{col 54}{space 4}-.0025074{col 67}{space 3}  .000451
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  .042896{col 26}{space 2} .0698217{col 37}{space 1}    0.61{col 46}{space 3}0.541{col 54}{space 4}-.0959034{col 67}{space 3} .1816953
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.89e-06{col 26}{space 2} 4.29e-06{col 37}{space 1}    0.44{col 46}{space 3}0.661{col 54}{space 4}-6.64e-06{col 67}{space 3} .0000104
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-5.187217{col 26}{space 2} 6.630852{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4}-18.36877{col 67}{space 3} 7.994336
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //INTERACTION BY Race//
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       153
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    151.04
{txt}{col 49}        avg{col 67}= {res}    151.04
{txt}{col 49}        max{col 67}= {res}    151.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  151.0{txt}){col 67}= {res}     14.47
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-68.73342{col 28}{space 2}  70.0454{col 39}{space 1}   -0.98{col 48}{space 3}0.328{col 56}{space 4}-207.1288{col 69}{space 3} 69.66192
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-343.9779{col 28}{space 2} 201.1103{col 39}{space 1}   -1.71{col 48}{space 3}0.089{col 56}{space 4}-741.3307{col 69}{space 3} 53.37476
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}  130.601{col 28}{space 2} 101.6276{col 39}{space 1}    1.29{col 48}{space 3}0.201{col 56}{space 4}-70.19421{col 69}{space 3} 331.3963
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 7.732182{col 28}{space 2} 65.36653{col 39}{space 1}    0.12{col 48}{space 3}0.906{col 56}{space 4}-121.4187{col 69}{space 3}  136.883
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-6.750437{col 28}{space 2} 3.199107{col 39}{space 1}   -2.11{col 48}{space 3}0.036{col 56}{space 4}-13.07122{col 69}{space 3}-.4296572
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-154.5487{col 28}{space 2} 56.86605{col 39}{space 1}   -2.72{col 48}{space 3}0.007{col 56}{space 4}-266.9044{col 69}{space 3} -42.1931
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}  .030505{col 28}{space 2} .0404101{col 39}{space 1}    0.75{col 48}{space 3}0.451{col 56}{space 4}-.0493372{col 69}{space 3} .1103471
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 4.099695{col 28}{space 2} 3.728568{col 39}{space 1}    1.10{col 48}{space 3}0.273{col 56}{space 4}-3.267191{col 69}{space 3} 11.46658
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0016349{col 28}{space 2}  .000241{col 39}{space 1}    6.78{col 48}{space 3}0.000{col 56}{space 4} .0011588{col 69}{space 3} .0021111
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1866.425{col 28}{space 2} 349.8105{col 39}{space 1}    5.34{col 48}{space 3}0.000{col 56}{space 4} 1175.271{col 69}{space 3} 2557.579
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       153
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    151.04
{txt}{col 49}        avg{col 67}= {res}    151.04
{txt}{col 49}        max{col 67}= {res}    151.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  151.0{txt}){col 67}= {res}     17.67
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-57.60923{col 28}{space 2} 71.70715{col 39}{space 1}   -0.80{col 48}{space 3}0.423{col 56}{space 4}-199.2879{col 69}{space 3} 84.06939
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-351.6203{col 28}{space 2} 205.8814{col 39}{space 1}   -1.71{col 48}{space 3}0.090{col 56}{space 4}-758.3998{col 69}{space 3} 55.15916
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 131.9743{col 28}{space 2} 104.0386{col 39}{space 1}    1.27{col 48}{space 3}0.207{col 56}{space 4}-73.58459{col 69}{space 3} 337.5332
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-96.11667{col 28}{space 2} 66.91728{col 39}{space 1}   -1.44{col 48}{space 3}0.153{col 56}{space 4}-228.3315{col 69}{space 3} 36.09815
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-5.261155{col 28}{space 2} 3.275003{col 39}{space 1}   -1.61{col 48}{space 3}0.110{col 56}{space 4}-11.73189{col 69}{space 3} 1.209578
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-143.8443{col 28}{space 2} 58.21513{col 39}{space 1}   -2.47{col 48}{space 3}0.015{col 56}{space 4}-258.8654{col 69}{space 3} -28.8231
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0702371{col 28}{space 2} .0413688{col 39}{space 1}    1.70{col 48}{space 3}0.092{col 56}{space 4}-.0114992{col 69}{space 3} .1519734
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 4.542201{col 28}{space 2} 3.817024{col 39}{space 1}    1.19{col 48}{space 3}0.236{col 56}{space 4}-2.999456{col 69}{space 3} 12.08386
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2}  .002138{col 28}{space 2} .0002467{col 39}{space 1}    8.67{col 48}{space 3}0.000{col 56}{space 4} .0016506{col 69}{space 3} .0026255
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  1430.48{col 28}{space 2} 358.1094{col 39}{space 1}    3.99{col 48}{space 3}0.000{col 56}{space 4} 722.9293{col 69}{space 3} 2138.031
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 if sample_final2==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       153
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    151.04
{txt}{col 49}        avg{col 67}= {res}    151.04
{txt}{col 49}        max{col 67}= {res}    151.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  151.0{txt}){col 67}= {res}      2.70
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0061

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 2.942815{col 28}{space 2} .9103623{col 39}{space 1}    3.23{col 48}{space 3}0.002{col 56}{space 4} 1.144126{col 69}{space 3} 4.741505
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 2.016693{col 28}{space 2}  2.61378{col 39}{space 1}    0.77{col 48}{space 3}0.442{col 56}{space 4}  -3.1476{col 69}{space 3} 7.180985
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.1995138{col 28}{space 2} 1.320828{col 39}{space 1}   -0.15{col 48}{space 3}0.880{col 56}{space 4}-2.809199{col 69}{space 3} 2.410171
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .4055111{col 28}{space 2} .8495522{col 39}{space 1}    0.48{col 48}{space 3}0.634{col 56}{space 4} -1.27303{col 69}{space 3} 2.084052
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-.0029972{col 28}{space 2}  .041578{col 39}{space 1}   -0.07{col 48}{space 3}0.943{col 56}{space 4}-.0851468{col 69}{space 3} .0791524
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} 1.258428{col 28}{space 2} .7390736{col 39}{space 1}    1.70{col 48}{space 3}0.091{col 56}{space 4}  -.20183{col 69}{space 3} 2.718686
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0009928{col 28}{space 2} .0005252{col 39}{space 1}   -1.89{col 48}{space 3}0.061{col 56}{space 4}-.0020305{col 69}{space 3} .0000449
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}  .071419{col 28}{space 2} .0484593{col 39}{space 1}    1.47{col 48}{space 3}0.143{col 56}{space 4}-.0243266{col 69}{space 3} .1671645
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.29e-06{col 28}{space 2} 3.13e-06{col 39}{space 1}    0.73{col 48}{space 3}0.465{col 56}{space 4}-3.89e-06{col 69}{space 3} 8.48e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-6.252933{col 28}{space 2} 4.546399{col 39}{space 1}   -1.38{col 48}{space 3}0.171{col 56}{space 4}-15.23568{col 69}{space 3} 2.729819
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. *********************LnNFLw1, MODELS 3-6***************************
. 
. ***********MODEL 3: MODEL 2+w1dxDiabetes w1Glucose******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0164
{txt}{col 49}Largest FMI{col 67}= {res}    0.1253
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     41.97
{txt}{col 49}        avg{col 67}= {res}     53.12
{txt}{col 49}        max{col 67}= {res}     55.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   55.0{txt}){col 67}= {res}      6.00
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 27.57398{col 26}{space 2} 100.9642{col 37}{space 1}    0.27{col 46}{space 3}0.786{col 54}{space 4}-174.7721{col 67}{space 3} 229.9201
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  89.7543{col 26}{space 2} 88.69411{col 37}{space 1}    1.01{col 46}{space 3}0.316{col 54}{space 4}-88.04906{col 67}{space 3} 267.5577
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-7.858919{col 26}{space 2} 4.943509{col 37}{space 1}   -1.59{col 46}{space 3}0.118{col 54}{space 4}-17.76709{col 67}{space 3} 2.049252
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-219.2906{col 26}{space 2} 77.69705{col 37}{space 1}   -2.82{col 46}{space 3}0.007{col 54}{space 4}-374.9931{col 67}{space 3}-63.58816
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0253018{col 26}{space 2} .0596667{col 37}{space 1}    0.42{col 46}{space 3}0.673{col 54}{space 4}-.0942781{col 67}{space 3} .1448818
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-2.028054{col 26}{space 2} 5.647142{col 37}{space 1}   -0.36{col 46}{space 3}0.721{col 54}{space 4}-13.34489{col 67}{space 3} 9.288785
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-71.87158{col 26}{space 2} 62.14995{col 37}{space 1}   -1.16{col 46}{space 3}0.254{col 54}{space 4}-197.2977{col 67}{space 3} 53.55455
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 4.414071{col 26}{space 2} 1.713515{col 37}{space 1}    2.58{col 46}{space 3}0.013{col 54}{space 4} .9748508{col 67}{space 3} 7.853291
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0010397{col 26}{space 2}  .000379{col 37}{space 1}    2.74{col 46}{space 3}0.008{col 54}{space 4} .0002798{col 67}{space 3} .0017996
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2168.669{col 26}{space 2} 508.8516{col 37}{space 1}    4.26{col 46}{space 3}0.000{col 54}{space 4}   1148.9{col 67}{space 3} 3188.439
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0026
{txt}{col 49}Largest FMI{col 67}= {res}    0.0204
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     53.83
{txt}{col 49}        avg{col 67}= {res}     54.86
{txt}{col 49}        max{col 67}= {res}     55.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   55.1{txt}){col 67}= {res}      8.25
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 54.60756{col 26}{space 2} 93.74221{col 37}{space 1}    0.58{col 46}{space 3}0.563{col 54}{space 4}-133.2546{col 67}{space 3} 242.4697
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 4.277919{col 26}{space 2} 82.03501{col 37}{space 1}    0.05{col 46}{space 3}0.959{col 54}{space 4}-160.1292{col 67}{space 3} 168.6851
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-8.176434{col 26}{space 2} 4.584903{col 37}{space 1}   -1.78{col 46}{space 3}0.080{col 54}{space 4}-17.36485{col 67}{space 3} 1.011978
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-230.5519{col 26}{space 2} 72.22949{col 37}{space 1}   -3.19{col 46}{space 3}0.002{col 54}{space 4}-375.2975{col 67}{space 3}-85.80626
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0640296{col 26}{space 2} .0553883{col 37}{space 1}    1.16{col 46}{space 3}0.253{col 54}{space 4}-.0469683{col 67}{space 3} .1750275
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} -4.51549{col 26}{space 2} 5.249891{col 37}{space 1}   -0.86{col 46}{space 3}0.393{col 54}{space 4}-15.03628{col 67}{space 3} 6.005299
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-36.65939{col 26}{space 2} 54.83794{col 37}{space 1}   -0.67{col 46}{space 3}0.507{col 54}{space 4}-146.6109{col 67}{space 3} 73.29211
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 5.584811{col 26}{space 2} 1.563191{col 37}{space 1}    3.57{col 46}{space 3}0.001{col 54}{space 4} 2.451745{col 67}{space 3} 8.717876
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0013837{col 26}{space 2} .0003499{col 37}{space 1}    3.95{col 46}{space 3}0.000{col 54}{space 4} .0006824{col 67}{space 3} .0020849
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1953.098{col 26}{space 2} 472.6847{col 37}{space 1}    4.13{col 46}{space 3}0.000{col 54}{space 4} 1005.844{col 67}{space 3} 2900.353
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0022
{txt}{col 49}Largest FMI{col 67}= {res}    0.0211
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     53.77
{txt}{col 49}        avg{col 67}= {res}     54.89
{txt}{col 49}        max{col 67}= {res}     55.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   55.1{txt}){col 67}= {res}      1.75
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0988

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  2.89967{col 26}{space 2} 1.284212{col 37}{space 1}    2.26{col 46}{space 3}0.028{col 54}{space 4} .3260503{col 67}{space 3} 5.473289
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .5167441{col 26}{space 2} 1.122068{col 37}{space 1}    0.46{col 46}{space 3}0.647{col 54}{space 4}-1.731851{col 67}{space 3} 2.765339
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0172117{col 26}{space 2} .0628062{col 37}{space 1}   -0.27{col 46}{space 3}0.785{col 54}{space 4}-.1430796{col 67}{space 3} .1086561
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.0608365{col 26}{space 2} .9893367{col 37}{space 1}   -0.06{col 46}{space 3}0.951{col 54}{space 4}-2.043434{col 67}{space 3} 1.921761
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0008425{col 26}{space 2} .0007586{col 37}{space 1}   -1.11{col 46}{space 3}0.272{col 54}{space 4}-.0023628{col 67}{space 3} .0006778
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .1157294{col 26}{space 2} .0718939{col 37}{space 1}    1.61{col 46}{space 3}0.113{col 54}{space 4}-.0283447{col 67}{space 3} .2598035
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-.0066401{col 26}{space 2} .7513362{col 37}{space 1}   -0.01{col 46}{space 3}0.993{col 54}{space 4}-1.513124{col 67}{space 3} 1.499844
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-.0040859{col 26}{space 2} .0214158{col 37}{space 1}   -0.19{col 46}{space 3}0.849{col 54}{space 4}-.0470096{col 67}{space 3} .0388378
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 5.77e-06{col 26}{space 2} 4.79e-06{col 37}{space 1}    1.21{col 46}{space 3}0.233{col 54}{space 4}-3.82e-06{col 67}{space 3} .0000154
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-7.910819{col 26}{space 2}  6.47296{col 37}{space 1}   -1.22{col 46}{space 3}0.227{col 54}{space 4}-20.88241{col 67}{space 3} 5.060769
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //Whites//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     84.07
{txt}{col 49}        avg{col 67}= {res}     84.07
{txt}{col 49}        max{col 67}= {res}     84.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.1{txt}){col 67}= {res}      7.75
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-123.8929{col 26}{space 2} 92.36556{col 37}{space 1}   -1.34{col 46}{space 3}0.183{col 54}{space 4}-307.5698{col 67}{space 3} 59.78402
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-77.02312{col 26}{space 2} 94.23851{col 37}{space 1}   -0.82{col 46}{space 3}0.416{col 54}{space 4}-264.4245{col 67}{space 3} 110.3783
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2.491293{col 26}{space 2} 4.800416{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-12.03733{col 67}{space 3} 7.054749
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-104.7637{col 26}{space 2} 82.39317{col 37}{space 1}   -1.27{col 46}{space 3}0.207{col 54}{space 4}-268.6096{col 67}{space 3} 59.08227
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0558711{col 26}{space 2} .0570041{col 37}{space 1}    0.98{col 46}{space 3}0.330{col 54}{space 4}-.0574865{col 67}{space 3} .1692286
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 7.692351{col 26}{space 2} 5.425955{col 37}{space 1}    1.42{col 46}{space 3}0.160{col 54}{space 4} -3.09763{col 67}{space 3} 18.48233
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 43.92692{col 26}{space 2} 71.05203{col 37}{space 1}    0.62{col 46}{space 3}0.538{col 54}{space 4}-97.36619{col 67}{space 3}   185.22
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} .0784974{col 26}{space 2} 1.551457{col 37}{space 1}    0.05{col 46}{space 3}0.960{col 54}{space 4}-3.006708{col 67}{space 3} 3.163703
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019313{col 26}{space 2} .0003239{col 37}{space 1}    5.96{col 46}{space 3}0.000{col 54}{space 4} .0012871{col 67}{space 3} .0025755
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1244.756{col 26}{space 2} 528.6952{col 37}{space 1}    2.35{col 46}{space 3}0.021{col 54}{space 4} 193.3998{col 67}{space 3} 2296.112
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     84.07
{txt}{col 49}        avg{col 67}= {res}     84.07
{txt}{col 49}        max{col 67}= {res}     84.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.1{txt}){col 67}= {res}     10.61
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-137.7472{col 26}{space 2} 92.86167{col 37}{space 1}   -1.48{col 46}{space 3}0.142{col 54}{space 4}-322.4107{col 67}{space 3} 46.91621
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-211.5965{col 26}{space 2} 94.74468{col 37}{space 1}   -2.23{col 46}{space 3}0.028{col 54}{space 4}-400.0045{col 67}{space 3}-23.18855
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.285309{col 26}{space 2}   4.8262{col 37}{space 1}    0.27{col 46}{space 3}0.791{col 54}{space 4}-8.312006{col 67}{space 3} 10.88262
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-72.97775{col 26}{space 2} 82.83571{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-237.7037{col 67}{space 3} 91.74822
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .1065101{col 26}{space 2} .0573102{col 37}{space 1}    1.86{col 46}{space 3}0.067{col 54}{space 4}-.0074562{col 67}{space 3} .2204765
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 10.83657{col 26}{space 2} 5.455099{col 37}{space 1}    1.99{col 46}{space 3}0.050{col 54}{space 4}-.0113665{col 67}{space 3}  21.6845
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 20.10493{col 26}{space 2} 71.43367{col 37}{space 1}    0.28{col 46}{space 3}0.779{col 54}{space 4}-121.9471{col 67}{space 3} 162.1569
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}  .613148{col 26}{space 2}  1.55979{col 37}{space 1}    0.39{col 46}{space 3}0.695{col 54}{space 4}-2.488629{col 67}{space 3} 3.714925
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0025772{col 26}{space 2} .0003257{col 37}{space 1}    7.91{col 46}{space 3}0.000{col 54}{space 4} .0019295{col 67}{space 3} .0032249
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 425.8567{col 26}{space 2} 531.5349{col 37}{space 1}    0.80{col 46}{space 3}0.425{col 54}{space 4}-631.1464{col 67}{space 3}  1482.86
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     84.07
{txt}{col 49}        avg{col 67}= {res}     84.07
{txt}{col 49}        max{col 67}= {res}     84.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.1{txt}){col 67}= {res}      1.73
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0938

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  3.87942{col 26}{space 2} 1.244273{col 37}{space 1}    3.12{col 46}{space 3}0.002{col 54}{space 4} 1.405076{col 67}{space 3} 6.353763
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .2517441{col 26}{space 2} 1.269504{col 37}{space 1}    0.20{col 46}{space 3}0.843{col 54}{space 4}-2.272773{col 67}{space 3} 2.776262
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0269683{col 26}{space 2} .0646673{col 37}{space 1}   -0.42{col 46}{space 3}0.678{col 54}{space 4}-.1555648{col 67}{space 3} .1016281
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 2.428172{col 26}{space 2} 1.109933{col 37}{space 1}    2.19{col 46}{space 3}0.031{col 54}{space 4} .2209747{col 67}{space 3} 4.635369
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0012321{col 26}{space 2} .0007679{col 37}{space 1}   -1.60{col 46}{space 3}0.112{col 54}{space 4}-.0027591{col 67}{space 3}  .000295
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0675411{col 26}{space 2}  .073094{col 37}{space 1}    0.92{col 46}{space 3}0.358{col 54}{space 4}-.0778127{col 67}{space 3} .2128948
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-.2572773{col 26}{space 2} .9571545{col 37}{space 1}   -0.27{col 46}{space 3}0.789{col 54}{space 4}-2.160662{col 67}{space 3} 1.646107
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} -.015323{col 26}{space 2} .0208999{col 37}{space 1}   -0.73{col 46}{space 3}0.466{col 54}{space 4}-.0568843{col 67}{space 3} .0262384
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.70e-06{col 26}{space 2} 4.36e-06{col 37}{space 1}    0.39{col 46}{space 3}0.697{col 54}{space 4}-6.98e-06{col 67}{space 3} .0000104
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-5.222371{col 26}{space 2} 7.122147{col 37}{space 1}   -0.73{col 46}{space 3}0.465{col 54}{space 4}-19.38538{col 67}{space 3} 8.940632
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. //INTERACTION by Race//
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0049
{txt}{col 49}Largest FMI{col 67}= {res}    0.0527
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    129.71
{txt}{col 49}        avg{col 67}= {res}    146.89
{txt}{col 49}        max{col 67}= {res}    149.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}     12.07
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-110.1863{col 28}{space 2} 75.05246{col 39}{space 1}   -1.47{col 48}{space 3}0.144{col 56}{space 4}-258.4913{col 69}{space 3} 38.11869
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-429.5323{col 28}{space 2} 207.4129{col 39}{space 1}   -2.07{col 48}{space 3}0.040{col 56}{space 4}-839.3823{col 69}{space 3}-19.68219
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 176.9895{col 28}{space 2} 105.2934{col 39}{space 1}    1.68{col 48}{space 3}0.095{col 56}{space 4}-31.07138{col 69}{space 3} 385.0503
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-8.617715{col 28}{space 2} 66.02812{col 39}{space 1}   -0.13{col 48}{space 3}0.896{col 56}{space 4}-139.0899{col 69}{space 3} 121.8545
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-6.560636{col 28}{space 2} 3.265468{col 39}{space 1}   -2.01{col 48}{space 3}0.046{col 56}{space 4}-13.01336{col 69}{space 3}-.1079129
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-163.1121{col 28}{space 2} 57.01902{col 39}{space 1}   -2.86{col 48}{space 3}0.005{col 56}{space 4}-275.7823{col 69}{space 3}-50.44194
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0397647{col 28}{space 2} .0409715{col 39}{space 1}    0.97{col 48}{space 3}0.333{col 56}{space 4}-.0411958{col 69}{space 3} .1207252
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2.765434{col 28}{space 2} 3.812394{col 39}{space 1}    0.73{col 48}{space 3}0.469{col 56}{space 4}-4.767899{col 69}{space 3} 10.29877
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} 7.322901{col 28}{space 2} 47.33238{col 39}{space 1}    0.15{col 48}{space 3}0.877{col 56}{space 4}-86.32051{col 69}{space 3} 100.9663
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 1.318741{col 28}{space 2} 1.146854{col 39}{space 1}    1.15{col 48}{space 3}0.252{col 56}{space 4}-.9481399{col 69}{space 3} 3.585622
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0016472{col 28}{space 2} .0002407{col 39}{space 1}    6.84{col 48}{space 3}0.000{col 56}{space 4} .0011715{col 69}{space 3} .0021229
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1843.712{col 28}{space 2} 359.8379{col 39}{space 1}    5.12{col 48}{space 3}0.000{col 56}{space 4} 1132.651{col 69}{space 3} 2554.772
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0004
{txt}{col 49}Largest FMI{col 67}= {res}    0.0049
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    148.23
{txt}{col 49}        avg{col 67}= {res}    148.93
{txt}{col 49}        max{col 67}= {res}    149.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}     15.31
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-117.0335{col 28}{space 2} 76.08086{col 39}{space 1}   -1.54{col 48}{space 3}0.126{col 56}{space 4}  -267.37{col 69}{space 3}  33.3031
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-478.3406{col 28}{space 2} 210.2951{col 39}{space 1}   -2.27{col 48}{space 3}0.024{col 56}{space 4}-893.8856{col 69}{space 3}-62.79561
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}   200.25{col 28}{space 2} 106.7596{col 39}{space 1}    1.88{col 48}{space 3}0.063{col 56}{space 4}-10.70798{col 69}{space 3} 411.2079
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} -120.716{col 28}{space 2} 66.94753{col 39}{space 1}   -1.80{col 48}{space 3}0.073{col 56}{space 4}-253.0049{col 69}{space 3} 11.57301
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-5.101126{col 28}{space 2} 3.307698{col 39}{space 1}   -1.54{col 48}{space 3}0.125{col 56}{space 4}-11.63718{col 69}{space 3} 1.434928
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-156.8257{col 28}{space 2} 57.81109{col 39}{space 1}   -2.71{col 48}{space 3}0.007{col 56}{space 4}-271.0609{col 69}{space 3}-42.59045
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0847632{col 28}{space 2} .0415279{col 39}{space 1}    2.04{col 48}{space 3}0.043{col 56}{space 4} .0027037{col 69}{space 3} .1668227
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2.540065{col 28}{space 2} 3.865264{col 39}{space 1}    0.66{col 48}{space 3}0.512{col 56}{space 4}-5.097733{col 69}{space 3} 10.17786
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}  19.6694{col 28}{space 2} 46.86877{col 39}{space 1}    0.42{col 48}{space 3}0.675{col 56}{space 4}-72.94784{col 69}{space 3} 112.2866
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 1.794413{col 28}{space 2} 1.151876{col 39}{space 1}    1.56{col 48}{space 3}0.121{col 56}{space 4}-.4817437{col 69}{space 3}  4.07057
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021553{col 28}{space 2} .0002441{col 39}{space 1}    8.83{col 48}{space 3}0.000{col 56}{space 4} .0016729{col 69}{space 3} .0026376
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1412.663{col 28}{space 2} 364.4111{col 39}{space 1}    3.88{col 48}{space 3}0.000{col 56}{space 4} 692.5809{col 69}{space 3} 2132.744
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0003
{txt}{col 49}Largest FMI{col 67}= {res}    0.0029
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    148.60
{txt}{col 49}        avg{col 67}= {res}    148.98
{txt}{col 49}        max{col 67}= {res}    149.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}      2.34
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0109

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 3.328633{col 28}{space 2} .9787989{col 39}{space 1}    3.40{col 48}{space 3}0.001{col 56}{space 4} 1.394518{col 69}{space 3} 5.262749
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 2.867036{col 28}{space 2} 2.705561{col 39}{space 1}    1.06{col 48}{space 3}0.291{col 56}{space 4}-2.479178{col 69}{space 3} 8.213249
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.6550551{col 28}{space 2} 1.373523{col 39}{space 1}   -0.48{col 48}{space 3}0.634{col 56}{space 4} -3.36915{col 69}{space 3}  2.05904
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .5720412{col 28}{space 2} .8613361{col 39}{space 1}    0.66{col 48}{space 3}0.508{col 56}{space 4}-1.129968{col 69}{space 3}  2.27405
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-.0033038{col 28}{space 2} .0425512{col 39}{space 1}   -0.08{col 48}{space 3}0.938{col 56}{space 4}-.0873854{col 69}{space 3} .0807777
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}  1.34744{col 28}{space 2} .7437707{col 39}{space 1}    1.81{col 48}{space 3}0.072{col 56}{space 4}-.1222578{col 69}{space 3} 2.817137
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0010952{col 28}{space 2} .0005343{col 39}{space 1}   -2.05{col 48}{space 3}0.042{col 56}{space 4}-.0021509{col 69}{space 3}-.0000394
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0849648{col 28}{space 2} .0497301{col 39}{space 1}    1.71{col 48}{space 3}0.090{col 56}{space 4}-.0133024{col 69}{space 3}  .183232
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-.1862715{col 28}{space 2} .6024231{col 39}{space 1}   -0.31{col 48}{space 3}0.758{col 56}{space 4}-1.376694{col 69}{space 3} 1.004151
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2}-.0110455{col 28}{space 2} .0148125{col 39}{space 1}   -0.75{col 48}{space 3}0.457{col 56}{space 4}-.0403153{col 69}{space 3} .0182244
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.19e-06{col 28}{space 2} 3.14e-06{col 39}{space 1}    0.70{col 48}{space 3}0.487{col 56}{space 4}-4.02e-06{col 69}{space 3} 8.39e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-6.232661{col 28}{space 2} 4.687831{col 39}{space 1}   -1.33{col 48}{space 3}0.186{col 56}{space 4}-15.49587{col 69}{space 3} 3.030545
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 4: MODEL 2+liver/kidney disease******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.1519
{txt}{col 49}Largest FMI{col 67}= {res}    0.6805
{txt}{col 49}Complete DF{col 67}= {res}        54
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      6.94
{txt}{col 49}        avg{col 67}= {res}     43.83
{txt}{col 49}        max{col 67}= {res}     51.31
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   49.8{txt}){col 67}= {res}      3.27
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0020

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 31.31216{col 26}{space 2} 108.9617{col 37}{space 1}    0.29{col 46}{space 3}0.775{col 54}{space 4} -187.977{col 67}{space 3} 250.6013
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 88.75671{col 26}{space 2} 139.1344{col 37}{space 1}    0.64{col 46}{space 3}0.529{col 54}{space 4}-196.4954{col 67}{space 3} 374.0088
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-9.364348{col 26}{space 2} 5.722181{col 37}{space 1}   -1.64{col 46}{space 3}0.108{col 54}{space 4}-20.85044{col 67}{space 3} 2.121748
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-211.0051{col 26}{space 2} 85.65077{col 37}{space 1}   -2.46{col 46}{space 3}0.017{col 54}{space 4}-383.0037{col 67}{space 3}-39.00648
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0311153{col 26}{space 2} .0673775{col 37}{space 1}    0.46{col 46}{space 3}0.646{col 54}{space 4}-.1045944{col 67}{space 3}  .166825
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .3359013{col 26}{space 2} 6.752444{col 37}{space 1}    0.05{col 46}{space 3}0.961{col 54}{space 4}-13.22146{col 67}{space 3} 13.89327
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 75.86168{col 26}{space 2} 255.0798{col 37}{space 1}    0.30{col 46}{space 3}0.775{col 54}{space 4}-528.3132{col 67}{space 3} 680.0366
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-4044.527{col 26}{space 2} 5416.196{col 37}{space 1}   -0.75{col 46}{space 3}0.459{col 54}{space 4} -14921.7{col 67}{space 3} 6832.649
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 2.856216{col 26}{space 2} 12.36908{col 37}{space 1}    0.23{col 46}{space 3}0.818{col 54}{space 4}-22.02851{col 67}{space 3} 27.74094
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.2069154{col 26}{space 2} 1.894391{col 37}{space 1}   -0.11{col 46}{space 3}0.913{col 54}{space 4}-4.018774{col 67}{space 3} 3.604943
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-12.79206{col 26}{space 2} 30.35379{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}-73.73019{col 67}{space 3} 48.14608
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}  .001195{col 26}{space 2} .0004309{col 37}{space 1}    2.77{col 46}{space 3}0.008{col 54}{space 4} .0003276{col 67}{space 3} .0020623
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6441.024{col 26}{space 2} 5495.116{col 37}{space 1}    1.17{col 46}{space 3}0.247{col 54}{space 4}-4591.112{col 67}{space 3} 17473.16
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0691
{txt}{col 49}Largest FMI{col 67}= {res}    0.4626
{txt}{col 49}Complete DF{col 67}= {res}        54
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     13.43
{txt}{col 49}        avg{col 67}= {res}     46.95
{txt}{col 49}        max{col 67}= {res}     51.92
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   51.4{txt}){col 67}= {res}      3.95
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0004

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}  22.5495{col 26}{space 2} 106.2862{col 37}{space 1}    0.21{col 46}{space 3}0.833{col 54}{space 4}-191.0599{col 67}{space 3} 236.1589
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-13.83137{col 26}{space 2} 128.3357{col 37}{space 1}   -0.11{col 46}{space 3}0.915{col 54}{space 4}-272.9352{col 67}{space 3} 245.2725
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-9.417839{col 26}{space 2} 5.621484{col 37}{space 1}   -1.68{col 46}{space 3}0.100{col 54}{space 4}-20.69856{col 67}{space 3} 1.862885
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-226.2517{col 26}{space 2} 83.78526{col 37}{space 1}   -2.70{col 46}{space 3}0.009{col 54}{space 4} -394.399{col 67}{space 3}-58.10436
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0759641{col 26}{space 2} .0652912{col 37}{space 1}    1.16{col 46}{space 3}0.250{col 54}{space 4}-.0552487{col 67}{space 3} .2071769
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-5.512912{col 26}{space 2} 6.623236{col 37}{space 1}   -0.83{col 46}{space 3}0.409{col 54}{space 4}-18.80538{col 67}{space 3} 7.779555
{txt}w1Creatinine {c |}{col 14}{res}{space 2}  77.0417{col 26}{space 2} 203.6084{col 37}{space 1}    0.38{col 46}{space 3}0.711{col 54}{space 4} -361.392{col 67}{space 3} 515.4754
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 495.1447{col 26}{space 2} 5334.673{col 37}{space 1}    0.09{col 46}{space 3}0.926{col 54}{space 4}-10216.26{col 67}{space 3} 11206.55
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 12.61985{col 26}{space 2}  12.0222{col 37}{space 1}    1.05{col 46}{space 3}0.299{col 54}{space 4}-11.52783{col 67}{space 3} 36.76753
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.8189551{col 26}{space 2} 1.843442{col 37}{space 1}   -0.44{col 46}{space 3}0.659{col 54}{space 4}-4.522531{col 67}{space 3}  2.88462
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-8.057853{col 26}{space 2}   29.862{col 37}{space 1}   -0.27{col 46}{space 3}0.788{col 54}{space 4}-67.99459{col 67}{space 3} 51.87889
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0015899{col 26}{space 2} .0004174{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .0007513{col 67}{space 3} .0024285
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1726.251{col 26}{space 2} 5420.034{col 37}{space 1}    0.32{col 46}{space 3}0.751{col 54}{space 4}-9154.361{col 67}{space 3} 12606.86
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0174
{txt}{col 49}Largest FMI{col 67}= {res}    0.0609
{txt}{col 49}Complete DF{col 67}= {res}        54
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     47.33
{txt}{col 49}        avg{col 67}= {res}     50.93
{txt}{col 49}        max{col 67}= {res}     51.83
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   52.0{txt}){col 67}= {res}      1.77
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0844

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.761894{col 26}{space 2} 1.257469{col 37}{space 1}    2.20{col 46}{space 3}0.033{col 54}{space 4} .2368788{col 67}{space 3} 5.286909
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .0500653{col 26}{space 2} 1.454933{col 37}{space 1}    0.03{col 46}{space 3}0.973{col 54}{space 4} -2.86981{col 67}{space 3}  2.96994
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -.013687{col 26}{space 2} .0673831{col 37}{space 1}   -0.20{col 46}{space 3}0.840{col 54}{space 4}-.1489327{col 67}{space 3} .1215587
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} .1641041{col 26}{space 2}  1.00657{col 37}{space 1}    0.16{col 46}{space 3}0.871{col 54}{space 4}  -1.8567{col 67}{space 3} 2.184908
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0010469{col 26}{space 2} .0007762{col 37}{space 1}   -1.35{col 46}{space 3}0.183{col 54}{space 4} -.002606{col 67}{space 3} .0005122
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .1160117{col 26}{space 2} .0796852{col 37}{space 1}    1.46{col 46}{space 3}0.152{col 54}{space 4}-.0439907{col 67}{space 3}  .276014
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 1.817668{col 26}{space 2} 1.921414{col 37}{space 1}    0.95{col 46}{space 3}0.349{col 54}{space 4}-2.047014{col 67}{space 3}  5.68235
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-92.65687{col 26}{space 2} 63.32568{col 37}{space 1}   -1.46{col 46}{space 3}0.149{col 54}{space 4}-219.7528{col 67}{space 3} 34.43912
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} .0930521{col 26}{space 2} .1418008{col 37}{space 1}    0.66{col 46}{space 3}0.515{col 54}{space 4}-.1915148{col 67}{space 3} .3776191
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0160679{col 26}{space 2} .0217053{col 37}{space 1}   -0.74{col 46}{space 3}0.462{col 54}{space 4}-.0596284{col 67}{space 3} .0274926
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-.3029564{col 26}{space 2}  .356058{col 37}{space 1}   -0.85{col 46}{space 3}0.399{col 54}{space 4}-1.017532{col 67}{space 3} .4116192
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 6.94e-06{col 26}{space 2} 4.94e-06{col 37}{space 1}    1.40{col 46}{space 3}0.166{col 54}{space 4}-2.98e-06{col 67}{space 3} .0000169
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 85.55495{col 26}{space 2} 64.51275{col 37}{space 1}    1.33{col 46}{space 3}0.191{col 54}{space 4}-43.92282{col 67}{space 3} 215.0327
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0246
{txt}{col 49}Largest FMI{col 67}= {res}    0.1582
{txt}{col 49}Complete DF{col 67}= {res}        83
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     50.59
{txt}{col 49}        avg{col 67}= {res}     74.96
{txt}{col 49}        max{col 67}= {res}     80.68
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   80.8{txt}){col 67}= {res}      6.35
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-115.2075{col 26}{space 2} 86.79175{col 37}{space 1}   -1.33{col 46}{space 3}0.188{col 54}{space 4}-287.9075{col 67}{space 3} 57.49254
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-61.66019{col 26}{space 2} 115.6685{col 37}{space 1}   -0.53{col 46}{space 3}0.595{col 54}{space 4}-291.8438{col 67}{space 3} 168.5234
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -1.91687{col 26}{space 2} 4.889486{col 37}{space 1}   -0.39{col 46}{space 3}0.696{col 54}{space 4}-11.64599{col 67}{space 3} 7.812251
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-84.25708{col 26}{space 2} 83.48796{col 37}{space 1}   -1.01{col 46}{space 3}0.316{col 54}{space 4}-250.3899{col 67}{space 3} 81.87571
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0500404{col 26}{space 2} .0576882{col 37}{space 1}    0.87{col 46}{space 3}0.388{col 54}{space 4}-.0647566{col 67}{space 3} .1648374
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  8.75071{col 26}{space 2} 5.912594{col 37}{space 1}    1.48{col 46}{space 3}0.143{col 54}{space 4}-3.014739{col 67}{space 3} 20.51616
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-151.9538{col 26}{space 2} 219.3072{col 37}{space 1}   -0.69{col 46}{space 3}0.492{col 54}{space 4}-592.3179{col 67}{space 3} 288.4102
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-4253.308{col 26}{space 2} 7204.487{col 37}{space 1}   -0.59{col 46}{space 3}0.557{col 54}{space 4}-18650.02{col 67}{space 3} 10143.41
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 13.53303{col 26}{space 2} 9.916906{col 37}{space 1}    1.36{col 46}{space 3}0.177{col 54}{space 4}-6.226934{col 67}{space 3} 33.29299
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2} -1.74819{col 26}{space 2} 1.600526{col 37}{space 1}   -1.09{col 46}{space 3}0.278{col 54}{space 4} -4.93299{col 67}{space 3}  1.43661
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-.1189352{col 26}{space 2} 29.60479{col 37}{space 1}   -0.00{col 46}{space 3}0.997{col 54}{space 4}-59.03607{col 67}{space 3}  58.7982
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0020432{col 26}{space 2} .0003375{col 37}{space 1}    6.05{col 46}{space 3}0.000{col 54}{space 4} .0013716{col 67}{space 3} .0027148
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5406.102{col 26}{space 2} 7165.996{col 37}{space 1}    0.75{col 46}{space 3}0.453{col 54}{space 4}-8911.985{col 67}{space 3} 19724.19
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0141
{txt}{col 49}Largest FMI{col 67}= {res}    0.0992
{txt}{col 49}Complete DF{col 67}= {res}        83
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     63.47
{txt}{col 49}        avg{col 67}= {res}     77.00
{txt}{col 49}        max{col 67}= {res}     80.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   81.0{txt}){col 67}= {res}      8.58
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-128.7651{col 26}{space 2} 87.44133{col 37}{space 1}   -1.47{col 46}{space 3}0.145{col 54}{space 4}-302.7462{col 67}{space 3}  45.2159
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-172.8187{col 26}{space 2} 116.5285{col 37}{space 1}   -1.48{col 46}{space 3}0.142{col 54}{space 4}-404.6953{col 67}{space 3}  59.0578
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.188878{col 26}{space 2} 4.928726{col 37}{space 1}    0.24{col 46}{space 3}0.810{col 54}{space 4}-8.617853{col 67}{space 3} 10.99561
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-51.42835{col 26}{space 2} 84.29024{col 37}{space 1}   -0.61{col 46}{space 3}0.543{col 54}{space 4}-219.1587{col 67}{space 3}  116.302
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}  .098482{col 26}{space 2}    .0581{col 37}{space 1}    1.70{col 46}{space 3}0.094{col 54}{space 4}-.0171244{col 67}{space 3} .2140884
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 12.93121{col 26}{space 2} 5.961185{col 37}{space 1}    2.17{col 46}{space 3}0.033{col 54}{space 4} 1.069606{col 67}{space 3} 24.79281
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-85.35259{col 26}{space 2} 211.4704{col 37}{space 1}   -0.40{col 46}{space 3}0.688{col 54}{space 4}-507.0608{col 67}{space 3} 336.3556
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-5287.928{col 26}{space 2} 7266.107{col 37}{space 1}   -0.73{col 46}{space 3}0.469{col 54}{space 4}-19805.97{col 67}{space 3} 9230.113
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 14.38847{col 26}{space 2} 9.936938{col 37}{space 1}    1.45{col 46}{space 3}0.152{col 54}{space 4}-5.399843{col 67}{space 3} 34.17679
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.5440909{col 26}{space 2} 1.612437{col 37}{space 1}   -0.34{col 46}{space 3}0.737{col 54}{space 4}-3.752373{col 67}{space 3} 2.664191
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-14.14524{col 26}{space 2} 29.75184{col 37}{space 1}   -0.48{col 46}{space 3}0.636{col 54}{space 4}-73.34443{col 67}{space 3} 45.05394
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0026285{col 26}{space 2} .0003403{col 37}{space 1}    7.72{col 46}{space 3}0.000{col 54}{space 4} .0019513{col 67}{space 3} .0033058
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5654.709{col 26}{space 2} 7228.582{col 37}{space 1}    0.78{col 46}{space 3}0.437{col 54}{space 4}-8787.002{col 67}{space 3} 20096.42
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0051
{txt}{col 49}Largest FMI{col 67}= {res}    0.0463
{txt}{col 49}Complete DF{col 67}= {res}        83
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     74.72
{txt}{col 49}        avg{col 67}= {res}     80.13
{txt}{col 49}        max{col 67}= {res}     81.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   81.0{txt}){col 67}= {res}      1.62
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1093

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 3.332854{col 26}{space 2} 1.166845{col 37}{space 1}    2.86{col 46}{space 3}0.005{col 54}{space 4} 1.011222{col 67}{space 3} 5.654485
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.9915705{col 26}{space 2} 1.552591{col 37}{space 1}   -0.64{col 46}{space 3}0.525{col 54}{space 4}-4.080811{col 67}{space 3}  2.09767
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}  -.03091{col 26}{space 2} .0657649{col 37}{space 1}   -0.47{col 46}{space 3}0.640{col 54}{space 4}-.1617609{col 67}{space 3} .0999409
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.855333{col 26}{space 2} 1.121758{col 37}{space 1}    1.65{col 46}{space 3}0.102{col 54}{space 4}-.3766175{col 67}{space 3} 4.087284
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0011752{col 26}{space 2} .0007755{col 37}{space 1}   -1.52{col 46}{space 3}0.134{col 54}{space 4}-.0027183{col 67}{space 3} .0003678
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} -.017829{col 26}{space 2} .0794107{col 37}{space 1}   -0.22{col 46}{space 3}0.823{col 54}{space 4}-.1758296{col 67}{space 3} .1401715
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-.1321446{col 26}{space 2} 2.794296{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-5.699013{col 67}{space 3} 5.434724
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 147.9057{col 26}{space 2} 93.23416{col 37}{space 1}    1.59{col 46}{space 3}0.117{col 54}{space 4}-37.66983{col 67}{space 3} 333.4811
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}-.0090264{col 26}{space 2} .1310413{col 37}{space 1}   -0.07{col 46}{space 3}0.945{col 54}{space 4}-.2697975{col 67}{space 3} .2517446
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0054664{col 26}{space 2} .0215098{col 37}{space 1}   -0.25{col 46}{space 3}0.800{col 54}{space 4}-.0482639{col 67}{space 3} .0373311
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} .3766383{col 26}{space 2} .3969915{col 37}{space 1}    0.95{col 46}{space 3}0.346{col 54}{space 4}-.4132685{col 67}{space 3} 1.166545
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.97e-06{col 26}{space 2} 4.53e-06{col 37}{space 1}    0.43{col 46}{space 3}0.665{col 54}{space 4}-7.05e-06{col 67}{space 3}  .000011
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-153.1878{col 26}{space 2} 92.84882{col 37}{space 1}   -1.65{col 46}{space 3}0.103{col 54}{space 4}-337.9999{col 67}{space 3} 31.62429
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. **INTERACTION by Race**
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0472
{txt}{col 49}Largest FMI{col 67}= {res}    0.4175
{txt}{col 49}Complete DF{col 67}= {res}       148
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     21.72
{txt}{col 49}        avg{col 67}= {res}    131.77
{txt}{col 49}        max{col 67}= {res}    145.86
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  144.7{txt}){col 67}= {res}      9.50
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-78.13312{col 28}{space 2} 72.88165{col 39}{space 1}   -1.07{col 48}{space 3}0.285{col 56}{space 4}-222.1907{col 69}{space 3} 65.92443
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-327.7662{col 28}{space 2} 210.8175{col 39}{space 1}   -1.55{col 48}{space 3}0.122{col 56}{space 4}-744.5455{col 69}{space 3} 89.01303
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 132.0209{col 28}{space 2} 105.1994{col 39}{space 1}    1.25{col 48}{space 3}0.212{col 56}{space 4}-75.92422{col 69}{space 3}  339.966
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 9.440869{col 28}{space 2} 84.52827{col 39}{space 1}    0.11{col 48}{space 3}0.911{col 56}{space 4}-157.9098{col 69}{space 3} 176.7916
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-6.979155{col 28}{space 2} 3.400895{col 39}{space 1}   -2.05{col 48}{space 3}0.042{col 56}{space 4}-13.70066{col 69}{space 3}-.2576517
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-148.1104{col 28}{space 2}  58.1629{col 39}{space 1}   -2.55{col 48}{space 3}0.012{col 56}{space 4}-263.0627{col 69}{space 3}-33.15806
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0270208{col 28}{space 2} .0412054{col 39}{space 1}    0.66{col 48}{space 3}0.513{col 56}{space 4}-.0544173{col 69}{space 3} .1084588
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 4.183868{col 28}{space 2} 4.237365{col 39}{space 1}    0.99{col 48}{space 3}0.325{col 56}{space 4}-4.190799{col 69}{space 3} 12.55854
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2}-14.83592{col 28}{space 2} 153.8345{col 39}{space 1}   -0.10{col 48}{space 3}0.924{col 56}{space 4}-334.1038{col 69}{space 3}  304.432
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-2690.205{col 28}{space 2} 4331.346{col 39}{space 1}   -0.62{col 48}{space 3}0.536{col 56}{space 4}-11259.02{col 69}{space 3}  5878.61
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 8.330645{col 28}{space 2} 7.458977{col 39}{space 1}    1.12{col 48}{space 3}0.266{col 56}{space 4}-6.429811{col 69}{space 3}  23.0911
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.8702712{col 28}{space 2} 1.172184{col 39}{space 1}   -0.74{col 48}{space 3}0.459{col 56}{space 4}-3.186949{col 69}{space 3} 1.446407
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-7.802457{col 28}{space 2} 20.88108{col 39}{space 1}   -0.37{col 48}{space 3}0.709{col 56}{space 4}-49.07221{col 69}{space 3}  33.4673
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0016621{col 28}{space 2} .0002505{col 39}{space 1}    6.64{col 48}{space 3}0.000{col 56}{space 4}  .001167{col 69}{space 3} .0021571
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 4594.718{col 28}{space 2} 4346.649{col 39}{space 1}    1.06{col 48}{space 3}0.292{col 56}{space 4} -4004.54{col 69}{space 3} 13193.97
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0143
{txt}{col 49}Largest FMI{col 67}= {res}    0.1450
{txt}{col 49}Complete DF{col 67}= {res}       148
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     79.92
{txt}{col 49}        avg{col 67}= {res}    139.60
{txt}{col 49}        max{col 67}= {res}    145.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  145.9{txt}){col 67}= {res}     12.04
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-77.55402{col 28}{space 2} 74.26887{col 39}{space 1}   -1.04{col 48}{space 3}0.298{col 56}{space 4}-224.3382{col 69}{space 3} 69.23019
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-344.0239{col 28}{space 2} 214.0884{col 39}{space 1}   -1.61{col 48}{space 3}0.110{col 56}{space 4}-767.1621{col 69}{space 3}  79.1143
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}  140.221{col 28}{space 2} 107.1399{col 39}{space 1}    1.31{col 48}{space 3}0.193{col 56}{space 4} -71.5322{col 69}{space 3} 351.9741
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-86.65018{col 28}{space 2}   84.408{col 39}{space 1}   -1.03{col 48}{space 3}0.306{col 56}{space 4} -253.504{col 69}{space 3} 80.20367
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-5.505767{col 28}{space 2} 3.475724{col 39}{space 1}   -1.58{col 48}{space 3}0.115{col 56}{space 4}  -12.375{col 69}{space 3} 1.363469
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-139.7752{col 28}{space 2} 59.48671{col 39}{space 1}   -2.35{col 48}{space 3}0.020{col 56}{space 4}-257.3427{col 69}{space 3}-22.20761
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0648142{col 28}{space 2} .0421259{col 39}{space 1}    1.54{col 48}{space 3}0.126{col 56}{space 4}-.0184416{col 69}{space 3}   .14807
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 4.487506{col 28}{space 2} 4.331923{col 39}{space 1}    1.04{col 48}{space 3}0.302{col 56}{space 4}-4.073894{col 69}{space 3} 13.04891
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} 13.98497{col 28}{space 2} 133.8706{col 39}{space 1}    0.10{col 48}{space 3}0.917{col 56}{space 4}  -252.43{col 69}{space 3} 280.3999
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-674.1969{col 28}{space 2} 4407.885{col 39}{space 1}   -0.15{col 48}{space 3}0.879{col 56}{space 4}-9391.375{col 69}{space 3} 8042.981
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 10.47654{col 28}{space 2} 7.478566{col 39}{space 1}    1.40{col 48}{space 3}0.163{col 56}{space 4} -4.30594{col 69}{space 3} 25.25903
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.2996477{col 28}{space 2} 1.198927{col 39}{space 1}   -0.25{col 48}{space 3}0.803{col 56}{space 4}-2.669161{col 69}{space 3} 2.069866
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-15.68806{col 28}{space 2} 21.34347{col 39}{space 1}   -0.74{col 48}{space 3}0.464{col 56}{space 4}-57.87073{col 69}{space 3} 26.49462
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021416{col 28}{space 2} .0002563{col 39}{space 1}    8.36{col 48}{space 3}0.000{col 56}{space 4} .0016351{col 69}{space 3} .0026481
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}   2101.2{col 28}{space 2} 4421.181{col 39}{space 1}    0.48{col 48}{space 3}0.635{col 56}{space 4}-6642.153{col 69}{space 3} 10844.55
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0021
{txt}{col 49}Largest FMI{col 67}= {res}    0.0209
{txt}{col 49}Complete DF{col 67}= {res}       148
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    141.02
{txt}{col 49}        avg{col 67}= {res}    145.52
{txt}{col 49}        max{col 67}= {res}    145.99
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  146.0{txt}){col 67}= {res}      1.93
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0311

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 2.846291{col 28}{space 2} .9455554{col 39}{space 1}    3.01{col 48}{space 3}0.003{col 56}{space 4} .9775454{col 69}{space 3} 4.715037
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.958821{col 28}{space 2} 2.721048{col 39}{space 1}    0.72{col 48}{space 3}0.473{col 56}{space 4}-3.418916{col 69}{space 3} 7.336558
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.1204022{col 28}{space 2} 1.363091{col 39}{space 1}   -0.09{col 48}{space 3}0.930{col 56}{space 4}-2.814342{col 69}{space 3} 2.573538
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-.0787653{col 28}{space 2}  1.06863{col 39}{space 1}   -0.07{col 48}{space 3}0.941{col 56}{space 4}-2.190788{col 69}{space 3} 2.033257
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-.0077999{col 28}{space 2} .0443152{col 39}{space 1}   -0.18{col 48}{space 3}0.861{col 56}{space 4}-.0953825{col 69}{space 3} .0797827
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} 1.213717{col 28}{space 2} .7577952{col 39}{space 1}    1.60{col 48}{space 3}0.111{col 56}{space 4}-.2839487{col 69}{space 3} 2.711383
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0010234{col 28}{space 2} .0005371{col 39}{space 1}   -1.91{col 48}{space 3}0.059{col 56}{space 4}-.0020849{col 69}{space 3} .0000381
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}  .047329{col 28}{space 2} .0552184{col 39}{space 1}    0.86{col 48}{space 3}0.393{col 56}{space 4} -.061802{col 69}{space 3} .1564599
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} .4983881{col 28}{space 2} 1.602625{col 39}{space 1}    0.31{col 48}{space 3}0.756{col 56}{space 4}-2.669887{col 69}{space 3} 3.666663
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} 29.81575{col 28}{space 2} 55.31305{col 39}{space 1}    0.54{col 48}{space 3}0.591{col 56}{space 4}-79.50542{col 69}{space 3} 139.1369
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} .0488246{col 28}{space 2} .0948005{col 39}{space 1}    0.52{col 48}{space 3}0.607{col 56}{space 4}-.1385362{col 69}{space 3} .2361855
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.0077929{col 28}{space 2} .0152805{col 39}{space 1}   -0.51{col 48}{space 3}0.611{col 56}{space 4}-.0379927{col 69}{space 3} .0224069
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2} .0993798{col 28}{space 2} .2718459{col 39}{space 1}    0.37{col 48}{space 3}0.715{col 56}{space 4}-.4378821{col 69}{space 3} .6366417
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.72e-06{col 28}{space 2} 3.27e-06{col 39}{space 1}    0.83{col 48}{space 3}0.407{col 56}{space 4}-3.74e-06{col 69}{space 3} 9.17e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-36.37592{col 28}{space 2}  55.4956{col 39}{space 1}   -0.66{col 48}{space 3}0.513{col 56}{space 4} -146.058{col 69}{space 3} 73.30615
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0478
{txt}{col 49}Largest FMI{col 67}= {res}    0.4003
{txt}{col 49}Complete DF{col 67}= {res}       149
{txt}{col 49}DF:     min{col 67}= {res}     23.29
{txt}{col 49}        avg{col 67}= {res}    132.51
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}        max{col 67}= {res}    146.95
{txt}{col 49}{help j_robustsingular##|_new:F(  12,      .)}{col 67}=          {res}.
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}=          {res}.

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-32.40472{col 26}{space 2} 63.09187{col 37}{space 1}   -0.51{col 46}{space 3}0.608{col 54}{space 4}-157.0957{col 67}{space 3} 92.28622
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 16.56706{col 26}{space 2}  84.2657{col 37}{space 1}    0.20{col 46}{space 3}0.844{col 54}{space 4}-150.2148{col 67}{space 3} 183.3489
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.921567{col 26}{space 2} 3.409534{col 37}{space 1}   -2.03{col 46}{space 3}0.044{col 54}{space 4}-13.65985{col 67}{space 3}-.1832824
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-74.48022{col 26}{space 2} 58.24245{col 37}{space 1}   -1.28{col 46}{space 3}0.203{col 54}{space 4}-189.6032{col 67}{space 3} 40.64276
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} -150.299{col 26}{space 2} 58.27167{col 37}{space 1}   -2.58{col 46}{space 3}0.011{col 54}{space 4}-265.4604{col 67}{space 3}-35.13749
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0237475{col 26}{space 2} .0412189{col 37}{space 1}    0.58{col 46}{space 3}0.565{col 54}{space 4}-.0577132{col 67}{space 3} .1052081
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 3.707083{col 26}{space 2} 4.232274{col 37}{space 1}    0.88{col 46}{space 3}0.383{col 54}{space 4}-4.657177{col 67}{space 3} 12.07134
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-29.64916{col 26}{space 2}  151.471{col 37}{space 1}   -0.20{col 46}{space 3}0.847{col 54}{space 4}-342.7714{col 67}{space 3} 283.4731
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-3246.446{col 26}{space 2} 4317.722{col 37}{space 1}   -0.75{col 46}{space 3}0.453{col 54}{space 4}-11787.98{col 67}{space 3} 5295.091
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 8.693811{col 26}{space 2} 7.445537{col 37}{space 1}    1.17{col 46}{space 3}0.245{col 54}{space 4}-6.035887{col 67}{space 3} 23.42351
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.7784001{col 26}{space 2}  1.17191{col 37}{space 1}   -0.66{col 46}{space 3}0.508{col 54}{space 4}-3.094395{col 67}{space 3} 1.537595
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-5.152986{col 26}{space 2}  20.8226{col 37}{space 1}   -0.25{col 46}{space 3}0.805{col 54}{space 4}-46.30508{col 67}{space 3} 35.99911
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0016125{col 26}{space 2} .0002478{col 37}{space 1}    6.51{col 46}{space 3}0.000{col 54}{space 4} .0011228{col 67}{space 3} .0021022
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  5203.48{col 26}{space 2} 4330.085{col 37}{space 1}    1.20{col 46}{space 3}0.232{col 54}{space 4}-3362.542{col 67}{space 3}  13769.5
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0140
{txt}{col 49}Largest FMI{col 67}= {res}    0.1291
{txt}{col 49}Complete DF{col 67}= {res}       149
{txt}{col 49}DF:     min{col 67}= {res}     87.64
{txt}{col 49}        avg{col 67}= {res}    140.65
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}        max{col 67}= {res}    146.95
{txt}{col 49}{help j_robustsingular##|_new:F(  12,      .)}{col 67}=          {res}.
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}=          {res}.

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-28.97278{col 26}{space 2} 64.46471{col 37}{space 1}   -0.45{col 46}{space 3}0.654{col 54}{space 4}-156.3718{col 67}{space 3} 98.42628
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-79.09067{col 26}{space 2} 84.28693{col 37}{space 1}   -0.94{col 46}{space 3}0.350{col 54}{space 4}-245.6875{col 67}{space 3} 87.50621
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-5.445201{col 26}{space 2}   3.4844{col 37}{space 1}   -1.56{col 46}{space 3}0.120{col 54}{space 4}-12.33121{col 67}{space 3} 1.440812
{txt}{space 8}Race {c |}{col 14}{res}{space 2}-75.02136{col 26}{space 2} 59.26204{col 37}{space 1}   -1.27{col 46}{space 3}0.208{col 54}{space 4}  -192.14{col 67}{space 3}  42.0973
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-142.1054{col 26}{space 2} 59.61801{col 37}{space 1}   -2.38{col 46}{space 3}0.018{col 54}{space 4}-259.9263{col 67}{space 3} -24.2845
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0613439{col 26}{space 2} .0421461{col 37}{space 1}    1.46{col 46}{space 3}0.148{col 54}{space 4}-.0219472{col 67}{space 3} .1446349
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 3.982628{col 26}{space 2} 4.325233{col 37}{space 1}    0.92{col 46}{space 3}0.359{col 54}{space 4}-4.565067{col 67}{space 3} 12.53032
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-1.678794{col 26}{space 2} 132.3599{col 37}{space 1}   -0.01{col 46}{space 3}0.990{col 54}{space 4}-264.7313{col 67}{space 3} 261.3737
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-1265.032{col 26}{space 2} 4399.772{col 37}{space 1}   -0.29{col 46}{space 3}0.774{col 54}{space 4} -9966.28{col 67}{space 3} 7436.215
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 10.85956{col 26}{space 2}   7.4797{col 37}{space 1}    1.45{col 46}{space 3}0.149{col 54}{space 4} -3.92368{col 67}{space 3}  25.6428
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.2016149{col 26}{space 2} 1.199127{col 37}{space 1}   -0.17{col 46}{space 3}0.867{col 54}{space 4}-2.571378{col 67}{space 3} 2.168148
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} -12.8714{col 26}{space 2} 21.29289{col 37}{space 1}   -0.60{col 46}{space 3}0.546{col 54}{space 4}-54.95199{col 67}{space 3} 29.20919
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0020889{col 26}{space 2} .0002537{col 37}{space 1}    8.23{col 46}{space 3}0.000{col 54}{space 4} .0015875{col 67}{space 3} .0025902
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  2743.68{col 26}{space 2} 4410.826{col 37}{space 1}    0.62{col 46}{space 3}0.535{col 54}{space 4}-5979.269{col 67}{space 3} 11466.63
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1  
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0022
{txt}{col 49}Largest FMI{col 67}= {res}    0.0204
{txt}{col 49}Complete DF{col 67}= {res}       149
{txt}{col 49}DF:     min{col 67}= {res}    142.13
{txt}{col 49}        avg{col 67}= {res}    146.49
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}        max{col 67}= {res}    146.99
{txt}{col 49}{help j_robustsingular##|_new:F(  12,      .)}{col 67}=          {res}.
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}=          {res}.

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.804553{col 26}{space 2} .8164754{col 37}{space 1}    3.43{col 46}{space 3}0.001{col 54}{space 4} 1.191002{col 67}{space 3} 4.418104
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.0851462{col 26}{space 2} 1.062453{col 37}{space 1}   -0.08{col 46}{space 3}0.936{col 54}{space 4} -2.18484{col 67}{space 3} 2.014548
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0078514{col 26}{space 2} .0441634{col 37}{space 1}   -0.18{col 46}{space 3}0.859{col 54}{space 4} -.095129{col 67}{space 3} .0794262
{txt}{space 8}Race {c |}{col 14}{res}{space 2} 1.727926{col 26}{space 2} .7500707{col 37}{space 1}    2.30{col 46}{space 3}0.023{col 54}{space 4} .2456086{col 67}{space 3} 3.210244
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 1.215721{col 26}{space 2}  .754926{col 37}{space 1}    1.61{col 46}{space 3}0.109{col 54}{space 4}-.2761897{col 67}{space 3} 2.707632
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0010204{col 26}{space 2} .0005342{col 37}{space 1}   -1.91{col 46}{space 3}0.058{col 54}{space 4}-.0020762{col 67}{space 3} .0000354
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0477581{col 26}{space 2} .0548161{col 37}{space 1}    0.87{col 46}{space 3}0.385{col 54}{space 4}-.0605717{col 67}{space 3} .1560878
{txt}w1Creatinine {c |}{col 14}{res}{space 2} .5110439{col 26}{space 2} 1.588149{col 37}{space 1}    0.32{col 46}{space 3}0.748{col 54}{space 4}-2.628403{col 67}{space 3} 3.650491
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 30.32698{col 26}{space 2} 54.82682{col 37}{space 1}    0.55{col 46}{space 3}0.581{col 54}{space 4}  -78.027{col 67}{space 3}  138.681
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} .0485099{col 26}{space 2} .0944029{col 37}{space 1}    0.51{col 46}{space 3}0.608{col 54}{space 4}-.1380545{col 67}{space 3} .2350744
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0078791{col 26}{space 2} .0151996{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-.0379173{col 67}{space 3} .0221591
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} .0969624{col 26}{space 2} .2695579{col 37}{space 1}    0.36{col 46}{space 3}0.720{col 54}{space 4}-.4357474{col 67}{space 3} .6296722
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.76e-06{col 26}{space 2} 3.21e-06{col 37}{space 1}    0.86{col 46}{space 3}0.392{col 54}{space 4}-3.59e-06{col 67}{space 3} 9.11e-06
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-38.59463{col 26}{space 2} 54.98325{col 37}{space 1}   -0.70{col 46}{space 3}0.484{col 54}{space 4}-147.2579{col 67}{space 3}  70.0686
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. ***********MODEL 5: MODEL2+OXIDATIVE STRESS******
. 
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0776
{txt}{col 49}Largest FMI{col 67}= {res}    0.4804
{txt}{col 49}Complete DF{col 67}= {res}        56
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     12.90
{txt}{col 49}        avg{col 67}= {res}     49.78
{txt}{col 49}        max{col 67}= {res}     54.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   53.3{txt}){col 67}= {res}      4.65
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 36.30603{col 26}{space 2} 99.74988{col 37}{space 1}    0.36{col 46}{space 3}0.717{col 54}{space 4}-163.6875{col 67}{space 3} 236.2996
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 73.55961{col 26}{space 2} 91.77815{col 37}{space 1}    0.80{col 46}{space 3}0.426{col 54}{space 4}-110.4665{col 67}{space 3} 257.5857
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-7.960351{col 26}{space 2} 4.890602{col 37}{space 1}   -1.63{col 46}{space 3}0.110{col 54}{space 4}-17.77264{col 67}{space 3} 1.851938
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-227.3851{col 26}{space 2} 81.00615{col 37}{space 1}   -2.81{col 46}{space 3}0.007{col 54}{space 4}-389.8727{col 67}{space 3}-64.89755
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0478154{col 26}{space 2} .0631374{col 37}{space 1}    0.76{col 46}{space 3}0.452{col 54}{space 4}-.0788249{col 67}{space 3} .1744556
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 1.405133{col 26}{space 2}  5.98963{col 37}{space 1}    0.23{col 46}{space 3}0.815{col 54}{space 4} -10.6056{col 67}{space 3} 13.41586
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} -3.26744{col 26}{space 2} 6.598714{col 37}{space 1}   -0.50{col 46}{space 3}0.629{col 54}{space 4}-17.53409{col 67}{space 3} 10.99921
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 236.8032{col 26}{space 2} 118.5245{col 37}{space 1}    2.00{col 46}{space 3}0.051{col 54}{space 4}-.8174974{col 67}{space 3} 474.4238
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} .9793661{col 26}{space 2} 17.98365{col 37}{space 1}    0.05{col 46}{space 3}0.957{col 54}{space 4}-35.08199{col 67}{space 3} 37.04072
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}  .001196{col 26}{space 2} .0003796{col 37}{space 1}    3.15{col 46}{space 3}0.003{col 54}{space 4} .0004348{col 67}{space 3} .0019571
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1265.636{col 26}{space 2} 775.2004{col 37}{space 1}    1.63{col 46}{space 3}0.108{col 54}{space 4}-288.6195{col 67}{space 3} 2819.891
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0693
{txt}{col 49}Largest FMI{col 67}= {res}    0.4030
{txt}{col 49}Complete DF{col 67}= {res}        56
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     16.48
{txt}{col 49}        avg{col 67}= {res}     49.20
{txt}{col 49}        max{col 67}= {res}     53.68
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   53.4{txt}){col 67}= {res}      5.01
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 37.86082{col 26}{space 2} 99.81636{col 37}{space 1}    0.38{col 46}{space 3}0.706{col 54}{space 4}-162.3827{col 67}{space 3} 238.1043
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}   1.2276{col 26}{space 2}  91.8891{col 37}{space 1}    0.01{col 46}{space 3}0.989{col 54}{space 4}-183.1436{col 67}{space 3} 185.5988
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.790289{col 26}{space 2} 4.920786{col 37}{space 1}   -1.38{col 46}{space 3}0.174{col 54}{space 4}-16.67706{col 67}{space 3} 3.096482
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -238.046{col 26}{space 2}  80.4381{col 37}{space 1}   -2.96{col 46}{space 3}0.005{col 54}{space 4}-399.4132{col 67}{space 3}-76.67876
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0673943{col 26}{space 2} .0628448{col 37}{space 1}    1.07{col 46}{space 3}0.288{col 54}{space 4}-.0586977{col 67}{space 3} .1934864
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-1.792092{col 26}{space 2} 5.999167{col 37}{space 1}   -0.30{col 46}{space 3}0.766{col 54}{space 4}-13.83065{col 67}{space 3} 10.24646
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-6.594437{col 26}{space 2} 6.184456{col 37}{space 1}   -1.07{col 46}{space 3}0.302{col 54}{space 4} -19.6737{col 67}{space 3} 6.484824
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 198.2644{col 26}{space 2}  117.924{col 37}{space 1}    1.68{col 46}{space 3}0.099{col 54}{space 4}-38.19618{col 67}{space 3}  434.725
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-.0752789{col 26}{space 2} 17.85883{col 37}{space 1}   -0.00{col 46}{space 3}0.997{col 54}{space 4}-35.89008{col 67}{space 3} 35.73952
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}   .00154{col 26}{space 2} .0003786{col 37}{space 1}    4.07{col 46}{space 3}0.000{col 54}{space 4} .0007807{col 67}{space 3} .0022993
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1417.157{col 26}{space 2} 769.7638{col 37}{space 1}    1.84{col 46}{space 3}0.071{col 54}{space 4}-126.3383{col 67}{space 3} 2960.653
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0428
{txt}{col 49}Largest FMI{col 67}= {res}    0.3170
{txt}{col 49}Complete DF{col 67}= {res}        56
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     21.88
{txt}{col 49}        avg{col 67}= {res}     50.90
{txt}{col 49}        max{col 67}= {res}     54.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   53.8{txt}){col 67}= {res}      1.61
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1289

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.992127{col 26}{space 2} 1.239615{col 37}{space 1}    2.41{col 46}{space 3}0.019{col 54}{space 4} .5065155{col 67}{space 3} 5.477739
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  .520834{col 26}{space 2} 1.136686{col 37}{space 1}    0.46{col 46}{space 3}0.649{col 54}{space 4}-1.758174{col 67}{space 3} 2.799842
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0284392{col 26}{space 2} .0599904{col 37}{space 1}   -0.47{col 46}{space 3}0.637{col 54}{space 4}-.1487154{col 67}{space 3} .0918369
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} .0314257{col 26}{space 2} 1.000608{col 37}{space 1}    0.03{col 46}{space 3}0.975{col 54}{space 4}-1.975121{col 67}{space 3} 2.037972
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0007856{col 26}{space 2} .0007808{col 37}{space 1}   -1.01{col 46}{space 3}0.319{col 54}{space 4}-.0023515{col 67}{space 3} .0007803
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .1185421{col 26}{space 2} .0739976{col 37}{space 1}    1.60{col 46}{space 3}0.115{col 54}{space 4}-.0298106{col 67}{space 3} .2668948
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} .0366782{col 26}{space 2}  .073305{col 37}{space 1}    0.50{col 46}{space 3}0.622{col 54}{space 4}-.1153952{col 67}{space 3} .1887516
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} -.681179{col 26}{space 2} 1.477045{col 37}{space 1}   -0.46{col 46}{space 3}0.647{col 54}{space 4}-3.643121{col 67}{space 3} 2.280762
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}  .096941{col 26}{space 2} .2223343{col 37}{space 1}    0.44{col 46}{space 3}0.665{col 54}{space 4}-.3488118{col 67}{space 3} .5426938
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 5.55e-06{col 26}{space 2} 4.70e-06{col 37}{space 1}    1.18{col 46}{space 3}0.243{col 54}{space 4}-3.88e-06{col 67}{space 3}  .000015
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -5.87532{col 26}{space 2} 9.606006{col 37}{space 1}   -0.61{col 46}{space 3}0.543{col 54}{space 4}-25.13412{col 67}{space 3} 13.38347
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITE//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0094
{txt}{col 49}Largest FMI{col 67}= {res}    0.0547
{txt}{col 49}Complete DF{col 67}= {res}        85
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     74.81
{txt}{col 49}        avg{col 67}= {res}     81.78
{txt}{col 49}        max{col 67}= {res}     83.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   83.0{txt}){col 67}= {res}      6.90
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-108.5322{col 26}{space 2} 87.59078{col 37}{space 1}   -1.24{col 46}{space 3}0.219{col 54}{space 4}-282.7624{col 67}{space 3} 65.69791
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-74.36698{col 26}{space 2} 95.78041{col 37}{space 1}   -0.78{col 46}{space 3}0.440{col 54}{space 4}-264.8737{col 67}{space 3} 116.1398
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2.121924{col 26}{space 2} 4.760867{col 37}{space 1}   -0.45{col 46}{space 3}0.657{col 54}{space 4}-11.59101{col 67}{space 3} 7.347163
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-99.26752{col 26}{space 2} 81.94869{col 37}{space 1}   -1.21{col 46}{space 3}0.229{col 54}{space 4}-262.2596{col 67}{space 3} 63.72456
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0592094{col 26}{space 2} .0574544{col 37}{space 1}    1.03{col 46}{space 3}0.306{col 54}{space 4}-.0550662{col 67}{space 3}  .173485
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 10.37773{col 26}{space 2} 5.518464{col 37}{space 1}    1.88{col 46}{space 3}0.064{col 54}{space 4}-.5983849{col 67}{space 3} 21.35385
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} 1.423663{col 26}{space 2} 3.529573{col 37}{space 1}    0.40{col 46}{space 3}0.688{col 54}{space 4}-5.607903{col 67}{space 3} 8.455228
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 117.2072{col 26}{space 2} 143.4163{col 37}{space 1}    0.82{col 46}{space 3}0.416{col 54}{space 4} -168.042{col 67}{space 3} 402.4563
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} -8.75352{col 26}{space 2} 17.37749{col 37}{space 1}   -0.50{col 46}{space 3}0.616{col 54}{space 4}-43.34637{col 67}{space 3} 25.83934
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019343{col 26}{space 2} .0003222{col 37}{space 1}    6.00{col 46}{space 3}0.000{col 54}{space 4} .0012934{col 67}{space 3} .0025752
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 597.1638{col 26}{space 2} 849.3409{col 37}{space 1}    0.70{col 46}{space 3}0.484{col 54}{space 4}-1092.141{col 67}{space 3} 2286.468
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0062
{txt}{col 49}Largest FMI{col 67}= {res}    0.0460
{txt}{col 49}Complete DF{col 67}= {res}        85
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     76.55
{txt}{col 49}        avg{col 67}= {res}     82.29
{txt}{col 49}        max{col 67}= {res}     83.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   83.0{txt}){col 67}= {res}      9.27
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-100.5367{col 26}{space 2} 88.29022{col 37}{space 1}   -1.14{col 46}{space 3}0.258{col 54}{space 4}-276.1428{col 67}{space 3} 75.06941
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-204.1276{col 26}{space 2} 96.70638{col 37}{space 1}   -2.11{col 46}{space 3}0.038{col 54}{space 4}-396.4709{col 67}{space 3}-11.78438
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .9263571{col 26}{space 2}  4.81123{col 37}{space 1}    0.19{col 46}{space 3}0.848{col 54}{space 4}-8.642909{col 67}{space 3} 10.49562
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-62.66367{col 26}{space 2} 82.79079{col 37}{space 1}   -0.76{col 46}{space 3}0.451{col 54}{space 4}-227.3293{col 67}{space 3}  102.002
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}  .093876{col 26}{space 2} .0580382{col 37}{space 1}    1.62{col 46}{space 3}0.110{col 54}{space 4}-.0215593{col 67}{space 3} .2093114
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 12.31838{col 26}{space 2} 5.573649{col 37}{space 1}    2.21{col 46}{space 3}0.030{col 54}{space 4} 1.232679{col 67}{space 3} 23.40407
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-.5644763{col 26}{space 2} 3.500397{col 37}{space 1}   -0.16{col 46}{space 3}0.872{col 54}{space 4}-7.528701{col 67}{space 3} 6.399749
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 11.91062{col 26}{space 2} 144.9716{col 37}{space 1}    0.08{col 46}{space 3}0.935{col 54}{space 4}-276.4346{col 67}{space 3} 300.2558
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 6.134827{col 26}{space 2} 17.64951{col 37}{space 1}    0.35{col 46}{space 3}0.729{col 54}{space 4}-29.01312{col 67}{space 3} 41.28278
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0025871{col 26}{space 2} .0003255{col 37}{space 1}    7.95{col 46}{space 3}0.000{col 54}{space 4} .0019396{col 67}{space 3} .0032345
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  325.782{col 26}{space 2}  858.043{col 37}{space 1}    0.38{col 46}{space 3}0.705{col 54}{space 4}-1380.815{col 67}{space 3} 2032.379
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0053
{txt}{col 49}Largest FMI{col 67}= {res}    0.0427
{txt}{col 49}Complete DF{col 67}= {res}        85
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     77.18
{txt}{col 49}        avg{col 67}= {res}     82.40
{txt}{col 49}        max{col 67}= {res}     83.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   83.0{txt}){col 67}= {res}      1.78
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0777

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 3.814196{col 26}{space 2}    1.168{col 37}{space 1}    3.27{col 46}{space 3}0.002{col 54}{space 4} 1.490938{col 67}{space 3} 6.137453
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} -.586569{col 26}{space 2} 1.278231{col 37}{space 1}   -0.46{col 46}{space 3}0.648{col 54}{space 4}-3.128975{col 67}{space 3} 1.955837
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0255853{col 26}{space 2} .0635362{col 37}{space 1}   -0.40{col 46}{space 3}0.688{col 54}{space 4}-.1519557{col 67}{space 3} .1007851
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 2.157509{col 26}{space 2} 1.093518{col 37}{space 1}    1.97{col 46}{space 3}0.052{col 54}{space 4}  -.01745{col 67}{space 3} 4.332468
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0009577{col 26}{space 2} .0007666{col 37}{space 1}   -1.25{col 46}{space 3}0.215{col 54}{space 4}-.0024825{col 67}{space 3}  .000567
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0745778{col 26}{space 2} .0736466{col 37}{space 1}    1.01{col 46}{space 3}0.314{col 54}{space 4}-.0719045{col 67}{space 3} .2210602
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-.0363943{col 26}{space 2} .0468167{col 37}{space 1}   -0.78{col 46}{space 3}0.439{col 54}{space 4}-.1296148{col 67}{space 3} .0568262
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 2.644161{col 26}{space 2} 1.915314{col 37}{space 1}    1.38{col 46}{space 3}0.171{col 54}{space 4}-1.165423{col 67}{space 3} 6.453746
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} .2122303{col 26}{space 2} .2279734{col 37}{space 1}    0.93{col 46}{space 3}0.355{col 54}{space 4}-.2411977{col 67}{space 3} .6656584
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 2.49e-06{col 26}{space 2} 4.30e-06{col 37}{space 1}    0.58{col 46}{space 3}0.565{col 54}{space 4}-6.06e-06{col 67}{space 3}  .000011
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-18.28714{col 26}{space 2}  11.3402{col 37}{space 1}   -1.61{col 46}{space 3}0.111{col 54}{space 4}-40.84278{col 67}{space 3} 4.268492
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. **********INTERACTION by Race***************
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0202
{txt}{col 49}Largest FMI{col 67}= {res}    0.1877
{txt}{col 49}Complete DF{col 67}= {res}       150
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     63.68
{txt}{col 49}        avg{col 67}= {res}    140.58
{txt}{col 49}        max{col 67}= {res}    148.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  147.7{txt}){col 67}= {res}     11.01
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-62.35507{col 28}{space 2} 72.10955{col 39}{space 1}   -0.86{col 48}{space 3}0.389{col 56}{space 4}-204.8638{col 69}{space 3} 80.15368
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-325.1355{col 28}{space 2} 202.6539{col 39}{space 1}   -1.60{col 48}{space 3}0.111{col 56}{space 4}-725.6123{col 69}{space 3} 75.34124
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 122.8714{col 28}{space 2} 101.5897{col 39}{space 1}    1.21{col 48}{space 3}0.228{col 56}{space 4}-77.88195{col 69}{space 3} 323.6247
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-6.264278{col 28}{space 2} 66.76217{col 39}{space 1}   -0.09{col 48}{space 3}0.925{col 56}{space 4}-138.1953{col 69}{space 3} 125.6667
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-6.460062{col 28}{space 2} 3.198093{col 39}{space 1}   -2.02{col 48}{space 3}0.045{col 56}{space 4}-12.77988{col 69}{space 3}-.1402465
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-161.0974{col 28}{space 2} 56.96206{col 39}{space 1}   -2.83{col 48}{space 3}0.005{col 56}{space 4}-273.6617{col 69}{space 3}  -48.533
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0450444{col 28}{space 2} .0414505{col 39}{space 1}    1.09{col 48}{space 3}0.279{col 56}{space 4}-.0368698{col 69}{space 3} .1269587
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 5.853108{col 28}{space 2} 3.906757{col 39}{space 1}    1.50{col 48}{space 3}0.136{col 56}{space 4}-1.867148{col 69}{space 3} 13.57336
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} .0486938{col 28}{space 2} 3.005004{col 39}{space 1}    0.02{col 48}{space 3}0.987{col 56}{space 4}-5.955073{col 69}{space 3} 6.052461
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 172.0237{col 28}{space 2} 93.84433{col 39}{space 1}    1.83{col 48}{space 3}0.069{col 56}{space 4} -13.4247{col 69}{space 3} 357.4722
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-6.582044{col 28}{space 2}  12.5078{col 39}{space 1}   -0.53{col 48}{space 3}0.600{col 56}{space 4}-31.31272{col 69}{space 3} 18.14863
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0016293{col 28}{space 2} .0002413{col 39}{space 1}    6.75{col 48}{space 3}0.000{col 56}{space 4} .0011525{col 69}{space 3} .0021061
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1063.055{col 28}{space 2} 581.5429{col 39}{space 1}    1.83{col 48}{space 3}0.070{col 56}{space 4}-86.15287{col 69}{space 3} 2212.262
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0118
{txt}{col 49}Largest FMI{col 67}= {res}    0.0879
{txt}{col 49}Complete DF{col 67}= {res}       150
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    109.70
{txt}{col 49}        avg{col 67}= {res}    144.02
{txt}{col 49}        max{col 67}= {res}    148.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  147.9{txt}){col 67}= {res}     13.16
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-37.99035{col 28}{space 2} 74.03085{col 39}{space 1}   -0.51{col 48}{space 3}0.609{col 56}{space 4}-184.2859{col 69}{space 3} 108.3052
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-350.8357{col 28}{space 2}  208.673{col 39}{space 1}   -1.68{col 48}{space 3}0.095{col 56}{space 4}-763.2059{col 69}{space 3} 61.53451
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 123.2762{col 28}{space 2}   104.65{col 39}{space 1}    1.18{col 48}{space 3}0.241{col 56}{space 4}-83.52562{col 69}{space 3}  330.078
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-111.7972{col 28}{space 2} 68.77744{col 39}{space 1}   -1.63{col 48}{space 3}0.106{col 56}{space 4}-247.7114{col 69}{space 3} 24.11706
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-5.111729{col 28}{space 2}  3.29733{col 39}{space 1}   -1.55{col 48}{space 3}0.123{col 56}{space 4}-11.62778{col 69}{space 3} 1.404323
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} -149.955{col 28}{space 2} 58.70598{col 39}{space 1}   -2.55{col 48}{space 3}0.012{col 56}{space 4}-265.9671{col 69}{space 3}-33.94287
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}  .073931{col 28}{space 2} .0426363{col 39}{space 1}    1.73{col 48}{space 3}0.085{col 56}{space 4}-.0103244{col 69}{space 3} .1581864
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 5.596536{col 28}{space 2} 4.022713{col 39}{space 1}    1.39{col 48}{space 3}0.166{col 56}{space 4}-2.352839{col 69}{space 3} 13.54591
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2}-2.478355{col 28}{space 2} 2.938736{col 39}{space 1}   -0.84{col 48}{space 3}0.401{col 56}{space 4} -8.30242{col 69}{space 3}  3.34571
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 108.0911{col 28}{space 2} 96.62506{col 39}{space 1}    1.12{col 48}{space 3}0.265{col 56}{space 4}-82.85164{col 69}{space 3} 299.0339
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} 2.005477{col 28}{space 2} 12.91759{col 39}{space 1}    0.16{col 48}{space 3}0.877{col 56}{space 4}-23.53952{col 69}{space 3} 27.55048
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021505{col 28}{space 2} .0002485{col 39}{space 1}    8.65{col 48}{space 3}0.000{col 56}{space 4} .0016594{col 69}{space 3} .0026416
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 946.4097{col 28}{space 2} 598.6911{col 39}{space 1}    1.58{col 48}{space 3}0.116{col 56}{space 4}-236.6775{col 69}{space 3} 2129.497
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0124
{txt}{col 49}Largest FMI{col 67}= {res}    0.1360
{txt}{col 49}Complete DF{col 67}= {res}       150
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     84.74
{txt}{col 49}        avg{col 67}= {res}    142.95
{txt}{col 49}        max{col 67}= {res}    148.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  147.9{txt}){col 67}= {res}      2.22
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0133

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 3.221716{col 28}{space 2} .9407389{col 39}{space 1}    3.42{col 48}{space 3}0.001{col 56}{space 4} 1.362535{col 69}{space 3} 5.080898
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 2.331373{col 28}{space 2} 2.640797{col 39}{space 1}    0.88{col 48}{space 3}0.379{col 56}{space 4}-2.887189{col 69}{space 3} 7.549935
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.2881495{col 28}{space 2} 1.325061{col 39}{space 1}   -0.22{col 48}{space 3}0.828{col 56}{space 4}-2.906635{col 69}{space 3} 2.330336
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .1149757{col 28}{space 2}  .870463{col 39}{space 1}    0.13{col 48}{space 3}0.895{col 56}{space 4}-1.605168{col 69}{space 3}  1.83512
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-.0046348{col 28}{space 2}  .041714{col 39}{space 1}   -0.11{col 48}{space 3}0.912{col 56}{space 4}-.0870668{col 69}{space 3} .0777971
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} 1.252518{col 28}{space 2} .7427596{col 39}{space 1}    1.69{col 48}{space 3}0.094{col 56}{space 4}-.2152665{col 69}{space 3} 2.720303
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0009393{col 28}{space 2} .0005403{col 39}{space 1}   -1.74{col 48}{space 3}0.084{col 56}{space 4}-.0020071{col 69}{space 3} .0001285
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0906974{col 28}{space 2} .0509455{col 39}{space 1}    1.78{col 48}{space 3}0.077{col 56}{space 4}-.0099773{col 69}{space 3} .1913722
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} -.010538{col 28}{space 2} .0381417{col 39}{space 1}   -0.28{col 48}{space 3}0.783{col 56}{space 4}-.0863774{col 69}{space 3} .0653014
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 1.060189{col 28}{space 2} 1.224067{col 39}{space 1}    0.87{col 48}{space 3}0.388{col 56}{space 4}-1.358731{col 69}{space 3}  3.47911
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} .2201863{col 28}{space 2} .1605874{col 39}{space 1}    1.37{col 48}{space 3}0.172{col 56}{space 4} -.097154{col 69}{space 3} .5375265
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.66e-06{col 28}{space 2} 3.15e-06{col 39}{space 1}    0.85{col 48}{space 3}0.398{col 56}{space 4}-3.55e-06{col 69}{space 3} 8.88e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-12.50045{col 28}{space 2}  7.58252{col 39}{space 1}   -1.65{col 48}{space 3}0.101{col 56}{space 4}-27.48448{col 69}{space 3} 2.483575
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***********MODEL 6: MODEL 2+lifestyle/health-related factors*******  
. 
. 
. 
. //AFRICAN-AMERICAN//
. 
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0154
{txt}{col 49}Largest FMI{col 67}= {res}    0.0361
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     52.48
{txt}{col 49}        avg{col 67}= {res}     54.33
{txt}{col 49}        max{col 67}= {res}     55.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   55.0{txt}){col 67}= {res}      6.28
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 74.99735{col 26}{space 2} 96.61668{col 37}{space 1}    0.78{col 46}{space 3}0.441{col 54}{space 4}-118.6824{col 67}{space 3} 268.6771
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 117.3653{col 26}{space 2} 86.94483{col 37}{space 1}    1.35{col 46}{space 3}0.183{col 54}{space 4}-56.87213{col 67}{space 3} 291.6028
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-10.70044{col 26}{space 2} 4.682835{col 37}{space 1}   -2.29{col 46}{space 3}0.026{col 54}{space 4}-20.08768{col 67}{space 3}-1.313202
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-252.5875{col 26}{space 2} 77.84717{col 37}{space 1}   -3.24{col 46}{space 3}0.002{col 54}{space 4}-408.6284{col 67}{space 3} -96.5467
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0517961{col 26}{space 2} .0589245{col 37}{space 1}    0.88{col 46}{space 3}0.383{col 54}{space 4}-.0663421{col 67}{space 3} .1699342
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0956579{col 26}{space 2} 5.598126{col 37}{space 1}    0.02{col 46}{space 3}0.986{col 54}{space 4}-11.12491{col 67}{space 3} 11.31623
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-172.2387{col 26}{space 2} 70.84428{col 37}{space 1}   -2.43{col 46}{space 3}0.018{col 54}{space 4}-314.3673{col 67}{space 3} -30.1102
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-77.79206{col 26}{space 2} 40.90639{col 37}{space 1}   -1.90{col 46}{space 3}0.063{col 54}{space 4}-159.7873{col 67}{space 3} 4.203213
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0013883{col 26}{space 2} .0003732{col 37}{space 1}    3.72{col 46}{space 3}0.000{col 54}{space 4} .0006404{col 67}{space 3} .0021363
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2269.196{col 26}{space 2} 494.5586{col 37}{space 1}    4.59{col 46}{space 3}0.000{col 54}{space 4} 1278.075{col 67}{space 3} 3260.317
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0129
{txt}{col 49}Largest FMI{col 67}= {res}    0.0291
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     53.12
{txt}{col 49}        avg{col 67}= {res}     54.50
{txt}{col 49}        max{col 67}= {res}     55.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   55.0{txt}){col 67}= {res}      6.17
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 63.79713{col 26}{space 2} 97.63284{col 37}{space 1}    0.65{col 46}{space 3}0.516{col 54}{space 4}-131.9002{col 67}{space 3} 259.4944
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 41.01308{col 26}{space 2} 88.01055{col 37}{space 1}    0.47{col 46}{space 3}0.643{col 54}{space 4}-135.3602{col 67}{space 3} 217.3864
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-9.621027{col 26}{space 2} 4.732012{col 37}{space 1}   -2.03{col 46}{space 3}0.047{col 54}{space 4}-19.10589{col 67}{space 3}-.1361618
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-253.3766{col 26}{space 2}  78.7006{col 37}{space 1}   -3.22{col 46}{space 3}0.002{col 54}{space 4}-411.1169{col 67}{space 3}-95.63629
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0823097{col 26}{space 2}   .05962{col 37}{space 1}    1.38{col 46}{space 3}0.173{col 54}{space 4}-.0372196{col 67}{space 3} .2018389
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-2.788634{col 26}{space 2} 5.661509{col 37}{space 1}   -0.49{col 46}{space 3}0.624{col 54}{space 4}-14.13569{col 67}{space 3} 8.558424
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-156.7845{col 26}{space 2} 71.46944{col 37}{space 1}   -2.19{col 46}{space 3}0.033{col 54}{space 4}-300.1267{col 67}{space 3}-13.44229
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-56.86568{col 26}{space 2} 41.39254{col 37}{space 1}   -1.37{col 46}{space 3}0.175{col 54}{space 4}-139.8338{col 67}{space 3} 26.10242
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0016718{col 26}{space 2} .0003773{col 37}{space 1}    4.43{col 46}{space 3}0.000{col 54}{space 4} .0009156{col 67}{space 3} .0024279
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2214.483{col 26}{space 2} 500.5032{col 37}{space 1}    4.42{col 46}{space 3}0.000{col 54}{space 4} 1211.459{col 67}{space 3} 3217.507
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0027
{txt}{col 49}Largest FMI{col 67}= {res}    0.0183
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     53.99
{txt}{col 49}        avg{col 67}= {res}     54.96
{txt}{col 49}        max{col 67}= {res}     55.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   55.1{txt}){col 67}= {res}      2.27
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0301

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 2.803407{col 26}{space 2} 1.198671{col 37}{space 1}    2.34{col 46}{space 3}0.023{col 54}{space 4} .4012838{col 67}{space 3}  5.20553
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .6486831{col 26}{space 2} 1.084853{col 37}{space 1}    0.60{col 46}{space 3}0.552{col 54}{space 4}-1.525332{col 67}{space 3} 2.822698
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0073106{col 26}{space 2} .0580973{col 37}{space 1}   -0.13{col 46}{space 3}0.900{col 54}{space 4}-.1237361{col 67}{space 3} .1091148
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.0794055{col 26}{space 2} .9670824{col 37}{space 1}   -0.08{col 46}{space 3}0.935{col 54}{space 4}-2.017407{col 67}{space 3} 1.858596
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0008906{col 26}{space 2} .0007302{col 37}{space 1}   -1.22{col 46}{space 3}0.228{col 54}{space 4}-.0023539{col 67}{space 3} .0005728
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .1337017{col 26}{space 2} .0696158{col 37}{space 1}    1.92{col 46}{space 3}0.060{col 54}{space 4}-.0058066{col 67}{space 3}   .27321
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} .4859082{col 26}{space 2} .8766218{col 37}{space 1}    0.55{col 46}{space 3}0.582{col 54}{space 4}-1.271617{col 67}{space 3} 2.243434
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} -.899396{col 26}{space 2} .5084854{col 37}{space 1}   -1.77{col 46}{space 3}0.082{col 54}{space 4}-1.918418{col 67}{space 3} .1196256
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 6.80e-06{col 26}{space 2} 4.64e-06{col 37}{space 1}    1.47{col 46}{space 3}0.148{col 54}{space 4}-2.49e-06{col 67}{space 3} .0000161
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-8.690457{col 26}{space 2} 6.167022{col 37}{space 1}   -1.41{col 46}{space 3}0.164{col 54}{space 4}-21.04896{col 67}{space 3} 3.668048
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0090
{txt}{col 49}Largest FMI{col 67}= {res}    0.0583
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     74.89
{txt}{col 49}        avg{col 67}= {res}     82.80
{txt}{col 49}        max{col 67}= {res}     83.94
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.0{txt}){col 67}= {res}      7.69
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-115.4004{col 26}{space 2} 86.40246{col 37}{space 1}   -1.34{col 46}{space 3}0.185{col 54}{space 4}-287.2375{col 67}{space 3} 56.43669
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-54.40018{col 26}{space 2} 94.33568{col 37}{space 1}   -0.58{col 46}{space 3}0.566{col 54}{space 4}-242.0006{col 67}{space 3} 133.2002
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.537082{col 26}{space 2} 4.860597{col 37}{space 1}   -0.32{col 46}{space 3}0.753{col 54}{space 4}-11.20379{col 67}{space 3} 8.129627
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-88.72919{col 26}{space 2} 84.78126{col 37}{space 1}   -1.05{col 46}{space 3}0.298{col 54}{space 4}-257.3392{col 67}{space 3} 79.88081
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0444088{col 26}{space 2} .0577504{col 37}{space 1}    0.77{col 46}{space 3}0.444{col 54}{space 4}-.0704531{col 67}{space 3} .1592707
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 9.583449{col 26}{space 2} 5.289914{col 37}{space 1}    1.81{col 46}{space 3}0.074{col 54}{space 4}-.9363131{col 67}{space 3} 20.10321
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 80.49263{col 26}{space 2} 101.2528{col 37}{space 1}    0.79{col 46}{space 3}0.429{col 54}{space 4}-121.2182{col 67}{space 3} 282.2035
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-17.10642{col 26}{space 2} 46.38265{col 37}{space 1}   -0.37{col 46}{space 3}0.713{col 54}{space 4}-109.3443{col 67}{space 3} 75.13148
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019595{col 26}{space 2} .0003208{col 37}{space 1}    6.11{col 46}{space 3}0.000{col 54}{space 4} .0013215{col 67}{space 3} .0025974
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1108.072{col 26}{space 2} 509.7383{col 37}{space 1}    2.17{col 46}{space 3}0.033{col 54}{space 4} 94.38015{col 67}{space 3} 2121.765
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0119
{txt}{col 49}Largest FMI{col 67}= {res}    0.0976
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     65.84
{txt}{col 49}        avg{col 67}= {res}     82.00
{txt}{col 49}        max{col 67}= {res}     84.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.0{txt}){col 67}= {res}     10.65
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2}-134.4057{col 26}{space 2} 86.39015{col 37}{space 1}   -1.56{col 46}{space 3}0.124{col 54}{space 4}-306.2074{col 67}{space 3} 37.39592
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-198.8199{col 26}{space 2}  94.4826{col 37}{space 1}   -2.10{col 46}{space 3}0.038{col 54}{space 4}-386.7117{col 67}{space 3}-10.92807
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 2.188169{col 26}{space 2}  4.86609{col 37}{space 1}    0.45{col 46}{space 3}0.654{col 54}{space 4}-7.489268{col 67}{space 3} 11.86561
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-79.14296{col 26}{space 2} 84.88374{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4}-247.9539{col 67}{space 3} 89.66799
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .1086779{col 26}{space 2} .0576904{col 37}{space 1}    1.88{col 46}{space 3}0.063{col 54}{space 4}-.0060528{col 67}{space 3} .2234086
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 11.93797{col 26}{space 2} 5.301699{col 37}{space 1}    2.25{col 46}{space 3}0.027{col 54}{space 4} 1.394581{col 67}{space 3} 22.48135
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 33.50753{col 26}{space 2} 103.4266{col 37}{space 1}    0.32{col 46}{space 3}0.747{col 54}{space 4}-172.9997{col 67}{space 3} 240.0147
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-51.67947{col 26}{space 2}   46.449{col 37}{space 1}   -1.11{col 46}{space 3}0.269{col 54}{space 4}-144.0486{col 67}{space 3} 40.68967
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0026075{col 26}{space 2} .0003212{col 37}{space 1}    8.12{col 46}{space 3}0.000{col 54}{space 4} .0019689{col 67}{space 3} .0032462
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 467.9493{col 26}{space 2} 510.9674{col 37}{space 1}    0.92{col 46}{space 3}0.362{col 54}{space 4}-548.2114{col 67}{space 3}  1484.11
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw1 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0045
{txt}{col 49}Largest FMI{col 67}= {res}    0.0230
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     81.44
{txt}{col 49}        avg{col 67}= {res}     83.68
{txt}{col 49}        max{col 67}= {res}     84.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.0{txt}){col 67}= {res}      1.62
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1218

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw1 {c |}{col 14}{res}{space 2} 3.335409{col 26}{space 2} 1.167774{col 37}{space 1}    2.86{col 46}{space 3}0.005{col 54}{space 4} 1.013078{col 67}{space 3} 5.657739
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.2195479{col 26}{space 2} 1.277798{col 37}{space 1}   -0.17{col 46}{space 3}0.864{col 54}{space 4}-2.760683{col 67}{space 3} 2.321587
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-.0296904{col 26}{space 2}  .065612{col 37}{space 1}   -0.45{col 46}{space 3}0.652{col 54}{space 4}-.1601663{col 67}{space 3} .1007854
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 2.123013{col 26}{space 2} 1.144798{col 37}{space 1}    1.85{col 46}{space 3}0.067{col 54}{space 4}-.1535272{col 67}{space 3} 4.399553
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0009993{col 26}{space 2} .0007796{col 37}{space 1}   -1.28{col 46}{space 3}0.203{col 54}{space 4}-.0025496{col 67}{space 3}  .000551
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0333278{col 26}{space 2} .0715569{col 37}{space 1}    0.47{col 46}{space 3}0.643{col 54}{space 4}  -.10897{col 67}{space 3} .1756256
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-1.133341{col 26}{space 2} 1.346983{col 37}{space 1}   -0.84{col 46}{space 3}0.403{col 54}{space 4}-3.813194{col 67}{space 3} 1.546512
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2} .0790458{col 26}{space 2} .6276754{col 37}{space 1}    0.13{col 46}{space 3}0.900{col 54}{space 4}-1.169153{col 67}{space 3} 1.327244
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 1.86e-06{col 26}{space 2} 4.34e-06{col 37}{space 1}    0.43{col 46}{space 3}0.669{col 54}{space 4}-6.77e-06{col 67}{space 3} .0000105
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -4.24625{col 26}{space 2} 6.895574{col 37}{space 1}   -0.62{col 46}{space 3}0.540{col 54}{space 4}-17.95883{col 67}{space 3} 9.466329
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. ******************INTERACTION by Race***********************
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0042
{txt}{col 49}Largest FMI{col 67}= {res}    0.0381
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    136.90
{txt}{col 49}        avg{col 67}= {res}    147.90
{txt}{col 49}        max{col 67}= {res}    149.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}     12.00
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-82.25534{col 28}{space 2} 71.14354{col 39}{space 1}   -1.16{col 48}{space 3}0.249{col 56}{space 4}-222.8372{col 69}{space 3} 58.32651
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-359.4647{col 28}{space 2}  201.329{col 39}{space 1}   -1.79{col 48}{space 3}0.076{col 56}{space 4} -757.295{col 69}{space 3} 38.36553
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 141.7461{col 28}{space 2} 102.0495{col 39}{space 1}    1.39{col 48}{space 3}0.167{col 56}{space 4}-59.90721{col 69}{space 3} 343.3994
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 5.597262{col 28}{space 2} 65.43952{col 39}{space 1}    0.09{col 48}{space 3}0.932{col 56}{space 4}-123.7124{col 69}{space 3} 134.9069
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-6.577967{col 28}{space 2} 3.264759{col 39}{space 1}   -2.01{col 48}{space 3}0.046{col 56}{space 4} -13.0292{col 69}{space 3}-.1267302
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-172.0476{col 28}{space 2} 58.11169{col 39}{space 1}   -2.96{col 48}{space 3}0.004{col 56}{space 4} -286.877{col 69}{space 3}-57.21816
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0405102{col 28}{space 2} .0410123{col 39}{space 1}    0.99{col 48}{space 3}0.325{col 56}{space 4}-.0405314{col 69}{space 3} .1215517
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 3.695695{col 28}{space 2} 3.758626{col 39}{space 1}    0.98{col 48}{space 3}0.327{col 56}{space 4}-3.731465{col 69}{space 3} 11.12286
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-45.65031{col 28}{space 2} 61.18473{col 39}{space 1}   -0.75{col 48}{space 3}0.457{col 56}{space 4}-166.6397{col 69}{space 3} 75.33907
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-40.46064{col 28}{space 2} 31.35595{col 39}{space 1}   -1.29{col 48}{space 3}0.199{col 56}{space 4}-102.4208{col 69}{space 3} 21.49952
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0016749{col 28}{space 2} .0002424{col 39}{space 1}    6.91{col 48}{space 3}0.000{col 56}{space 4} .0011959{col 69}{space 3}  .002154
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1946.292{col 28}{space 2} 354.2498{col 39}{space 1}    5.49{col 48}{space 3}0.000{col 56}{space 4} 1246.283{col 69}{space 3} 2646.301
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0066
{txt}{col 49}Largest FMI{col 67}= {res}    0.0562
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    127.83
{txt}{col 49}        avg{col 67}= {res}    147.05
{txt}{col 49}        max{col 67}= {res}    149.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}     14.89
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2}-75.44621{col 28}{space 2} 72.47385{col 39}{space 1}   -1.04{col 48}{space 3}0.300{col 56}{space 4}-218.6582{col 69}{space 3} 67.76579
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-372.2716{col 28}{space 2} 205.0339{col 39}{space 1}   -1.82{col 48}{space 3}0.071{col 56}{space 4}-777.4246{col 69}{space 3} 32.88148
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 146.9995{col 28}{space 2} 103.9445{col 39}{space 1}    1.41{col 48}{space 3}0.159{col 56}{space 4}-58.39999{col 69}{space 3}  352.399
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-99.16925{col 28}{space 2}  66.6538{col 39}{space 1}   -1.49{col 48}{space 3}0.139{col 56}{space 4}-230.8793{col 69}{space 3} 32.54077
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-5.045128{col 28}{space 2} 3.324031{col 39}{space 1}   -1.52{col 48}{space 3}0.131{col 56}{space 4}-11.61349{col 69}{space 3} 1.523231
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-167.4265{col 28}{space 2} 59.16716{col 39}{space 1}   -2.83{col 48}{space 3}0.005{col 56}{space 4}-284.3415{col 69}{space 3}-50.51147
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0837749{col 28}{space 2} .0417908{col 39}{space 1}    2.00{col 48}{space 3}0.047{col 56}{space 4} .0011938{col 69}{space 3}  .166356
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}  3.99171{col 28}{space 2}  3.82714{col 39}{space 1}    1.04{col 48}{space 3}0.299{col 56}{space 4}-3.570846{col 69}{space 3} 11.55427
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-63.01321{col 28}{space 2} 62.86108{col 39}{space 1}   -1.00{col 48}{space 3}0.318{col 56}{space 4}-187.3962{col 69}{space 3} 61.36974
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-53.86712{col 28}{space 2}  31.9441{col 39}{space 1}   -1.69{col 48}{space 3}0.094{col 56}{space 4}-116.9902{col 69}{space 3} 9.255918
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021915{col 28}{space 2} .0002469{col 39}{space 1}    8.88{col 48}{space 3}0.000{col 56}{space 4} .0017037{col 69}{space 3} .0026793
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1537.761{col 28}{space 2} 360.7162{col 39}{space 1}    4.26{col 48}{space 3}0.000{col 56}{space 4} 824.9731{col 69}{space 3} 2250.549
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw1##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0008
{txt}{col 49}Largest FMI{col 67}= {res}    0.0091
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    147.31
{txt}{col 49}        avg{col 67}= {res}    148.88
{txt}{col 49}        max{col 67}= {res}    149.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}      2.23
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0155

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw1 {c |}{col 16}{res}{space 2} 2.825975{col 28}{space 2} .9293135{col 39}{space 1}    3.04{col 48}{space 3}0.003{col 56}{space 4} .9896423{col 69}{space 3} 4.662308
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 1.940699{col 28}{space 2} 2.630575{col 39}{space 1}    0.74{col 48}{space 3}0.462{col 56}{space 4} -3.25734{col 69}{space 3} 7.138739
{txt}{space 14} {c |}
Race#c.LnNFLw1 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-.1675759{col 28}{space 2} 1.332908{col 39}{space 1}   -0.13{col 48}{space 3}0.900{col 56}{space 4}-2.801415{col 69}{space 3} 2.466264
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .4122861{col 28}{space 2}  .855106{col 39}{space 1}    0.48{col 48}{space 3}0.630{col 56}{space 4}-1.277411{col 69}{space 3} 2.101983
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0013345{col 28}{space 2} .0426629{col 39}{space 1}    0.03{col 48}{space 3}0.975{col 56}{space 4}-.0829681{col 69}{space 3}  .085637
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} 1.179436{col 28}{space 2} .7595684{col 39}{space 1}    1.55{col 48}{space 3}0.123{col 56}{space 4}-.3214807{col 69}{space 3} 2.680353
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0009403{col 28}{space 2} .0005358{col 39}{space 1}   -1.75{col 48}{space 3}0.081{col 56}{space 4} -.001999{col 69}{space 3} .0001184
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0714095{col 28}{space 2}    .0491{col 39}{space 1}    1.45{col 48}{space 3}0.148{col 56}{space 4}-.0256126{col 69}{space 3} .1684317
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2} .0353268{col 28}{space 2} .7883472{col 39}{space 1}    0.04{col 48}{space 3}0.964{col 56}{space 4}-1.522604{col 69}{space 3} 1.593258
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-.3002708{col 28}{space 2} .4096453{col 39}{space 1}   -0.73{col 48}{space 3}0.465{col 56}{space 4}-1.109734{col 69}{space 3} .5091921
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.56e-06{col 28}{space 2} 3.17e-06{col 39}{space 1}    0.81{col 48}{space 3}0.421{col 56}{space 4}-3.70e-06{col 69}{space 3} 8.82e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-5.926825{col 28}{space 2} 4.627419{col 39}{space 1}   -1.28{col 48}{space 3}0.202{col 56}{space 4}-15.07066{col 69}{space 3} 3.217007
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. ////////////////////////////////////////TABLE S5. LnNFLw3 exposure/////////////////////////////////////////////
> 
. 
. 
. 
. ***********************LnNFLw3, MODELS 1 AND 2*********************
. 
. 
. *********************AFRICAN-AMERICAN*******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. //ANALYSIS B//
. reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final2==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        67
{txt}{hline 13}{c +}{hline 34}   F(6, 60)        = {res}     7.36
{txt}       Model {c |} {res} 2850651.04         6  475108.507   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3871145.65        60  64519.0942   {txt}R-squared       ={res}    0.4241
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3665
{txt}       Total {c |} {res} 6721796.69        66  101845.404   {txt}Root MSE        =   {res} 254.01

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 1.528393{col 26}{space 2} 75.12293{col 37}{space 1}    0.02{col 46}{space 3}0.984{col 67}{space 3} .0023537
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 100.3292{col 26}{space 2} 89.33881{col 37}{space 1}    1.12{col 46}{space 3}0.266{col 67}{space 3} .1562279
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} -8.48243{col 26}{space 2} 3.984451{col 37}{space 1}   -2.13{col 46}{space 3}0.037{col 67}{space 3}-.2624228
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-220.1136{col 26}{space 2} 79.86311{col 37}{space 1}   -2.76{col 46}{space 3}0.008{col 67}{space 3}-.3360945
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0339187{col 26}{space 2} .0604872{col 37}{space 1}    0.56{col 46}{space 3}0.577{col 67}{space 3} .0634769
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0011359{col 26}{space 2} .0003717{col 37}{space 1}    3.06{col 46}{space 3}0.003{col 67}{space 3}  .425254
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2425.804{col 26}{space 2} 478.5251{col 37}{space 1}    5.07{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final2==1 & Race==2,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        67
{txt}{hline 13}{c +}{hline 34}   F(6, 60)        = {res}     7.76
{txt}       Model {c |} {res} 2981580.83         6  496930.138   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3842606.44        60  64043.4407   {txt}R-squared       ={res}    0.4369
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.3806
{txt}       Total {c |} {res} 6824187.27        66  103396.777   {txt}Root MSE        =   {res} 253.07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-2.412905{col 26}{space 2} 74.84551{col 37}{space 1}   -0.03{col 46}{space 3}0.974{col 67}{space 3}-.0036879
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 37.91454{col 26}{space 2} 89.00888{col 37}{space 1}    0.43{col 46}{space 3}0.672{col 67}{space 3} .0585941
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-8.065539{col 26}{space 2} 3.969736{col 37}{space 1}   -2.03{col 46}{space 3}0.047{col 67}{space 3}-.2476463
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-228.8497{col 26}{space 2} 79.56818{col 37}{space 1}   -2.88{col 46}{space 3}0.006{col 67}{space 3}-.3468025
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0664729{col 26}{space 2} .0602638{col 37}{space 1}    1.10{col 46}{space 3}0.274{col 67}{space 3} .1234636
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0014325{col 26}{space 2} .0003703{col 37}{space 1}    3.87{col 46}{space 3}0.000{col 67}{space 3} .5322439
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2324.002{col 26}{space 2}  476.758{col 37}{space 1}    4.87{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final2==1 & Race==2,beta 
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        67
{txt}{hline 13}{c +}{hline 34}   F(6, 60)        = {res}     1.86
{txt}       Model {c |} {res} 111.125287         6  18.5208812   {txt}Prob > F        ={res}    0.1028
{txt}    Residual {c |} {res} 597.675613        60  9.96126022   {txt}R-squared       ={res}    0.1568
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0725
{txt}       Total {c |} {res}   708.8009        66  10.7394076   {txt}Root MSE        =   {res} 3.1561

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 1.224016{col 26}{space 2} .9334382{col 37}{space 1}    1.31{col 46}{space 3}0.195{col 67}{space 3} .1835627
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .3559267{col 26}{space 2} 1.110077{col 37}{space 1}    0.32{col 46}{space 3}0.750{col 67}{space 3} .0539725
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0497567{col 26}{space 2} .0495087{col 37}{space 1}    1.01{col 46}{space 3}0.319{col 67}{space 3}  .149904
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} .0840337{col 26}{space 2} .9923371{col 37}{space 1}    0.08{col 46}{space 3}0.933{col 67}{space 3} .0124954
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -.001062{col 26}{space 2} .0007516{col 37}{space 1}   -1.41{col 46}{space 3}0.163{col 67}{space 3}-.1935391
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 4.67e-06{col 26}{space 2} 4.62e-06{col 37}{space 1}    1.01{col 46}{space 3}0.317{col 67}{space 3} .1700727
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.221315{col 26}{space 2} 5.945902{col 37}{space 1}   -0.54{col 46}{space 3}0.590{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        59
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     57.10
{txt}{col 49}        avg{col 67}= {res}     57.10
{txt}{col 49}        max{col 67}= {res}     57.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   57.1{txt}){col 67}= {res}      6.23
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-5.254991{col 26}{space 2} 78.85848{col 37}{space 1}   -0.07{col 46}{space 3}0.947{col 54}{space 4}-163.1606{col 67}{space 3} 152.6506
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 95.43171{col 26}{space 2} 91.42489{col 37}{space 1}    1.04{col 46}{space 3}0.301{col 54}{space 4}-87.63674{col 67}{space 3} 278.5002
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-7.992473{col 26}{space 2} 4.320735{col 37}{space 1}   -1.85{col 46}{space 3}0.070{col 54}{space 4}-16.64428{col 67}{space 3} .6593322
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-217.5332{col 26}{space 2} 80.91108{col 37}{space 1}   -2.69{col 46}{space 3}0.009{col 54}{space 4}-379.5489{col 67}{space 3}-55.51746
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0338874{col 26}{space 2} .0609491{col 37}{space 1}    0.56{col 46}{space 3}0.580{col 54}{space 4}-.0881566{col 67}{space 3} .1559315
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-1.613874{col 26}{space 2} 5.259483{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-12.14542{col 67}{space 3} 8.917673
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}  .001152{col 26}{space 2} .0003782{col 37}{space 1}    3.05{col 46}{space 3}0.004{col 54}{space 4} .0003947{col 67}{space 3} .0019093
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2447.452{col 26}{space 2} 487.3123{col 37}{space 1}    5.02{col 46}{space 3}0.000{col 54}{space 4} 1471.661{col 67}{space 3} 3423.242
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        59
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     57.10
{txt}{col 49}        avg{col 67}= {res}     57.10
{txt}{col 49}        max{col 67}= {res}     57.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   57.1{txt}){col 67}= {res}      6.71
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-20.24968{col 26}{space 2} 78.19237{col 37}{space 1}   -0.26{col 46}{space 3}0.797{col 54}{space 4}-176.8215{col 67}{space 3} 136.3221
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  25.0366{col 26}{space 2} 90.65263{col 37}{space 1}    0.28{col 46}{space 3}0.783{col 54}{space 4}-156.4855{col 67}{space 3} 206.5587
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.777205{col 26}{space 2} 4.284239{col 37}{space 1}   -1.58{col 46}{space 3}0.119{col 54}{space 4}-15.35593{col 67}{space 3} 1.801519
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-222.0645{col 26}{space 2} 80.22764{col 37}{space 1}   -2.77{col 46}{space 3}0.008{col 54}{space 4}-382.7117{col 67}{space 3}-61.41735
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0663908{col 26}{space 2} .0604343{col 37}{space 1}    1.10{col 46}{space 3}0.277{col 54}{space 4}-.0546224{col 67}{space 3}  .187404
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-4.243651{col 26}{space 2} 5.215057{col 37}{space 1}   -0.81{col 46}{space 3}0.419{col 54}{space 4}-14.68624{col 67}{space 3} 6.198937
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0014748{col 26}{space 2}  .000375{col 37}{space 1}    3.93{col 46}{space 3}0.000{col 54}{space 4} .0007239{col 67}{space 3} .0022257
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2380.923{col 26}{space 2} 483.1961{col 37}{space 1}    4.93{col 46}{space 3}0.000{col 54}{space 4} 1413.376{col 67}{space 3} 3348.471
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final2==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        59
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     57.10
{txt}{col 49}        avg{col 67}= {res}     57.10
{txt}{col 49}        max{col 67}= {res}     57.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   57.1{txt}){col 67}= {res}      1.69
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1292

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 1.458819{col 26}{space 2}  .974554{col 37}{space 1}    1.50{col 46}{space 3}0.140{col 54}{space 4}-.4926203{col 67}{space 3} 3.410258
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .5254511{col 26}{space 2} 1.129853{col 37}{space 1}    0.47{col 46}{space 3}0.644{col 54}{space 4}-1.736957{col 67}{space 3}  2.78786
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0327971{col 26}{space 2} .0533968{col 37}{space 1}    0.61{col 46}{space 3}0.542{col 54}{space 4}-.0741242{col 67}{space 3} .1397184
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.0052864{col 26}{space 2} .9999206{col 37}{space 1}   -0.01{col 46}{space 3}0.996{col 54}{space 4}-2.007519{col 67}{space 3} 1.996947
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0010609{col 26}{space 2} .0007532{col 37}{space 1}   -1.41{col 46}{space 3}0.164{col 54}{space 4}-.0025691{col 67}{space 3} .0004474
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0558632{col 26}{space 2} .0649981{col 37}{space 1}    0.86{col 46}{space 3}0.394{col 54}{space 4}-.0742885{col 67}{space 3} .1860148
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 4.11e-06{col 26}{space 2} 4.67e-06{col 37}{space 1}    0.88{col 46}{space 3}0.383{col 54}{space 4}-5.25e-06{col 67}{space 3} .0000135
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.970627{col 26}{space 2} 6.022335{col 37}{space 1}   -0.66{col 46}{space 3}0.512{col 54}{space 4} -16.0297{col 67}{space 3} 8.088448
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. *********************WHITE******************************************************
. 
. **Model 1**
. 
. use HANDLS_paper51_NFLBRAINSCANFINALIZED,clear
{txt}
{com}. 
. //ANALYSIS B//
. reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final2==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        96
{txt}{hline 13}{c +}{hline 34}   F(6, 89)        = {res}    12.07
{txt}       Model {c |} {res} 7090034.51         6  1181672.42   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 8713181.38        89  97900.9144   {txt}R-squared       ={res}    0.4486
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4115
{txt}       Total {c |} {res} 15803215.9        95  166349.641   {txt}Root MSE        =   {res} 312.89

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} -170.359{col 26}{space 2} 70.50397{col 37}{space 1}   -2.42{col 46}{space 3}0.018{col 67}{space 3}-.2182497
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-81.78409{col 26}{space 2} 90.41972{col 37}{space 1}   -0.90{col 46}{space 3}0.368{col 67}{space 3}-.0997089
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-2.080153{col 26}{space 2} 4.237946{col 37}{space 1}   -0.49{col 46}{space 3}0.625{col 67}{space 3}-.0443239
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2}-87.03177{col 26}{space 2} 79.47628{col 37}{space 1}   -1.10{col 46}{space 3}0.276{col 67}{space 3}-.0928841
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0356349{col 26}{space 2} .0531762{col 37}{space 1}    0.67{col 46}{space 3}0.505{col 67}{space 3} .0559671
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019737{col 26}{space 2} .0003123{col 37}{space 1}    6.32{col 46}{space 3}0.000{col 67}{space 3} .7063658
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1574.553{col 26}{space 2} 438.4112{col 37}{space 1}    3.59{col 46}{space 3}0.001{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final2==1 & Race==1,beta
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        96
{txt}{hline 13}{c +}{hline 34}   F(6, 89)        = {res}    15.25
{txt}       Model {c |} {res} 9436896.24         6  1572816.04   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 9177973.31        89  103123.296   {txt}R-squared       ={res}    0.5070
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.4737
{txt}       Total {c |} {res} 18614869.6        95  195945.995   {txt}Root MSE        =   {res} 321.13

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-153.7509{col 26}{space 2} 72.36001{col 37}{space 1}   -2.12{col 46}{space 3}0.036{col 67}{space 3}-.1814884
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-217.1897{col 26}{space 2} 92.80005{col 37}{space 1}   -2.34{col 46}{space 3}0.021{col 67}{space 3}-.2439758
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .4287187{col 26}{space 2} 4.349511{col 37}{space 1}    0.10{col 46}{space 3}0.922{col 67}{space 3}  .008417
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} -55.4599{col 26}{space 2} 81.56851{col 37}{space 1}   -0.68{col 46}{space 3}0.498{col 67}{space 3}-.0545363
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0795744{col 26}{space 2} .0545761{col 37}{space 1}    1.46{col 46}{space 3}0.148{col 67}{space 3} .1151526
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0025848{col 26}{space 2} .0003206{col 37}{space 1}    8.06{col 46}{space 3}0.000{col 67}{space 3} .8523695
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  949.066{col 26}{space 2} 449.9525{col 37}{space 1}    2.11{col 46}{space 3}0.038{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN    ICV_volM2 if sample_final2==1 & Race==1,beta 
{txt}{p 0 6 2}note: {bf:Race} omitted because of collinearity.{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}        96
{txt}{hline 13}{c +}{hline 34}   F(6, 89)        = {res}     0.97
{txt}       Model {c |} {res} 114.875343         6  19.1458905   {txt}Prob > F        ={res}    0.4500
{txt}    Residual {c |} {res} 1755.87892        89  19.7289767   {txt}R-squared       ={res}    0.0614
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0019
{txt}       Total {c |} {res} 1870.75426        95  19.6921502   {txt}Root MSE        =   {res} 4.4417

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .8621437{col 26}{space 2} 1.000858{col 37}{space 1}    0.86{col 46}{space 3}0.391{col 67}{space 3} .1015156
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} -.343412{col 26}{space 2} 1.283577{col 37}{space 1}   -0.27{col 46}{space 3}0.790{col 67}{space 3}-.0384809
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0577058{col 26}{space 2} .0601609{col 37}{space 1}    0.96{col 46}{space 3}0.340{col 67}{space 3} .1130124
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted){col 67}{res}{space 3}        .
{txt}{space 5}PovStat {c |}{col 14}{res}{space 2} 1.934682{col 26}{space 2} 1.128227{col 37}{space 1}    1.71{col 46}{space 3}0.090{col 67}{space 3} .1897743
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} -.000705{col 26}{space 2} .0007549{col 37}{space 1}   -0.93{col 46}{space 3}0.353{col 67}{space 3}-.1017688
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.26e-06{col 26}{space 2} 4.43e-06{col 37}{space 1}    0.74{col 46}{space 3}0.464{col 67}{space 3} .1072708
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.543555{col 26}{space 2} 6.223585{col 37}{space 1}   -0.73{col 46}{space 3}0.467{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. **Model 2**
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        88
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     86.07
{txt}{col 49}        avg{col 67}= {res}     86.07
{txt}{col 49}        max{col 67}= {res}     86.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   86.1{txt}){col 67}= {res}     10.96
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-161.8023{col 26}{space 2} 69.98795{col 37}{space 1}   -2.31{col 46}{space 3}0.023{col 54}{space 4}-300.9323{col 67}{space 3} -22.6724
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-67.90344{col 26}{space 2} 89.90148{col 37}{space 1}   -0.76{col 46}{space 3}0.452{col 54}{space 4}-246.6197{col 67}{space 3} 110.8128
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.416793{col 26}{space 2} 4.214367{col 37}{space 1}   -0.34{col 46}{space 3}0.738{col 54}{space 4}-9.794585{col 67}{space 3}    6.961
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-87.45554{col 26}{space 2} 78.68426{col 37}{space 1}   -1.11{col 46}{space 3}0.269{col 54}{space 4} -243.873{col 67}{space 3} 68.96189
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0476895{col 26}{space 2} .0531364{col 37}{space 1}    0.90{col 46}{space 3}0.372{col 54}{space 4} -.057941{col 67}{space 3} .1533199
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 8.471505{col 26}{space 2} 5.061193{col 37}{space 1}    1.67{col 46}{space 3}0.098{col 54}{space 4}-1.589703{col 67}{space 3} 18.53271
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019752{col 26}{space 2} .0003092{col 37}{space 1}    6.39{col 46}{space 3}0.000{col 54}{space 4} .0013605{col 67}{space 3} .0025899
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1229.694{col 26}{space 2} 480.4577{col 37}{space 1}    2.56{col 46}{space 3}0.012{col 54}{space 4} 274.5864{col 67}{space 3} 2184.802
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        88
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     86.07
{txt}{col 49}        avg{col 67}= {res}     86.07
{txt}{col 49}        max{col 67}= {res}     86.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   86.1{txt}){col 67}= {res}     14.43
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-141.9437{col 26}{space 2} 70.90092{col 37}{space 1}   -2.00{col 46}{space 3}0.048{col 54}{space 4}-282.8886{col 67}{space 3}-.9988993
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-198.0361{col 26}{space 2} 91.07422{col 37}{space 1}   -2.17{col 46}{space 3}0.032{col 54}{space 4}-379.0837{col 67}{space 3}-16.98854
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.344073{col 26}{space 2} 4.269342{col 37}{space 1}    0.31{col 46}{space 3}0.754{col 54}{space 4}-7.143004{col 67}{space 3} 9.831151
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-56.04465{col 26}{space 2} 79.71067{col 37}{space 1}   -0.70{col 46}{space 3}0.484{col 54}{space 4}-214.5025{col 67}{space 3} 102.4132
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0962083{col 26}{space 2} .0538295{col 37}{space 1}    1.79{col 46}{space 3}0.077{col 54}{space 4}-.0108001{col 67}{space 3} .2032166
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 11.68962{col 26}{space 2} 5.127214{col 37}{space 1}    2.28{col 46}{space 3}0.025{col 54}{space 4} 1.497164{col 67}{space 3} 21.88207
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0025869{col 26}{space 2} .0003133{col 37}{space 1}    8.26{col 46}{space 3}0.000{col 54}{space 4} .0019641{col 67}{space 3} .0032096
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 473.2045{col 26}{space 2} 486.7251{col 37}{space 1}    0.97{col 46}{space 3}0.334{col 54}{space 4}-494.3625{col 67}{space 3} 1440.771
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI ICV_volM2 if sample_final2==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        88
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     86.07
{txt}{col 49}        avg{col 67}= {res}     86.07
{txt}{col 49}        max{col 67}= {res}     86.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   7{txt},{res}   86.1{txt}){col 67}= {res}      0.86
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.5396

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .8998487{col 26}{space 2} 1.007723{col 37}{space 1}    0.89{col 46}{space 3}0.374{col 54}{space 4}-1.103417{col 67}{space 3} 2.903114
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.2822468{col 26}{space 2} 1.294449{col 37}{space 1}   -0.22{col 46}{space 3}0.828{col 54}{space 4}-2.855497{col 67}{space 3} 2.291004
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0606289{col 26}{space 2} .0606807{col 37}{space 1}    1.00{col 46}{space 3}0.321{col 54}{space 4}-.0599989{col 67}{space 3} .1812567
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.932815{col 26}{space 2} 1.132937{col 37}{space 1}    1.71{col 46}{space 3}0.092{col 54}{space 4}-.3193653{col 67}{space 3} 4.184994
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0006519{col 26}{space 2} .0007651{col 37}{space 1}   -0.85{col 46}{space 3}0.397{col 54}{space 4}-.0021728{col 67}{space 3}  .000869
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0373298{col 26}{space 2} .0728737{col 37}{space 1}    0.51{col 46}{space 3}0.610{col 54}{space 4}-.1075367{col 67}{space 3} .1821963
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.27e-06{col 26}{space 2} 4.45e-06{col 37}{space 1}    0.73{col 46}{space 3}0.465{col 54}{space 4}-5.58e-06{col 67}{space 3} .0000121
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-6.063178{col 26}{space 2} 6.917882{col 37}{space 1}   -0.88{col 46}{space 3}0.383{col 54}{space 4}-19.81532{col 67}{space 3} 7.688965
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //INTERACTION by Race//
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       153
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    151.04
{txt}{col 49}        avg{col 67}= {res}    151.04
{txt}{col 49}        max{col 67}= {res}    151.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  151.0{txt}){col 67}= {res}     15.16
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-141.1056{col 28}{space 2} 62.47048{col 39}{space 1}   -2.26{col 48}{space 3}0.025{col 56}{space 4}-264.5344{col 69}{space 3}-17.67673
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-406.7475{col 28}{space 2} 204.9369{col 39}{space 1}   -1.98{col 48}{space 3}0.049{col 56}{space 4}-811.6608{col 69}{space 3}-1.834173
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}  140.878{col 28}{space 2} 93.83657{col 39}{space 1}    1.50{col 48}{space 3}0.135{col 56}{space 4}-44.52382{col 69}{space 3} 326.2798
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 6.853257{col 28}{space 2} 64.59379{col 39}{space 1}    0.11{col 48}{space 3}0.916{col 56}{space 4}-120.7708{col 69}{space 3} 134.4773
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-5.106859{col 28}{space 2} 2.962085{col 39}{space 1}   -1.72{col 48}{space 3}0.087{col 56}{space 4}-10.95933{col 69}{space 3} .7456136
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-154.4409{col 28}{space 2} 56.05111{col 39}{space 1}   -2.76{col 48}{space 3}0.007{col 56}{space 4}-265.1864{col 69}{space 3}-43.69541
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0332122{col 28}{space 2} .0398687{col 39}{space 1}    0.83{col 48}{space 3}0.406{col 56}{space 4}-.0455602{col 69}{space 3} .1119847
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 3.007528{col 28}{space 2}  3.60238{col 39}{space 1}    0.83{col 48}{space 3}0.405{col 56}{space 4}-4.110036{col 69}{space 3} 10.12509
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0016405{col 28}{space 2} .0002365{col 39}{space 1}    6.94{col 48}{space 3}0.000{col 56}{space 4} .0011733{col 69}{space 3} .0021077
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1987.761{col 28}{space 2} 348.0687{col 39}{space 1}    5.71{col 48}{space 3}0.000{col 56}{space 4} 1300.048{col 69}{space 3} 2675.473
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       153
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    151.04
{txt}{col 49}        avg{col 67}= {res}    151.04
{txt}{col 49}        max{col 67}= {res}    151.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  151.0{txt}){col 67}= {res}     18.03
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-115.2859{col 28}{space 2} 64.31878{col 39}{space 1}   -1.79{col 48}{space 3}0.075{col 56}{space 4}-242.3666{col 69}{space 3} 11.79485
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} -345.327{col 28}{space 2} 211.0004{col 39}{space 1}   -1.64{col 48}{space 3}0.104{col 56}{space 4}-762.2205{col 69}{space 3}  71.5664
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 109.7947{col 28}{space 2} 96.61289{col 39}{space 1}    1.14{col 48}{space 3}0.258{col 56}{space 4} -81.0926{col 69}{space 3} 300.6819
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-95.41671{col 28}{space 2} 66.50492{col 39}{space 1}   -1.43{col 48}{space 3}0.153{col 56}{space 4}-226.8168{col 69}{space 3} 35.98337
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-3.593809{col 28}{space 2} 3.049724{col 39}{space 1}   -1.18{col 48}{space 3}0.240{col 56}{space 4}-9.619438{col 69}{space 3} 2.431819
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-144.9366{col 28}{space 2} 57.70948{col 39}{space 1}   -2.51{col 48}{space 3}0.013{col 56}{space 4}-258.9587{col 69}{space 3}-30.91455
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0722886{col 28}{space 2} .0410483{col 39}{space 1}    1.76{col 48}{space 3}0.080{col 56}{space 4}-.0088145{col 69}{space 3} .1533917
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}  3.43669{col 28}{space 2} 3.708963{col 39}{space 1}    0.93{col 48}{space 3}0.356{col 56}{space 4}-3.891461{col 69}{space 3} 10.76484
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021308{col 28}{space 2} .0002435{col 39}{space 1}    8.75{col 48}{space 3}0.000{col 56}{space 4} .0016498{col 69}{space 3} .0026119
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1532.738{col 28}{space 2} 358.3669{col 39}{space 1}    4.28{col 48}{space 3}0.000{col 56}{space 4} 824.6788{col 69}{space 3} 2240.798
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  ICV_volM2 if sample_final2==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}       153
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    151.04
{txt}{col 49}        avg{col 67}= {res}    151.04
{txt}{col 49}        max{col 67}= {res}    151.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}  151.0{txt}){col 67}= {res}      1.42
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1859

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} .9161609{col 28}{space 2} .8488533{col 39}{space 1}    1.08{col 48}{space 3}0.282{col 56}{space 4} -.760999{col 69}{space 3} 2.593321
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} .3648593{col 28}{space 2} 2.784697{col 39}{space 1}    0.13{col 48}{space 3}0.896{col 56}{space 4}-5.137131{col 69}{space 3}  5.86685
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}  .454785{col 28}{space 2} 1.275058{col 39}{space 1}    0.36{col 48}{space 3}0.722{col 56}{space 4}-2.064468{col 69}{space 3} 2.974038
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .2513491{col 28}{space 2}  .877705{col 39}{space 1}    0.29{col 48}{space 3}0.775{col 56}{space 4}-1.482816{col 69}{space 3} 1.985514
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0520767{col 28}{space 2}  .040249{col 39}{space 1}    1.29{col 48}{space 3}0.198{col 56}{space 4}-.0274471{col 69}{space 3} .1316005
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} 1.064234{col 28}{space 2} .7616264{col 39}{space 1}    1.40{col 48}{space 3}0.164{col 56}{space 4}-.4405835{col 69}{space 3} 2.569052
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} -.000871{col 28}{space 2} .0005417{col 39}{space 1}   -1.61{col 48}{space 3}0.110{col 56}{space 4}-.0019414{col 69}{space 3} .0001994
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0394205{col 28}{space 2} .0489494{col 39}{space 1}    0.81{col 48}{space 3}0.422{col 56}{space 4}-.0572935{col 69}{space 3} .1361345
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.72e-06{col 28}{space 2} 3.21e-06{col 39}{space 1}    0.85{col 48}{space 3}0.398{col 56}{space 4}-3.63e-06{col 69}{space 3} 9.07e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-4.263838{col 28}{space 2} 4.729582{col 39}{space 1}   -0.90{col 48}{space 3}0.369{col 56}{space 4}-13.60852{col 69}{space 3} 5.080846
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. *********************LnNFLw3, MODELS 3-6***************************
. 
. ***********MODEL 3: MODEL 2+w1dxDiabetes w1Glucose******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0222
{txt}{col 49}Largest FMI{col 67}= {res}    0.1602
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     37.60
{txt}{col 49}        avg{col 67}= {res}     51.84
{txt}{col 49}        max{col 67}= {res}     55.08
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   55.0{txt}){col 67}= {res}      6.03
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-49.14096{col 26}{space 2} 80.80847{col 37}{space 1}   -0.61{col 46}{space 3}0.546{col 54}{space 4}-211.3152{col 67}{space 3} 113.0332
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 98.17902{col 26}{space 2} 88.96271{col 37}{space 1}    1.10{col 46}{space 3}0.275{col 54}{space 4}  -80.219{col 67}{space 3}  276.577
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-5.366701{col 26}{space 2} 4.421875{col 37}{space 1}   -1.21{col 46}{space 3}0.230{col 54}{space 4}  -14.235{col 67}{space 3} 3.501597
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-213.7063{col 26}{space 2} 77.43324{col 37}{space 1}   -2.76{col 46}{space 3}0.008{col 54}{space 4}-368.8811{col 67}{space 3}-58.53154
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0219647{col 26}{space 2} .0587869{col 37}{space 1}    0.37{col 46}{space 3}0.710{col 54}{space 4}-.0958513{col 67}{space 3} .1397807
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-3.716082{col 26}{space 2} 5.082104{col 37}{space 1}   -0.73{col 46}{space 3}0.468{col 54}{space 4}-13.90057{col 67}{space 3} 6.468409
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-87.96662{col 26}{space 2} 63.22089{col 37}{space 1}   -1.39{col 46}{space 3}0.172{col 54}{space 4}-215.9949{col 67}{space 3} 40.06169
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 4.685141{col 26}{space 2} 1.761168{col 37}{space 1}    2.66{col 46}{space 3}0.010{col 54}{space 4} 1.146991{col 67}{space 3} 8.223292
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0009829{col 26}{space 2} .0003731{col 37}{space 1}    2.63{col 46}{space 3}0.011{col 54}{space 4} .0002345{col 67}{space 3} .0017313
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2294.209{col 26}{space 2} 471.1676{col 37}{space 1}    4.87{col 46}{space 3}0.000{col 54}{space 4} 1349.871{col 67}{space 3} 3238.546
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0046
{txt}{col 49}Largest FMI{col 67}= {res}    0.0306
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     52.98
{txt}{col 49}        avg{col 67}= {res}     54.58
{txt}{col 49}        max{col 67}= {res}     55.09
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   55.1{txt}){col 67}= {res}      8.29
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-55.09952{col 26}{space 2} 74.06593{col 37}{space 1}   -0.74{col 46}{space 3}0.460{col 54}{space 4} -203.567{col 67}{space 3} 93.36799
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 15.59873{col 26}{space 2} 82.17961{col 37}{space 1}    0.19{col 46}{space 3}0.850{col 54}{space 4}-149.1189{col 67}{space 3} 180.3163
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-4.588166{col 26}{space 2} 4.075643{col 37}{space 1}   -1.13{col 46}{space 3}0.265{col 54}{space 4}-12.75697{col 67}{space 3} 3.580643
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-222.7262{col 26}{space 2} 72.04856{col 37}{space 1}   -3.09{col 46}{space 3}0.003{col 54}{space 4}-367.1097{col 67}{space 3} -78.3427
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0581674{col 26}{space 2} .0546345{col 37}{space 1}    1.06{col 46}{space 3}0.292{col 54}{space 4}-.0513202{col 67}{space 3}  .167655
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-7.080264{col 26}{space 2} 4.729022{col 37}{space 1}   -1.50{col 46}{space 3}0.140{col 54}{space 4}-16.55719{col 67}{space 3} 2.396658
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} -58.5007{col 26}{space 2} 55.13594{col 37}{space 1}   -1.06{col 46}{space 3}0.293{col 54}{space 4}-169.0904{col 67}{space 3}   52.089
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} 5.912763{col 26}{space 2} 1.597788{col 37}{space 1}    3.70{col 46}{space 3}0.001{col 54}{space 4} 2.709981{col 67}{space 3} 9.115544
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}    .0013{col 26}{space 2} .0003439{col 37}{space 1}    3.78{col 46}{space 3}0.000{col 54}{space 4} .0006107{col 67}{space 3} .0019892
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2145.064{col 26}{space 2} 437.7397{col 37}{space 1}    4.90{col 46}{space 3}0.000{col 54}{space 4} 1267.795{col 67}{space 3} 3022.334
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0008
{txt}{col 49}Largest FMI{col 67}= {res}    0.0079
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     54.70
{txt}{col 49}        avg{col 67}= {res}     55.04
{txt}{col 49}        max{col 67}= {res}     55.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   55.1{txt}){col 67}= {res}      1.33
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.2435

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 1.404899{col 26}{space 2} 1.039071{col 37}{space 1}    1.35{col 46}{space 3}0.182{col 54}{space 4}-.6773866{col 67}{space 3} 3.487184
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .5932177{col 26}{space 2} 1.154347{col 37}{space 1}    0.51{col 46}{space 3}0.609{col 54}{space 4}-1.720058{col 67}{space 3} 2.906494
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0356059{col 26}{space 2} .0572947{col 37}{space 1}    0.62{col 46}{space 3}0.537{col 54}{space 4}-.0792121{col 67}{space 3}  .150424
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} .0234379{col 26}{space 2} 1.015855{col 37}{space 1}    0.02{col 46}{space 3}0.982{col 54}{space 4}-2.012298{col 67}{space 3} 2.059174
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0010848{col 26}{space 2} .0007701{col 37}{space 1}   -1.41{col 46}{space 3}0.165{col 54}{space 4}-.0026281{col 67}{space 3} .0004586
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0600602{col 26}{space 2} .0666668{col 37}{space 1}    0.90{col 46}{space 3}0.372{col 54}{space 4}-.0735378{col 67}{space 3} .1936582
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} -.187817{col 26}{space 2}  .768931{col 37}{space 1}   -0.24{col 46}{space 3}0.808{col 54}{space 4}-1.728976{col 67}{space 3} 1.353342
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2}-.0072259{col 26}{space 2} .0224391{col 37}{space 1}   -0.32{col 46}{space 3}0.749{col 54}{space 4}-.0521957{col 67}{space 3} .0377439
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 4.16e-06{col 26}{space 2} 4.83e-06{col 37}{space 1}    0.86{col 46}{space 3}0.392{col 54}{space 4}-5.51e-06{col 67}{space 3} .0000138
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.503549{col 26}{space 2}   6.1646{col 37}{space 1}   -0.57{col 46}{space 3}0.572{col 54}{space 4} -15.8572{col 67}{space 3} 8.850103
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITE//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     84.07
{txt}{col 49}        avg{col 67}= {res}     84.07
{txt}{col 49}        max{col 67}= {res}     84.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.1{txt}){col 67}= {res}      8.53
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-179.8155{col 26}{space 2} 74.93459{col 37}{space 1}   -2.40{col 46}{space 3}0.019{col 54}{space 4}-328.8294{col 67}{space 3}-30.80161
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-80.78401{col 26}{space 2} 91.58924{col 37}{space 1}   -0.88{col 46}{space 3}0.380{col 54}{space 4}-262.9171{col 67}{space 3} 101.3491
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.773304{col 26}{space 2} 4.283436{col 37}{space 1}   -0.41{col 46}{space 3}0.680{col 54}{space 4}-10.29129{col 67}{space 3} 6.744679
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-97.29622{col 26}{space 2} 79.90756{col 37}{space 1}   -1.22{col 46}{space 3}0.227{col 54}{space 4}-256.1993{col 67}{space 3} 61.60686
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0583018{col 26}{space 2} .0545818{col 37}{space 1}    1.07{col 46}{space 3}0.289{col 54}{space 4}-.0502389{col 67}{space 3} .1668425
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 6.995737{col 26}{space 2} 5.303622{col 37}{space 1}    1.32{col 46}{space 3}0.191{col 54}{space 4}-3.550974{col 67}{space 3} 17.54245
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 36.91038{col 26}{space 2} 69.58166{col 37}{space 1}    0.53{col 46}{space 3}0.597{col 54}{space 4}-101.4588{col 67}{space 3} 175.2795
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} .3914494{col 26}{space 2} 1.483548{col 37}{space 1}    0.26{col 46}{space 3}0.793{col 54}{space 4}-2.558713{col 67}{space 3} 3.341612
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019604{col 26}{space 2} .0003152{col 37}{space 1}    6.22{col 46}{space 3}0.000{col 54}{space 4} .0013336{col 67}{space 3} .0025871
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1306.485{col 26}{space 2} 515.6749{col 37}{space 1}    2.53{col 46}{space 3}0.013{col 54}{space 4} 281.0209{col 67}{space 3} 2331.949
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     84.07
{txt}{col 49}        avg{col 67}= {res}     84.07
{txt}{col 49}        max{col 67}= {res}     84.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.1{txt}){col 67}= {res}     11.16
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} -162.505{col 26}{space 2} 76.00197{col 37}{space 1}   -2.14{col 46}{space 3}0.035{col 54}{space 4}-313.6415{col 67}{space 3}-11.36849
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-210.9234{col 26}{space 2} 92.89385{col 37}{space 1}   -2.27{col 46}{space 3}0.026{col 54}{space 4}-395.6508{col 67}{space 3}-26.19594
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.180823{col 26}{space 2}  4.34445{col 37}{space 1}    0.27{col 46}{space 3}0.786{col 54}{space 4}-7.458491{col 67}{space 3} 9.820138
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-63.09688{col 26}{space 2} 81.04577{col 37}{space 1}   -0.78{col 46}{space 3}0.438{col 54}{space 4}-224.2634{col 67}{space 3} 98.06965
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .1044727{col 26}{space 2} .0553593{col 37}{space 1}    1.89{col 46}{space 3}0.063{col 54}{space 4}-.0056141{col 67}{space 3} .2145594
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 10.41958{col 26}{space 2} 5.379168{col 37}{space 1}    1.94{col 46}{space 3}0.056{col 54}{space 4}-.2773561{col 67}{space 3} 21.11652
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2} 14.91953{col 26}{space 2} 70.57279{col 37}{space 1}    0.21{col 46}{space 3}0.833{col 54}{space 4}-125.4206{col 67}{space 3} 155.2596
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} .7402367{col 26}{space 2}  1.50468{col 37}{space 1}    0.49{col 46}{space 3}0.624{col 54}{space 4}-2.251949{col 67}{space 3} 3.732422
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2}  .002588{col 26}{space 2} .0003197{col 37}{space 1}    8.10{col 46}{space 3}0.000{col 54}{space 4} .0019524{col 67}{space 3} .0032237
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 492.8709{col 26}{space 2} 523.0202{col 37}{space 1}    0.94{col 46}{space 3}0.349{col 54}{space 4}   -547.2{col 67}{space 3} 1532.942
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     84.07
{txt}{col 49}        avg{col 67}= {res}     84.07
{txt}{col 49}        max{col 67}= {res}     84.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.1{txt}){col 67}= {res}      0.67
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.7298

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .9301248{col 26}{space 2} 1.084098{col 37}{space 1}    0.86{col 46}{space 3}0.393{col 54}{space 4}-1.225697{col 67}{space 3} 3.085946
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.2403099{col 26}{space 2} 1.325045{col 37}{space 1}   -0.18{col 46}{space 3}0.857{col 54}{space 4}-2.875276{col 67}{space 3} 2.394656
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0639516{col 26}{space 2} .0619696{col 37}{space 1}    1.03{col 46}{space 3}0.305{col 54}{space 4}-.0592802{col 67}{space 3} .1871834
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.996075{col 26}{space 2} 1.156043{col 37}{space 1}    1.73{col 46}{space 3}0.088{col 54}{space 4}-.3028162{col 67}{space 3} 4.294966
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0007127{col 26}{space 2} .0007896{col 37}{space 1}   -0.90{col 46}{space 3}0.369{col 54}{space 4} -.002283{col 67}{space 3} .0008575
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0444425{col 26}{space 2} .0767288{col 37}{space 1}    0.58{col 46}{space 3}0.564{col 54}{space 4}-.1081394{col 67}{space 3} .1970244
{txt}w1dxDiabetes {c |}{col 14}{res}{space 2}-.3661548{col 26}{space 2} 1.006655{col 37}{space 1}   -0.36{col 46}{space 3}0.717{col 54}{space 4}-2.367976{col 67}{space 3} 1.635666
{txt}{space 3}w1Glucose {c |}{col 14}{res}{space 2} .0026212{col 26}{space 2} .0214629{col 37}{space 1}    0.12{col 46}{space 3}0.903{col 54}{space 4}-.0400595{col 67}{space 3}  .045302
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.49e-06{col 26}{space 2} 4.56e-06{col 37}{space 1}    0.77{col 46}{space 3}0.446{col 54}{space 4}-5.57e-06{col 67}{space 3} .0000126
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-6.952054{col 26}{space 2} 7.460399{col 37}{space 1}   -0.93{col 46}{space 3}0.354{col 54}{space 4} -21.7877{col 67}{space 3} 7.883593
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. //INTERACTION by Race//
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0043
{txt}{col 49}Largest FMI{col 67}= {res}    0.0467
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    132.75
{txt}{col 49}        avg{col 67}= {res}    147.20
{txt}{col 49}        max{col 67}= {res}    149.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}     12.78
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-177.0605{col 28}{space 2} 65.45262{col 39}{space 1}   -2.71{col 48}{space 3}0.008{col 56}{space 4} -306.396{col 69}{space 3}-47.72499
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-470.8188{col 28}{space 2} 207.5339{col 39}{space 1}   -2.27{col 48}{space 3}0.025{col 56}{space 4}-880.9089{col 69}{space 3}-60.72869
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 173.3039{col 28}{space 2} 95.22846{col 39}{space 1}    1.82{col 48}{space 3}0.071{col 56}{space 4}-14.86876{col 69}{space 3} 361.4766
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-8.771197{col 28}{space 2} 64.91988{col 39}{space 1}   -0.14{col 48}{space 3}0.893{col 56}{space 4}-137.0536{col 69}{space 3} 119.5112
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-4.980036{col 28}{space 2} 3.019056{col 39}{space 1}   -1.65{col 48}{space 3}0.101{col 56}{space 4}-10.94584{col 69}{space 3} .9857648
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-161.8968{col 28}{space 2}  56.0105{col 39}{space 1}   -2.89{col 48}{space 3}0.004{col 56}{space 4}-272.5741{col 69}{space 3} -51.2194
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0410463{col 28}{space 2}  .040198{col 39}{space 1}    1.02{col 48}{space 3}0.309{col 56}{space 4}-.0383857{col 69}{space 3} .1204782
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1.595738{col 28}{space 2} 3.673549{col 39}{space 1}    0.43{col 48}{space 3}0.665{col 56}{space 4}-5.663241{col 69}{space 3} 8.854717
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-.7002073{col 28}{space 2} 46.82194{col 39}{space 1}   -0.01{col 48}{space 3}0.988{col 56}{space 4}-93.31381{col 69}{space 3} 91.91339
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2} 1.586994{col 28}{space 2} 1.116525{col 39}{space 1}    1.42{col 48}{space 3}0.157{col 56}{space 4}-.6198548{col 69}{space 3} 3.793843
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2}  .001645{col 28}{space 2} .0002355{col 39}{space 1}    6.98{col 48}{space 3}0.000{col 56}{space 4} .0011796{col 69}{space 3} .0021103
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1952.692{col 28}{space 2} 357.3623{col 39}{space 1}    5.46{col 48}{space 3}0.000{col 56}{space 4} 1246.525{col 69}{space 3} 2658.858
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0003
{txt}{col 49}Largest FMI{col 67}= {res}    0.0031
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    148.57
{txt}{col 49}        avg{col 67}= {res}    148.98
{txt}{col 49}        max{col 67}= {res}    149.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}     15.70
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-162.2377{col 28}{space 2} 66.79819{col 39}{space 1}   -2.43{col 48}{space 3}0.016{col 56}{space 4}-294.2316{col 69}{space 3}-30.24386
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-437.1091{col 28}{space 2} 211.8127{col 39}{space 1}   -2.06{col 48}{space 3}0.041{col 56}{space 4}-855.6528{col 69}{space 3}-18.56533
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 155.6431{col 28}{space 2} 97.19654{col 39}{space 1}    1.60{col 48}{space 3}0.111{col 56}{space 4}-36.41812{col 69}{space 3} 347.7044
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-117.5574{col 28}{space 2} 66.26492{col 39}{space 1}   -1.77{col 48}{space 3}0.078{col 56}{space 4}-248.4975{col 69}{space 3}  13.3827
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-3.600681{col 28}{space 2}  3.07846{col 39}{space 1}   -1.17{col 48}{space 3}0.244{col 56}{space 4}-9.683749{col 69}{space 3} 2.482387
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-155.8038{col 28}{space 2} 57.17274{col 39}{space 1}   -2.73{col 48}{space 3}0.007{col 56}{space 4}-268.7777{col 69}{space 3}-42.82997
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0842267{col 28}{space 2} .0410219{col 39}{space 1}    2.05{col 48}{space 3}0.042{col 56}{space 4} .0031671{col 69}{space 3} .1652862
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 1.452286{col 28}{space 2} 3.749517{col 39}{space 1}    0.39{col 48}{space 3}0.699{col 56}{space 4}-5.956795{col 69}{space 3} 8.861366
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2} 11.82312{col 28}{space 2} 46.77331{col 39}{space 1}    0.25{col 48}{space 3}0.801{col 56}{space 4}-80.60375{col 69}{space 3}   104.25
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2}  1.95626{col 28}{space 2} 1.129659{col 39}{space 1}    1.73{col 48}{space 3}0.085{col 56}{space 4}-.2759798{col 69}{space 3} 4.188501
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021357{col 28}{space 2} .0002404{col 39}{space 1}    8.88{col 48}{space 3}0.000{col 56}{space 4} .0016606{col 69}{space 3} .0026107
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1508.048{col 28}{space 2} 364.3884{col 39}{space 1}    4.14{col 48}{space 3}0.000{col 56}{space 4} 788.0116{col 69}{space 3} 2228.083
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1dxDiabetes w1Glucose ICV_volM2 if sample_final2==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0003
{txt}{col 49}Largest FMI{col 67}= {res}    0.0029
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    148.59
{txt}{col 49}        avg{col 67}= {res}    148.98
{txt}{col 49}        max{col 67}= {res}    149.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}      1.19
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.2990

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} .9946109{col 28}{space 2} .8979368{col 39}{space 1}    1.11{col 48}{space 3}0.270{col 56}{space 4}-.7797207{col 69}{space 3} 2.768943
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} .6896191{col 28}{space 2} 2.847371{col 39}{space 1}    0.24{col 48}{space 3}0.809{col 56}{space 4}-4.936814{col 69}{space 3} 6.316053
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} .3048273{col 28}{space 2} 1.306604{col 39}{space 1}    0.23{col 48}{space 3}0.816{col 56}{space 4}-2.277035{col 69}{space 3}  2.88669
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .3228415{col 28}{space 2} .8908104{col 39}{space 1}    0.36{col 48}{space 3}0.718{col 56}{space 4}-1.437409{col 69}{space 3} 2.083092
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0560338{col 28}{space 2} .0413817{col 39}{space 1}    1.35{col 48}{space 3}0.178{col 56}{space 4}-.0257368{col 69}{space 3} .1378045
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} 1.110649{col 28}{space 2} .7685566{col 39}{space 1}    1.45{col 48}{space 3}0.151{col 56}{space 4} -.408026{col 69}{space 3} 2.629325
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} -.000931{col 28}{space 2} .0005514{col 39}{space 1}   -1.69{col 48}{space 3}0.093{col 56}{space 4}-.0020206{col 69}{space 3} .0001587
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0458902{col 28}{space 2} .0504031{col 39}{space 1}    0.91{col 48}{space 3}0.364{col 56}{space 4}-.0537068{col 69}{space 3} .1454872
{txt}{space 2}w1dxDiabetes {c |}{col 16}{res}{space 2}-.3160763{col 28}{space 2} .6287176{col 39}{space 1}   -0.50{col 48}{space 3}0.616{col 56}{space 4}-1.558459{col 69}{space 3}  .926306
{txt}{space 5}w1Glucose {c |}{col 16}{res}{space 2}-.0005545{col 28}{space 2} .0151856{col 39}{space 1}   -0.04{col 48}{space 3}0.971{col 56}{space 4}-.0305617{col 69}{space 3} .0294527
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.76e-06{col 28}{space 2} 3.23e-06{col 39}{space 1}    0.85{col 48}{space 3}0.395{col 56}{space 4}-3.63e-06{col 69}{space 3} 9.14e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-4.726864{col 28}{space 2}  4.89848{col 39}{space 1}   -0.96{col 48}{space 3}0.336{col 56}{space 4}-14.40633{col 69}{space 3} 4.952599
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 4: MODEL 2+liver/kidney disease******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.1377
{txt}{col 49}Largest FMI{col 67}= {res}    0.6657
{txt}{col 49}Complete DF{col 67}= {res}        54
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}      7.26
{txt}{col 49}        avg{col 67}= {res}     44.86
{txt}{col 49}        max{col 67}= {res}     51.54
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   50.1{txt}){col 67}= {res}      3.30
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0018

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-13.95594{col 26}{space 2} 87.21063{col 37}{space 1}   -0.16{col 46}{space 3}0.873{col 54}{space 4}-188.9942{col 67}{space 3} 161.0823
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 95.59773{col 26}{space 2} 137.3404{col 37}{space 1}    0.70{col 46}{space 3}0.492{col 54}{space 4}-184.8257{col 67}{space 3} 376.0212
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-8.140242{col 26}{space 2} 5.154889{col 37}{space 1}   -1.58{col 46}{space 3}0.120{col 54}{space 4}-18.48833{col 67}{space 3} 2.207843
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-207.3694{col 26}{space 2} 85.47359{col 37}{space 1}   -2.43{col 46}{space 3}0.019{col 54}{space 4}-378.9915{col 67}{space 3}-35.74727
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0284821{col 26}{space 2} .0661283{col 37}{space 1}    0.43{col 46}{space 3}0.669{col 54}{space 4}-.1045389{col 67}{space 3} .1615031
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} -.724773{col 26}{space 2} 6.425114{col 37}{space 1}   -0.11{col 46}{space 3}0.911{col 54}{space 4} -13.6405{col 67}{space 3} 12.19096
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 74.35231{col 26}{space 2} 250.6608{col 37}{space 1}    0.30{col 46}{space 3}0.775{col 54}{space 4}-514.0469{col 67}{space 3} 662.7515
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-4188.499{col 26}{space 2} 5410.191{col 37}{space 1}   -0.77{col 46}{space 3}0.442{col 54}{space 4}-15055.88{col 67}{space 3} 6678.885
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 3.643435{col 26}{space 2} 12.35182{col 37}{space 1}    0.29{col 46}{space 3}0.769{col 54}{space 4}-21.18424{col 67}{space 3} 28.47111
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0446226{col 26}{space 2} 1.930171{col 37}{space 1}   -0.02{col 46}{space 3}0.982{col 54}{space 4}-3.923443{col 67}{space 3} 3.834198
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-13.40582{col 26}{space 2} 30.29201{col 37}{space 1}   -0.44{col 46}{space 3}0.660{col 54}{space 4}-74.22461{col 67}{space 3} 47.41296
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0011633{col 26}{space 2} .0004205{col 37}{space 1}    2.77{col 46}{space 3}0.008{col 54}{space 4}  .000318{col 67}{space 3} .0020086
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6663.433{col 26}{space 2} 5474.044{col 37}{space 1}    1.22{col 46}{space 3}0.229{col 54}{space 4}-4329.525{col 67}{space 3} 17656.39
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0588
{txt}{col 49}Largest FMI{col 67}= {res}    0.4317
{txt}{col 49}Complete DF{col 67}= {res}        54
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     14.79
{txt}{col 49}        avg{col 67}= {res}     47.66
{txt}{col 49}        max{col 67}= {res}     51.97
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   51.5{txt}){col 67}= {res}      4.01
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0003

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-38.93951{col 26}{space 2} 85.61216{col 37}{space 1}   -0.45{col 46}{space 3}0.651{col 54}{space 4}-210.7355{col 67}{space 3} 132.8565
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-4.123882{col 26}{space 2} 126.8679{col 37}{space 1}   -0.03{col 46}{space 3}0.974{col 54}{space 4} -259.791{col 67}{space 3} 251.5432
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-7.907982{col 26}{space 2} 5.054397{col 37}{space 1}   -1.56{col 46}{space 3}0.124{col 54}{space 4} -18.0514{col 67}{space 3}  2.23544
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-221.3507{col 26}{space 2} 83.48471{col 37}{space 1}   -2.65{col 46}{space 3}0.011{col 54}{space 4}-388.8863{col 67}{space 3}-53.81509
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0746189{col 26}{space 2} .0642457{col 37}{space 1}    1.16{col 46}{space 3}0.251{col 54}{space 4}-.0544297{col 67}{space 3} .2036674
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-6.793294{col 26}{space 2} 6.255357{col 37}{space 1}   -1.09{col 46}{space 3}0.283{col 54}{space 4}-19.35439{col 67}{space 3} 5.767799
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 76.57835{col 26}{space 2} 198.9112{col 37}{space 1}    0.38{col 46}{space 3}0.706{col 54}{space 4}-347.9058{col 67}{space 3} 501.0625
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2} 376.0752{col 26}{space 2} 5316.492{col 37}{space 1}    0.07{col 46}{space 3}0.944{col 54}{space 4}-10300.78{col 67}{space 3} 11052.93
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 13.84096{col 26}{space 2}  12.0041{col 37}{space 1}    1.15{col 46}{space 3}0.254{col 54}{space 4}-10.25918{col 67}{space 3}  37.9411
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.5298462{col 26}{space 2} 1.881907{col 37}{space 1}   -0.28{col 46}{space 3}0.779{col 54}{space 4}-4.308348{col 67}{space 3} 3.248656
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-8.133584{col 26}{space 2} 29.74346{col 37}{space 1}   -0.27{col 46}{space 3}0.786{col 54}{space 4}-67.83729{col 67}{space 3} 51.57012
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0015537{col 26}{space 2} .0004082{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .0007341{col 67}{space 3} .0023734
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1929.993{col 26}{space 2} 5385.394{col 37}{space 1}    0.36{col 46}{space 3}0.722{col 54}{space 4}-8883.723{col 67}{space 3} 12743.71
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0208
{txt}{col 49}Largest FMI{col 67}= {res}    0.1100
{txt}{col 49}Complete DF{col 67}= {res}        54
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     41.83
{txt}{col 49}        avg{col 67}= {res}     50.20
{txt}{col 49}        max{col 67}= {res}     51.86
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   52.0{txt}){col 67}= {res}      1.49
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.1639

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 1.649326{col 26}{space 2} 1.055735{col 37}{space 1}    1.56{col 46}{space 3}0.124{col 54}{space 4}-.4704674{col 67}{space 3} 3.769119
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .1186905{col 26}{space 2} 1.518896{col 37}{space 1}    0.08{col 46}{space 3}0.938{col 54}{space 4}-2.934751{col 67}{space 3} 3.172132
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0322536{col 26}{space 2} .0618104{col 37}{space 1}    0.52{col 46}{space 3}0.604{col 54}{space 4}-.0917987{col 67}{space 3}  .156306
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} .2521672{col 26}{space 2} 1.025299{col 37}{space 1}    0.25{col 46}{space 3}0.807{col 54}{space 4}-1.806062{col 67}{space 3} 2.310396
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0013191{col 26}{space 2} .0007787{col 37}{space 1}   -1.69{col 46}{space 3}0.096{col 54}{space 4}-.0028822{col 67}{space 3} .0002441
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0724991{col 26}{space 2} .0766506{col 37}{space 1}    0.95{col 46}{space 3}0.349{col 54}{space 4}-.0814605{col 67}{space 3} .2264587
{txt}w1Creatinine {c |}{col 14}{res}{space 2} 1.823648{col 26}{space 2} 2.011527{col 37}{space 1}    0.91{col 46}{space 3}0.370{col 54}{space 4}-2.236268{col 67}{space 3} 5.883564
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-104.8768{col 26}{space 2} 64.30116{col 37}{space 1}   -1.63{col 46}{space 3}0.109{col 54}{space 4}-233.9207{col 67}{space 3} 24.16706
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}  .094464{col 26}{space 2} .1456808{col 37}{space 1}    0.65{col 46}{space 3}0.520{col 54}{space 4}-.1978939{col 67}{space 3}  .386822
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0193877{col 26}{space 2} .0228705{col 37}{space 1}   -0.85{col 46}{space 3}0.401{col 54}{space 4}-.0652917{col 67}{space 3} .0265162
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-.3987618{col 26}{space 2} .3617585{col 37}{space 1}   -1.10{col 46}{space 3}0.275{col 54}{space 4}-1.124729{col 67}{space 3} .3272052
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 5.57e-06{col 26}{space 2} 5.03e-06{col 37}{space 1}    1.11{col 46}{space 3}0.273{col 54}{space 4}-4.53e-06{col 67}{space 3} .0000157
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 101.7825{col 26}{space 2} 65.30566{col 37}{space 1}    1.56{col 46}{space 3}0.125{col 54}{space 4}-29.28377{col 67}{space 3} 232.8487
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0286
{txt}{col 49}Largest FMI{col 67}= {res}    0.2089
{txt}{col 49}Complete DF{col 67}= {res}        83
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     41.12
{txt}{col 49}        avg{col 67}= {res}     72.98
{txt}{col 49}        max{col 67}= {res}     80.90
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   80.8{txt}){col 67}= {res}      7.00
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} -183.752{col 26}{space 2} 75.31367{col 37}{space 1}   -2.44{col 46}{space 3}0.017{col 54}{space 4}-333.6138{col 67}{space 3}-33.89023
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-94.97325{col 26}{space 2} 114.6321{col 37}{space 1}   -0.83{col 46}{space 3}0.410{col 54}{space 4}-323.1435{col 67}{space 3}  133.197
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.371368{col 26}{space 2} 4.329982{col 37}{space 1}   -0.32{col 46}{space 3}0.752{col 54}{space 4}-9.987103{col 67}{space 3} 7.244367
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-77.74981{col 26}{space 2} 81.15291{col 37}{space 1}   -0.96{col 46}{space 3}0.341{col 54}{space 4}-239.2353{col 67}{space 3} 83.73568
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0525803{col 26}{space 2} .0559684{col 37}{space 1}    0.94{col 46}{space 3}0.350{col 54}{space 4}-.0588026{col 67}{space 3} .1639631
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  7.13657{col 26}{space 2} 5.807241{col 37}{space 1}    1.23{col 46}{space 3}0.223{col 54}{space 4}-4.418639{col 67}{space 3} 18.69178
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-100.9116{col 26}{space 2} 222.4487{col 37}{space 1}   -0.45{col 46}{space 3}0.652{col 54}{space 4}-550.1174{col 67}{space 3} 348.2942
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-4620.509{col 26}{space 2}  7121.31{col 37}{space 1}   -0.65{col 46}{space 3}0.519{col 54}{space 4}-18877.02{col 67}{space 3} 9636.004
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} 15.26648{col 26}{space 2} 9.818031{col 37}{space 1}    1.55{col 46}{space 3}0.125{col 54}{space 4}-4.320534{col 67}{space 3} 34.85349
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-1.329169{col 26}{space 2} 1.569534{col 37}{space 1}   -0.85{col 46}{space 3}0.400{col 54}{space 4}-4.452108{col 67}{space 3}  1.79377
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} 8.952385{col 26}{space 2} 28.56843{col 37}{space 1}    0.31{col 46}{space 3}0.755{col 54}{space 4}-47.89221{col 67}{space 3} 65.79698
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0021049{col 26}{space 2} .0003308{col 37}{space 1}    6.36{col 46}{space 3}0.000{col 54}{space 4} .0014466{col 67}{space 3} .0027632
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5780.882{col 26}{space 2} 7085.472{col 37}{space 1}    0.82{col 46}{space 3}0.418{col 54}{space 4}-8402.552{col 67}{space 3} 19964.32
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0223
{txt}{col 49}Largest FMI{col 67}= {res}    0.1588
{txt}{col 49}Complete DF{col 67}= {res}        83
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     50.47
{txt}{col 49}        avg{col 67}= {res}     74.17
{txt}{col 49}        max{col 67}= {res}     81.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   80.9{txt}){col 67}= {res}      9.02
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-169.9476{col 26}{space 2}  76.5165{col 37}{space 1}   -2.22{col 46}{space 3}0.029{col 54}{space 4}-322.1931{col 67}{space 3}-17.70207
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-201.4306{col 26}{space 2} 116.5952{col 37}{space 1}   -1.73{col 46}{space 3}0.088{col 54}{space 4}-433.4996{col 67}{space 3} 30.63839
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.007386{col 26}{space 2} 4.401611{col 37}{space 1}    0.23{col 46}{space 3}0.820{col 54}{space 4}-7.750494{col 67}{space 3} 9.765267
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-43.47824{col 26}{space 2} 82.62032{col 37}{space 1}   -0.53{col 46}{space 3}0.600{col 54}{space 4}-207.8851{col 67}{space 3} 120.9286
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0983139{col 26}{space 2}  .056908{col 37}{space 1}    1.73{col 46}{space 3}0.088{col 54}{space 4}-.0149335{col 67}{space 3} .2115614
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 11.45981{col 26}{space 2} 5.912171{col 37}{space 1}    1.94{col 46}{space 3}0.056{col 54}{space 4}-.3042755{col 67}{space 3} 23.22389
{txt}w1Creatinine {c |}{col 14}{res}{space 2}-45.40891{col 26}{space 2} 220.5234{col 37}{space 1}   -0.21{col 46}{space 3}0.838{col 54}{space 4}-488.2401{col 67}{space 3} 397.4223
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}-5585.605{col 26}{space 2}  7241.88{col 37}{space 1}   -0.77{col 46}{space 3}0.444{col 54}{space 4}-20081.38{col 67}{space 3} 8910.173
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2}  15.6447{col 26}{space 2} 9.902222{col 37}{space 1}    1.58{col 46}{space 3}0.118{col 54}{space 4} -4.09145{col 67}{space 3} 35.38086
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.1567457{col 26}{space 2} 1.597418{col 37}{space 1}   -0.10{col 46}{space 3}0.922{col 54}{space 4}-3.335161{col 67}{space 3}  3.02167
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2}-4.790662{col 26}{space 2} 29.03722{col 37}{space 1}   -0.16{col 46}{space 3}0.869{col 54}{space 4} -62.5653{col 67}{space 3} 52.98398
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0026748{col 26}{space 2} .0003364{col 37}{space 1}    7.95{col 46}{space 3}0.000{col 54}{space 4} .0020055{col 67}{space 3} .0033442
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5964.779{col 26}{space 2} 7206.571{col 37}{space 1}    0.83{col 46}{space 3}0.411{col 54}{space 4} -8459.35{col 67}{space 3} 20388.91
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0069
{txt}{col 49}Largest FMI{col 67}= {res}    0.0622
{txt}{col 49}Complete DF{col 67}= {res}        83
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     71.58
{txt}{col 49}        avg{col 67}= {res}     79.85
{txt}{col 49}        max{col 67}= {res}     81.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}   81.0{txt}){col 67}= {res}      0.84
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.6015

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .6826397{col 26}{space 2} 1.085617{col 37}{space 1}    0.63{col 46}{space 3}0.531{col 54}{space 4}-1.477459{col 67}{space 3} 2.842738
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-1.168372{col 26}{space 2} 1.643269{col 37}{space 1}   -0.71{col 46}{space 3}0.479{col 54}{space 4}-4.438203{col 67}{space 3} 2.101458
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0567597{col 26}{space 2} .0624528{col 37}{space 1}    0.91{col 46}{space 3}0.366{col 54}{space 4}-.0675042{col 67}{space 3} .1810236
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.580389{col 26}{space 2} 1.168387{col 37}{space 1}    1.35{col 46}{space 3}0.180{col 54}{space 4}-.7443485{col 67}{space 3} 3.905126
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0008631{col 26}{space 2} .0008053{col 37}{space 1}   -1.07{col 46}{space 3}0.287{col 54}{space 4}-.0024655{col 67}{space 3} .0007394
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-.0151189{col 26}{space 2} .0837439{col 37}{space 1}   -0.18{col 46}{space 3}0.857{col 54}{space 4}-.1817459{col 67}{space 3} .1515081
{txt}w1Creatinine {c |}{col 14}{res}{space 2} .7278194{col 26}{space 2} 2.978421{col 37}{space 1}    0.24{col 46}{space 3}0.808{col 54}{space 4}-5.210146{col 67}{space 3} 6.665784
{txt}{space 1}w1USpecGrav {c |}{col 14}{res}{space 2}  144.603{col 26}{space 2} 97.43424{col 37}{space 1}    1.48{col 46}{space 3}0.142{col 54}{space 4}-49.32267{col 67}{space 3} 338.5287
{txt}{space 7}w1BUN {c |}{col 14}{res}{space 2} .0288744{col 26}{space 2} .1371707{col 37}{space 1}    0.21{col 46}{space 3}0.834{col 54}{space 4}-.2440834{col 67}{space 3} .3018322
{txt}{space 7}w1ALP {c |}{col 14}{res}{space 2}-.0068634{col 26}{space 2} .0226621{col 37}{space 1}   -0.30{col 46}{space 3}0.763{col 54}{space 4}-.0519553{col 67}{space 3} .0382285
{txt}{space 2}w1UricAcid {c |}{col 14}{res}{space 2} .2134188{col 26}{space 2} .4124278{col 37}{space 1}    0.52{col 46}{space 3}0.606{col 54}{space 4}-.6072172{col 67}{space 3} 1.034055
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.12e-06{col 26}{space 2} 4.75e-06{col 37}{space 1}    0.66{col 46}{space 3}0.513{col 54}{space 4}-6.33e-06{col 67}{space 3} .0000126
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-150.6212{col 26}{space 2} 97.04077{col 37}{space 1}   -1.55{col 46}{space 3}0.125{col 54}{space 4} -343.768{col 67}{space 3} 42.52562
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. **INTERACTION by Race**
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0505
{txt}{col 49}Largest FMI{col 67}= {res}    0.4390
{txt}{col 49}Complete DF{col 67}= {res}       148
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     19.99
{txt}{col 49}        avg{col 67}= {res}    131.36
{txt}{col 49}        max{col 67}= {res}    145.90
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  144.5{txt}){col 67}= {res}     10.01
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-156.8173{col 28}{space 2} 65.94733{col 39}{space 1}   -2.38{col 48}{space 3}0.019{col 56}{space 4}-287.1825{col 69}{space 3}-26.45213
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-384.9854{col 28}{space 2} 210.5618{col 39}{space 1}   -1.83{col 48}{space 3}0.070{col 56}{space 4}-801.1762{col 69}{space 3} 31.20543
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 141.2915{col 28}{space 2} 95.59468{col 39}{space 1}    1.48{col 48}{space 3}0.142{col 56}{space 4}-47.64358{col 69}{space 3} 330.2265
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-4.953963{col 28}{space 2} 84.26199{col 39}{space 1}   -0.06{col 48}{space 3}0.953{col 56}{space 4}-171.8597{col 69}{space 3} 161.9518
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-5.792269{col 28}{space 2} 3.104299{col 39}{space 1}   -1.87{col 48}{space 3}0.064{col 56}{space 4}-11.92753{col 69}{space 3} .3429943
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-146.4719{col 28}{space 2} 57.29163{col 39}{space 1}   -2.56{col 48}{space 3}0.012{col 56}{space 4} -259.702{col 69}{space 3}-33.24166
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0293617{col 28}{space 2} .0407059{col 39}{space 1}    0.72{col 48}{space 3}0.472{col 56}{space 4}-.0510918{col 69}{space 3} .1098152
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2.519949{col 28}{space 2} 4.154221{col 39}{space 1}    0.61{col 48}{space 3}0.545{col 56}{space 4}-5.690391{col 69}{space 3} 10.73029
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} 10.71996{col 28}{space 2} 155.3967{col 39}{space 1}    0.07{col 48}{space 3}0.946{col 56}{space 4} -313.444{col 69}{space 3}  334.884
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-3079.483{col 28}{space 2} 4259.146{col 39}{space 1}   -0.72{col 48}{space 3}0.471{col 56}{space 4}-11505.81{col 69}{space 3} 5346.844
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 10.32121{col 28}{space 2} 7.390746{col 39}{space 1}    1.40{col 48}{space 3}0.165{col 56}{space 4}-4.304906{col 69}{space 3} 24.94733
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.5951224{col 28}{space 2} 1.172811{col 39}{space 1}   -0.51{col 48}{space 3}0.613{col 56}{space 4}-2.913134{col 69}{space 3}  1.72289
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-3.613574{col 28}{space 2} 20.40919{col 39}{space 1}   -0.18{col 48}{space 3}0.860{col 56}{space 4}-43.94963{col 69}{space 3} 36.72248
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2}  .001689{col 28}{space 2} .0002466{col 39}{space 1}    6.85{col 48}{space 3}0.000{col 56}{space 4} .0012015{col 69}{space 3} .0021764
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  5061.51{col 28}{space 2} 4272.041{col 39}{space 1}    1.18{col 48}{space 3}0.238{col 56}{space 4}-3390.556{col 69}{space 3} 13513.58
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0152
{txt}{col 49}Largest FMI{col 67}= {res}    0.1533
{txt}{col 49}Complete DF{col 67}= {res}       148
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     76.38
{txt}{col 49}        avg{col 67}= {res}    139.17
{txt}{col 49}        max{col 67}= {res}    145.93
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  145.8{txt}){col 67}= {res}     12.40
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} -140.321{col 28}{space 2} 67.37953{col 39}{space 1}   -2.08{col 48}{space 3}0.039{col 56}{space 4}-273.4915{col 69}{space 3}-7.150459
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-327.3126{col 28}{space 2} 215.6893{col 39}{space 1}   -1.52{col 48}{space 3}0.131{col 56}{space 4}-753.5973{col 69}{space 3} 98.97213
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}  114.007{col 28}{space 2} 98.16126{col 39}{space 1}    1.16{col 48}{space 3}0.247{col 56}{space 4}-79.99483{col 69}{space 3} 308.0089
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-97.93548{col 28}{space 2} 84.27188{col 39}{space 1}   -1.16{col 48}{space 3}0.247{col 56}{space 4}-264.5314{col 69}{space 3} 68.66042
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-4.324168{col 28}{space 2} 3.190397{col 39}{space 1}   -1.36{col 48}{space 3}0.177{col 56}{space 4}-10.62952{col 69}{space 3} 1.981186
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-138.9176{col 28}{space 2} 58.88965{col 39}{space 1}   -2.36{col 48}{space 3}0.020{col 56}{space 4} -255.305{col 69}{space 3}-22.53017
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0666438{col 28}{space 2} .0417956{col 39}{space 1}    1.59{col 48}{space 3}0.113{col 56}{space 4}-.0159605{col 69}{space 3} .1492481
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2.856563{col 28}{space 2} 4.269984{col 39}{space 1}    0.67{col 48}{space 3}0.505{col 56}{space 4}-5.582489{col 69}{space 3} 11.29561
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} 34.64506{col 28}{space 2} 134.3906{col 39}{space 1}    0.26{col 48}{space 3}0.797{col 56}{space 4}-232.9955{col 69}{space 3} 302.2856
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2}-1158.846{col 28}{space 2} 4357.405{col 39}{space 1}   -0.27{col 48}{space 3}0.791{col 56}{space 4}-9776.644{col 69}{space 3} 7458.952
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} 12.42319{col 28}{space 2} 7.447849{col 39}{space 1}    1.67{col 48}{space 3}0.097{col 56}{space 4}-2.298911{col 69}{space 3} 27.14529
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.0121788{col 28}{space 2} 1.204515{col 39}{space 1}   -0.01{col 48}{space 3}0.992{col 56}{space 4}-2.392784{col 69}{space 3} 2.368426
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-11.28841{col 28}{space 2}  20.9818{col 39}{space 1}   -0.54{col 48}{space 3}0.591{col 56}{space 4} -52.7559{col 69}{space 3} 30.17908
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021547{col 28}{space 2} .0002537{col 39}{space 1}    8.49{col 48}{space 3}0.000{col 56}{space 4} .0016534{col 69}{space 3} .0026561
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 2646.681{col 28}{space 2} 4368.467{col 39}{space 1}    0.61{col 48}{space 3}0.546{col 56}{space 4}-5992.939{col 69}{space 3}  11286.3
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1Creatinine w1USpecGrav w1BUN w1ALP w1UricAcid ICV_volM2 if sample_final2==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0061
{txt}{col 49}Largest FMI{col 67}= {res}    0.0639
{txt}{col 49}Complete DF{col 67}= {res}       148
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    121.52
{txt}{col 49}        avg{col 67}= {res}    144.00
{txt}{col 49}        max{col 67}= {res}    145.94
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  13{txt},{res}  146.0{txt}){col 67}= {res}      1.09
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.3706

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} .7097223{col 28}{space 2} .8939373{col 39}{space 1}    0.79{col 48}{space 3}0.429{col 56}{space 4}-1.057063{col 69}{space 3} 2.476508
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} .1714671{col 28}{space 2} 2.861075{col 39}{space 1}    0.06{col 48}{space 3}0.952{col 56}{space 4}-5.483054{col 69}{space 3} 5.825989
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} .6099839{col 28}{space 2} 1.303009{col 39}{space 1}    0.47{col 48}{space 3}0.640{col 56}{space 4}-1.965236{col 69}{space 3} 3.185204
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-.1316446{col 28}{space 2} 1.112204{col 39}{space 1}   -0.12{col 48}{space 3}0.906{col 56}{space 4}-2.329933{col 69}{space 3} 2.066644
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}  .050134{col 28}{space 2} .0423982{col 39}{space 1}    1.18{col 48}{space 3}0.239{col 56}{space 4} -.033662{col 69}{space 3}   .13393
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} 1.067768{col 28}{space 2}  .781395{col 39}{space 1}    1.37{col 48}{space 3}0.174{col 56}{space 4}-.4765461{col 69}{space 3} 2.612083
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0009403{col 28}{space 2} .0005547{col 39}{space 1}   -1.70{col 48}{space 3}0.092{col 56}{space 4}-.0020366{col 69}{space 3}  .000156
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0208918{col 28}{space 2} .0567021{col 39}{space 1}    0.37{col 48}{space 3}0.713{col 56}{space 4}-.0911735{col 69}{space 3}  .132957
{txt}{space 2}w1Creatinine {c |}{col 16}{res}{space 2} .8482105{col 28}{space 2} 1.704066{col 39}{space 1}    0.50{col 48}{space 3}0.620{col 56}{space 4}-2.525292{col 69}{space 3} 4.221713
{txt}{space 3}w1USpecGrav {c |}{col 16}{res}{space 2} 25.15049{col 28}{space 2} 56.83514{col 39}{space 1}    0.44{col 48}{space 3}0.659{col 56}{space 4}-87.17696{col 69}{space 3} 137.4779
{txt}{space 9}w1BUN {c |}{col 16}{res}{space 2} .0741195{col 28}{space 2} .0983541{col 39}{space 1}    0.75{col 48}{space 3}0.452{col 56}{space 4}-.1202691{col 69}{space 3}  .268508
{txt}{space 9}w1ALP {c |}{col 16}{res}{space 2}-.0090086{col 28}{space 2} .0159875{col 39}{space 1}   -0.56{col 48}{space 3}0.574{col 56}{space 4}-.0406064{col 69}{space 3} .0225892
{txt}{space 4}w1UricAcid {c |}{col 16}{res}{space 2}-.0259788{col 28}{space 2} .2784517{col 39}{space 1}   -0.09{col 48}{space 3}0.926{col 56}{space 4}-.5762975{col 69}{space 3} .5243399
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 3.02e-06{col 28}{space 2} 3.37e-06{col 39}{space 1}    0.90{col 48}{space 3}0.371{col 56}{space 4}-3.63e-06{col 69}{space 3} 9.67e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-29.52888{col 28}{space 2} 56.98905{col 39}{space 1}   -0.52{col 48}{space 3}0.605{col 56}{space 4}-142.1606{col 69}{space 3} 83.10288
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********MODEL 5: MODEL2+OXIDATIVE STRESS******
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0813
{txt}{col 49}Largest FMI{col 67}= {res}    0.4949
{txt}{col 49}Complete DF{col 67}= {res}        56
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     12.33
{txt}{col 49}        avg{col 67}= {res}     49.59
{txt}{col 49}        max{col 67}= {res}     54.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   53.2{txt}){col 67}= {res}      4.61
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0001

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 2.309218{col 26}{space 2} 80.54678{col 37}{space 1}    0.03{col 46}{space 3}0.977{col 54}{space 4}-159.2911{col 67}{space 3} 163.9095
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 75.95349{col 26}{space 2} 91.94049{col 37}{space 1}    0.83{col 46}{space 3}0.412{col 54}{space 4}-108.3974{col 67}{space 3} 260.3043
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-6.895857{col 26}{space 2} 4.340972{col 37}{space 1}   -1.59{col 46}{space 3}0.118{col 54}{space 4}-15.60342{col 67}{space 3} 1.811703
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-225.4855{col 26}{space 2} 81.27969{col 37}{space 1}   -2.77{col 46}{space 3}0.008{col 54}{space 4}-388.5362{col 67}{space 3}-62.43489
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0455976{col 26}{space 2} .0632353{col 37}{space 1}    0.72{col 46}{space 3}0.474{col 54}{space 4}-.0812622{col 67}{space 3} .1724574
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .3750498{col 26}{space 2} 5.395867{col 37}{space 1}    0.07{col 46}{space 3}0.945{col 54}{space 4}-10.44505{col 67}{space 3} 11.19515
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-3.094804{col 26}{space 2} 6.776269{col 37}{space 1}   -0.46{col 46}{space 3}0.656{col 54}{space 4}-17.81511{col 67}{space 3}  11.6255
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 236.1765{col 26}{space 2}  118.652{col 37}{space 1}    1.99{col 46}{space 3}0.052{col 54}{space 4}-1.699354{col 67}{space 3} 474.0523
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} .2600267{col 26}{space 2} 17.87802{col 37}{space 1}    0.01{col 46}{space 3}0.988{col 54}{space 4}-35.58835{col 67}{space 3}  36.1084
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0011698{col 26}{space 2} .0003743{col 37}{space 1}    3.13{col 46}{space 3}0.003{col 54}{space 4} .0004193{col 67}{space 3} .0019203
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1342.88{col 26}{space 2} 750.4681{col 37}{space 1}    1.79{col 46}{space 3}0.079{col 54}{space 4}-161.7839{col 67}{space 3} 2847.545
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0683
{txt}{col 49}Largest FMI{col 67}= {res}    0.4087
{txt}{col 49}Complete DF{col 67}= {res}        56
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     16.18
{txt}{col 49}        avg{col 67}= {res}     49.31
{txt}{col 49}        max{col 67}= {res}     53.69
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   53.4{txt}){col 67}= {res}      4.99
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-.4935807{col 26}{space 2} 79.72105{col 37}{space 1}   -0.01{col 46}{space 3}0.995{col 54}{space 4}-160.4158{col 67}{space 3} 159.4287
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 3.983069{col 26}{space 2} 92.11036{col 37}{space 1}    0.04{col 46}{space 3}0.966{col 54}{space 4} -180.837{col 67}{space 3} 188.8032
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-5.607216{col 26}{space 2}  4.34813{col 37}{space 1}   -1.29{col 46}{space 3}0.203{col 54}{space 4} -14.3364{col 67}{space 3} 3.121973
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-235.7211{col 26}{space 2} 80.69716{col 37}{space 1}   -2.92{col 46}{space 3}0.005{col 54}{space 4}-397.6184{col 67}{space 3}-73.82387
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0652647{col 26}{space 2} .0628973{col 37}{space 1}    1.04{col 46}{space 3}0.304{col 54}{space 4}-.0609489{col 67}{space 3} .1914784
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-2.911942{col 26}{space 2} 5.387973{col 37}{space 1}   -0.54{col 46}{space 3}0.591{col 54}{space 4}-13.72126{col 67}{space 3} 7.897376
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-6.348695{col 26}{space 2} 6.303915{col 37}{space 1}   -1.01{col 46}{space 3}0.329{col 54}{space 4}-19.70007{col 67}{space 3} 7.002677
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 197.5953{col 26}{space 2} 118.0451{col 37}{space 1}    1.67{col 46}{space 3}0.100{col 54}{space 4}-39.10414{col 67}{space 3} 434.2947
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2}-.8361844{col 26}{space 2} 17.77721{col 37}{space 1}   -0.05{col 46}{space 3}0.963{col 54}{space 4}-36.48838{col 67}{space 3} 34.81601
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0015114{col 26}{space 2} .0003738{col 37}{space 1}    4.04{col 46}{space 3}0.000{col 54}{space 4} .0007615{col 67}{space 3} .0022613
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1501.119{col 26}{space 2} 745.3498{col 37}{space 1}    2.01{col 46}{space 3}0.049{col 54}{space 4} 6.584086{col 67}{space 3} 2995.654
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0227
{txt}{col 49}Largest FMI{col 67}= {res}    0.1867
{txt}{col 49}Complete DF{col 67}= {res}        56
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     33.99
{txt}{col 49}        avg{col 67}= {res}     52.07
{txt}{col 49}        max{col 67}= {res}     54.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   54.0{txt}){col 67}= {res}      1.17
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.3290

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 1.370227{col 26}{space 2}  1.02394{col 37}{space 1}    1.34{col 46}{space 3}0.186{col 54}{space 4}-.6829629{col 67}{space 3} 3.423417
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} .5995378{col 26}{space 2} 1.176447{col 37}{space 1}    0.51{col 46}{space 3}0.612{col 54}{space 4}-1.759146{col 67}{space 3} 2.958222
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0270665{col 26}{space 2} .0552027{col 37}{space 1}    0.49{col 46}{space 3}0.626{col 54}{space 4}-.0836111{col 67}{space 3}  .137744
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}  .088103{col 26}{space 2} 1.034651{col 37}{space 1}    0.09{col 46}{space 3}0.932{col 54}{space 4}-1.986524{col 67}{space 3}  2.16273
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0010327{col 26}{space 2} .0008041{col 37}{space 1}   -1.28{col 46}{space 3}0.205{col 54}{space 4} -.002645{col 67}{space 3} .0005796
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  .053681{col 26}{space 2} .0689232{col 37}{space 1}    0.78{col 46}{space 3}0.439{col 54}{space 4}-.0845014{col 67}{space 3} .1918635
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} .0350445{col 26}{space 2} .0714728{col 37}{space 1}    0.49{col 46}{space 3}0.627{col 54}{space 4}-.1102078{col 67}{space 3} .1802968
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}-.7380766{col 26}{space 2} 1.525932{col 37}{space 1}   -0.48{col 46}{space 3}0.631{col 54}{space 4}-3.797799{col 67}{space 3} 2.321646
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} .0362559{col 26}{space 2} .2284835{col 37}{space 1}    0.16{col 46}{space 3}0.875{col 54}{space 4}-.4218186{col 67}{space 3} .4943303
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.91e-06{col 26}{space 2} 4.79e-06{col 37}{space 1}    0.82{col 46}{space 3}0.418{col 54}{space 4}-5.69e-06{col 67}{space 3} .0000135
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.9513746{col 26}{space 2} 9.609194{col 37}{space 1}   -0.10{col 46}{space 3}0.921{col 54}{space 4}-20.21638{col 67}{space 3} 18.31363
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0085
{txt}{col 49}Largest FMI{col 67}= {res}    0.0544
{txt}{col 49}Complete DF{col 67}= {res}        85
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     74.86
{txt}{col 49}        avg{col 67}= {res}     81.97
{txt}{col 49}        max{col 67}= {res}     83.05
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   83.0{txt}){col 67}= {res}      7.57
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-162.5973{col 26}{space 2} 70.80629{col 37}{space 1}   -2.30{col 46}{space 3}0.024{col 54}{space 4}-303.4268{col 67}{space 3} -21.7677
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-81.18148{col 26}{space 2} 93.81229{col 37}{space 1}   -0.87{col 46}{space 3}0.389{col 54}{space 4}-267.7717{col 67}{space 3} 105.4088
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.133418{col 26}{space 2} 4.286961{col 37}{space 1}   -0.26{col 46}{space 3}0.792{col 54}{space 4}-9.659974{col 67}{space 3} 7.393139
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-94.38516{col 26}{space 2} 79.90172{col 37}{space 1}   -1.18{col 46}{space 3}0.241{col 54}{space 4}-253.3052{col 67}{space 3} 64.53484
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0625553{col 26}{space 2}  .055488{col 37}{space 1}    1.13{col 46}{space 3}0.263{col 54}{space 4}-.0478077{col 67}{space 3} .1729183
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 9.989599{col 26}{space 2} 5.401111{col 37}{space 1}    1.85{col 46}{space 3}0.068{col 54}{space 4}-.7530146{col 67}{space 3} 20.73221
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2} .6761437{col 26}{space 2} 3.368228{col 37}{space 1}    0.20{col 46}{space 3}0.841{col 54}{space 4}-6.033913{col 67}{space 3}   7.3862
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}  137.921{col 26}{space 2} 139.1635{col 37}{space 1}    0.99{col 46}{space 3}0.325{col 54}{space 4}-138.8673{col 67}{space 3} 414.7094
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} -7.44841{col 26}{space 2} 16.85033{col 37}{space 1}   -0.44{col 46}{space 3}0.660{col 54}{space 4}-40.98374{col 67}{space 3} 26.08692
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019667{col 26}{space 2} .0003151{col 37}{space 1}    6.24{col 46}{space 3}0.000{col 54}{space 4} .0013399{col 67}{space 3} .0025935
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 586.0086{col 26}{space 2} 829.3514{col 37}{space 1}    0.71{col 46}{space 3}0.482{col 54}{space 4}-1063.527{col 67}{space 3} 2235.544
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0056
{txt}{col 49}Largest FMI{col 67}= {res}    0.0405
{txt}{col 49}Complete DF{col 67}= {res}        85
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     77.58
{txt}{col 49}        avg{col 67}= {res}     82.41
{txt}{col 49}        max{col 67}= {res}     83.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   83.0{txt}){col 67}= {res}      9.79
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-139.8136{col 26}{space 2} 72.04969{col 37}{space 1}   -1.94{col 46}{space 3}0.056{col 54}{space 4}-283.1159{col 67}{space 3} 3.488655
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-209.7056{col 26}{space 2} 95.41163{col 37}{space 1}   -2.20{col 46}{space 3}0.031{col 54}{space 4}-399.4735{col 67}{space 3}-19.93762
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}  1.55369{col 26}{space 2} 4.361686{col 37}{space 1}    0.36{col 46}{space 3}0.723{col 54}{space 4}-7.121438{col 67}{space 3} 10.22882
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-57.83545{col 26}{space 2} 81.30187{col 37}{space 1}   -0.71{col 46}{space 3}0.479{col 54}{space 4}-219.5398{col 67}{space 3} 103.8689
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0957126{col 26}{space 2} .0564644{col 37}{space 1}    1.70{col 46}{space 3}0.094{col 54}{space 4}-.0165925{col 67}{space 3} .2080177
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}  12.0177{col 26}{space 2} 5.496106{col 37}{space 1}    2.19{col 46}{space 3}0.032{col 54}{space 4} 1.086158{col 67}{space 3} 22.94924
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-1.269844{col 26}{space 2} 3.360135{col 37}{space 1}   -0.38{col 46}{space 3}0.706{col 54}{space 4}-7.954624{col 67}{space 3} 5.414937
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2} 31.26356{col 26}{space 2} 141.7092{col 37}{space 1}    0.22{col 46}{space 3}0.826{col 54}{space 4}-250.5937{col 67}{space 3} 313.1208
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} 7.419679{col 26}{space 2} 17.25058{col 37}{space 1}    0.43{col 46}{space 3}0.668{col 54}{space 4}-26.92655{col 67}{space 3} 41.76591
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0026116{col 26}{space 2} .0003206{col 37}{space 1}    8.15{col 46}{space 3}0.000{col 54}{space 4} .0019741{col 67}{space 3} .0032492
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 310.6675{col 26}{space 2} 844.0984{col 37}{space 1}    0.37{col 46}{space 3}0.714{col 54}{space 4}-1368.207{col 67}{space 3} 1989.542
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0027
{txt}{col 49}Largest FMI{col 67}= {res}    0.0272
{txt}{col 49}Complete DF{col 67}= {res}        85
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     79.85
{txt}{col 49}        avg{col 67}= {res}     82.76
{txt}{col 49}        max{col 67}= {res}     83.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  10{txt},{res}   83.1{txt}){col 67}= {res}      0.72
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.7013

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .9321029{col 26}{space 2} 1.018852{col 37}{space 1}    0.91{col 46}{space 3}0.363{col 54}{space 4}-1.094328{col 67}{space 3} 2.958534
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} -.658704{col 26}{space 2} 1.349191{col 37}{space 1}   -0.49{col 46}{space 3}0.627{col 54}{space 4}-3.342161{col 67}{space 3} 2.024753
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0667643{col 26}{space 2} .0616807{col 37}{space 1}    1.08{col 46}{space 3}0.282{col 54}{space 4}-.0559149{col 67}{space 3} .1894435
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.850578{col 26}{space 2} 1.149697{col 37}{space 1}    1.61{col 46}{space 3}0.111{col 54}{space 4}-.4360961{col 67}{space 3} 4.137252
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0005177{col 26}{space 2} .0007983{col 37}{space 1}   -0.65{col 46}{space 3}0.518{col 54}{space 4}-.0021056{col 67}{space 3} .0010701
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0621805{col 26}{space 2} .0777034{col 37}{space 1}    0.80{col 46}{space 3}0.426{col 54}{space 4}-.0923674{col 67}{space 3} .2167284
{txt}{space 4}w1TotalD {c |}{col 14}{res}{space 2}-.0037842{col 26}{space 2} .0478222{col 37}{space 1}   -0.08{col 46}{space 3}0.937{col 54}{space 4}-.0989561{col 67}{space 3} .0913876
{txt}{space 3}w1Albumin {c |}{col 14}{res}{space 2}  1.83407{col 26}{space 2} 2.002507{col 37}{space 1}    0.92{col 46}{space 3}0.362{col 54}{space 4}-2.148797{col 67}{space 3} 5.816936
{txt}{space 2}w1EosinPct {c |}{col 14}{res}{space 2} .1335969{col 26}{space 2} .2392239{col 37}{space 1}    0.56{col 46}{space 3}0.578{col 54}{space 4}-.3422052{col 67}{space 3} .6093989
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.75e-06{col 26}{space 2} 4.53e-06{col 37}{space 1}    0.83{col 46}{space 3}0.411{col 54}{space 4}-5.27e-06{col 67}{space 3} .0000128
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-15.73248{col 26}{space 2} 11.93393{col 37}{space 1}   -1.32{col 46}{space 3}0.191{col 54}{space 4}-39.46839{col 67}{space 3} 8.003422
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. **********INTERACTION by Race***************
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0225
{txt}{col 49}Largest FMI{col 67}= {res}    0.2109
{txt}{col 49}Complete DF{col 67}= {res}       150
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     56.21
{txt}{col 49}        avg{col 67}= {res}    140.09
{txt}{col 49}        max{col 67}= {res}    148.01
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  147.7{txt}){col 67}= {res}     11.54
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-141.1489{col 28}{space 2}  62.3245{col 39}{space 1}   -2.26{col 48}{space 3}0.025{col 56}{space 4}-264.3097{col 69}{space 3}-17.98814
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-405.3498{col 28}{space 2} 209.5812{col 39}{space 1}   -1.93{col 48}{space 3}0.055{col 56}{space 4}-819.5534{col 69}{space 3} 8.853669
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 140.9647{col 28}{space 2} 93.83577{col 39}{space 1}    1.50{col 48}{space 3}0.135{col 56}{space 4}-44.46904{col 69}{space 3} 326.3985
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-8.565918{col 28}{space 2} 66.02059{col 39}{space 1}   -0.13{col 48}{space 3}0.897{col 56}{space 4}-139.0318{col 69}{space 3}    121.9
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-4.680746{col 28}{space 2} 2.972368{col 39}{space 1}   -1.57{col 48}{space 3}0.117{col 56}{space 4}-10.55457{col 69}{space 3} 1.193082
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-161.6891{col 28}{space 2} 56.12592{col 39}{space 1}   -2.88{col 48}{space 3}0.005{col 56}{space 4}-272.6015{col 69}{space 3}-50.77666
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0484543{col 28}{space 2} .0408627{col 39}{space 1}    1.19{col 48}{space 3}0.238{col 56}{space 4} -.032298{col 69}{space 3} .1292066
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 4.754365{col 28}{space 2} 3.763115{col 39}{space 1}    1.26{col 48}{space 3}0.208{col 56}{space 4}-2.682093{col 69}{space 3} 12.19082
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2}-.1487366{col 28}{space 2} 2.970861{col 39}{space 1}   -0.05{col 48}{space 3}0.960{col 56}{space 4}-6.099596{col 69}{space 3} 5.802122
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 177.8222{col 28}{space 2}  92.2297{col 39}{space 1}    1.93{col 48}{space 3}0.056{col 56}{space 4}-4.435015{col 69}{space 3} 360.0794
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2}-6.646752{col 28}{space 2}  12.2307{col 39}{space 1}   -0.54{col 48}{space 3}0.588{col 56}{space 4} -30.8262{col 69}{space 3}  17.5327
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0016397{col 28}{space 2} .0002368{col 39}{space 1}    6.92{col 48}{space 3}0.000{col 56}{space 4} .0011718{col 69}{space 3} .0021076
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1166.625{col 28}{space 2} 571.3517{col 39}{space 1}    2.04{col 48}{space 3}0.043{col 56}{space 4}  37.5475{col 69}{space 3} 2295.703
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0125
{txt}{col 49}Largest FMI{col 67}= {res}    0.0977
{txt}{col 49}Complete DF{col 67}= {res}       150
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    104.29
{txt}{col 49}        avg{col 67}= {res}    143.58
{txt}{col 49}        max{col 67}= {res}    148.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  147.9{txt}){col 67}= {res}     13.45
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-112.7264{col 28}{space 2} 64.62516{col 39}{space 1}   -1.74{col 48}{space 3}0.083{col 56}{space 4}-240.4347{col 69}{space 3}  14.9819
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-374.7742{col 28}{space 2} 216.6565{col 39}{space 1}   -1.73{col 48}{space 3}0.086{col 56}{space 4}-802.9334{col 69}{space 3} 53.38496
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 114.9894{col 28}{space 2} 97.22541{col 39}{space 1}    1.18{col 48}{space 3}0.239{col 56}{space 4} -77.1419{col 69}{space 3} 307.1208
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-112.5385{col 28}{space 2} 68.44604{col 39}{space 1}   -1.64{col 48}{space 3}0.102{col 56}{space 4}-247.7983{col 69}{space 3} 22.72133
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-3.090001{col 28}{space 2} 3.084942{col 39}{space 1}   -1.00{col 48}{space 3}0.318{col 56}{space 4}-9.186473{col 69}{space 3}  3.00647
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-152.2838{col 28}{space 2}  58.2108{col 39}{space 1}   -2.62{col 48}{space 3}0.010{col 56}{space 4}-267.3179{col 69}{space 3}-37.24973
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0773633{col 28}{space 2} .0422975{col 39}{space 1}    1.83{col 48}{space 3}0.069{col 56}{space 4}-.0062224{col 69}{space 3} .1609491
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2}  4.32386{col 28}{space 2} 3.897637{col 39}{space 1}    1.11{col 48}{space 3}0.269{col 56}{space 4}-3.378351{col 69}{space 3} 12.02607
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2}-2.501039{col 28}{space 2} 2.901624{col 39}{space 1}   -0.86{col 48}{space 3}0.391{col 56}{space 4}-8.254879{col 69}{space 3}   3.2528
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} 111.1831{col 28}{space 2} 95.57404{col 39}{space 1}    1.16{col 48}{space 3}0.247{col 56}{space 4} -77.6826{col 69}{space 3} 300.0488
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} 1.476301{col 28}{space 2} 12.73336{col 39}{space 1}    0.12{col 48}{space 3}0.908{col 56}{space 4} -23.7029{col 69}{space 3}  26.6555
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021498{col 28}{space 2} .0002454{col 39}{space 1}    8.76{col 48}{space 3}0.000{col 56}{space 4} .0016648{col 69}{space 3} .0026347
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1052.563{col 28}{space 2} 591.6938{col 39}{space 1}    1.78{col 48}{space 3}0.077{col 56}{space 4}-116.6978{col 69}{space 3} 2221.824
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI  w1TotalD w1Albumin w1EosinPct ICV_volM2 if sample_final2==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0052
{txt}{col 49}Largest FMI{col 67}= {res}    0.0599
{txt}{col 49}Complete DF{col 67}= {res}       150
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    125.10
{txt}{col 49}        avg{col 67}= {res}    146.19
{txt}{col 49}        max{col 67}= {res}    148.02
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  12{txt},{res}  148.0{txt}){col 67}= {res}      1.14
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.3329

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} .9384552{col 28}{space 2} .8552994{col 39}{space 1}    1.10{col 48}{space 3}0.274{col 56}{space 4}  -.75172{col 69}{space 3}  2.62863
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} .6870004{col 28}{space 2} 2.865143{col 39}{space 1}    0.24{col 48}{space 3}0.811{col 56}{space 4}-4.974976{col 69}{space 3} 6.348977
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} .4114173{col 28}{space 2} 1.286671{col 39}{space 1}    0.32{col 48}{space 3}0.750{col 56}{space 4}-2.131203{col 69}{space 3} 2.954038
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} .0731734{col 28}{space 2} .9055375{col 39}{space 1}    0.08{col 48}{space 3}0.936{col 56}{space 4}-1.716279{col 69}{space 3} 1.862626
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0534559{col 28}{space 2}  .040771{col 39}{space 1}    1.31{col 48}{space 3}0.192{col 56}{space 4}-.0271129{col 69}{space 3} .1340246
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} 1.072973{col 28}{space 2}  .769992{col 39}{space 1}    1.39{col 48}{space 3}0.166{col 56}{space 4}-.4486272{col 69}{space 3} 2.594574
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0007991{col 28}{space 2} .0005598{col 39}{space 1}   -1.43{col 48}{space 3}0.156{col 56}{space 4}-.0019054{col 69}{space 3} .0003072
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0521946{col 28}{space 2} .0516313{col 39}{space 1}    1.01{col 48}{space 3}0.314{col 56}{space 4} -.049836{col 69}{space 3} .1542251
{txt}{space 6}w1TotalD {c |}{col 16}{res}{space 2} .0092121{col 28}{space 2} .0377024{col 39}{space 1}    0.24{col 48}{space 3}0.807{col 56}{space 4} -.065405{col 69}{space 3} .0838292
{txt}{space 5}w1Albumin {c |}{col 16}{res}{space 2} .6517833{col 28}{space 2} 1.265677{col 39}{space 1}    0.51{col 48}{space 3}0.607{col 56}{space 4}-1.849349{col 69}{space 3} 3.152916
{txt}{space 4}w1EosinPct {c |}{col 16}{res}{space 2} .1468579{col 28}{space 2} .1657153{col 39}{space 1}    0.89{col 48}{space 3}0.377{col 56}{space 4}-.1806165{col 69}{space 3} .4743322
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 2.94e-06{col 28}{space 2} 3.25e-06{col 39}{space 1}    0.91{col 48}{space 3}0.367{col 56}{space 4}-3.48e-06{col 69}{space 3} 9.36e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} -8.47381{col 28}{space 2} 7.835496{col 39}{space 1}   -1.08{col 48}{space 3}0.281{col 56}{space 4}-23.95775{col 69}{space 3} 7.010131
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. ***********MODEL 6: MODEL 2+lifestyle/health-related factors*******  
. 
. //AFRICAN-AMERICAN//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0150
{txt}{col 49}Largest FMI{col 67}= {res}    0.0528
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     50.80
{txt}{col 49}        avg{col 67}= {res}     54.26
{txt}{col 49}        max{col 67}= {res}     55.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   55.0{txt}){col 67}= {res}      6.16
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 19.93781{col 26}{space 2} 75.93833{col 37}{space 1}    0.26{col 46}{space 3}0.794{col 54}{space 4}-132.2556{col 67}{space 3} 172.1312
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 119.4362{col 26}{space 2} 87.43058{col 37}{space 1}    1.37{col 46}{space 3}0.177{col 54}{space 4}-55.77449{col 67}{space 3} 294.6469
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-8.862388{col 26}{space 2} 4.139197{col 37}{space 1}   -2.14{col 46}{space 3}0.037{col 54}{space 4}-17.15871{col 67}{space 3}-.5660685
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-248.7042{col 26}{space 2} 78.10688{col 37}{space 1}   -3.18{col 46}{space 3}0.002{col 54}{space 4}-405.2634{col 67}{space 3}-92.14498
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0457975{col 26}{space 2} .0588247{col 37}{space 1}    0.78{col 46}{space 3}0.440{col 54}{space 4}-.0721524{col 67}{space 3} .1637474
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-1.596521{col 26}{space 2} 5.159467{col 37}{space 1}   -0.31{col 46}{space 3}0.758{col 54}{space 4}-11.93808{col 67}{space 3} 8.745037
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-162.8414{col 26}{space 2} 70.53284{col 37}{space 1}   -2.31{col 46}{space 3}0.025{col 54}{space 4}-304.4555{col 67}{space 3}-21.22735
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-78.78655{col 26}{space 2} 41.44908{col 37}{space 1}   -1.90{col 46}{space 3}0.063{col 54}{space 4} -161.866{col 67}{space 3} 4.292949
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0013377{col 26}{space 2} .0003685{col 37}{space 1}    3.63{col 46}{space 3}0.001{col 54}{space 4}  .000599{col 67}{space 3} .0020763
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2400.579{col 26}{space 2} 465.7878{col 37}{space 1}    5.15{col 46}{space 3}0.000{col 54}{space 4} 1467.143{col 67}{space 3} 3334.016
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1 & Race==2
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0130
{txt}{col 49}Largest FMI{col 67}= {res}    0.0470
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     51.40
{txt}{col 49}        avg{col 67}= {res}     54.39
{txt}{col 49}        max{col 67}= {res}     55.07
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   55.0{txt}){col 67}= {res}      6.08
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-1.111244{col 26}{space 2} 76.75595{col 37}{space 1}   -0.01{col 46}{space 3}0.989{col 54}{space 4}-154.9395{col 67}{space 3}  152.717
{txt}{space 9}Sex {c |}{col 14}{res}{space 2} 44.18365{col 26}{space 2} 88.41861{col 37}{space 1}    0.50{col 46}{space 3}0.619{col 54}{space 4}-133.0073{col 67}{space 3} 221.3746
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-7.537321{col 26}{space 2} 4.182185{col 37}{space 1}   -1.80{col 46}{space 3}0.077{col 54}{space 4}-15.91941{col 67}{space 3} .8447687
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-248.6738{col 26}{space 2} 78.89458{col 37}{space 1}   -3.15{col 46}{space 3}0.003{col 54}{space 4}-406.8016{col 67}{space 3}  -90.546
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0774382{col 26}{space 2} .0594441{col 37}{space 1}    1.30{col 46}{space 3}0.198{col 54}{space 4}-.0417477{col 67}{space 3} .1966241
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2}-4.580977{col 26}{space 2} 5.211035{col 37}{space 1}   -0.88{col 46}{space 3}0.383{col 54}{space 4}-15.02518{col 67}{space 3} 5.863224
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-147.9294{col 26}{space 2} 71.13087{col 37}{space 1}   -2.08{col 46}{space 3}0.043{col 54}{space 4}-290.7033{col 67}{space 3}-5.155517
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-56.37396{col 26}{space 2} 41.90792{col 37}{space 1}   -1.35{col 46}{space 3}0.184{col 54}{space 4}-140.3723{col 67}{space 3} 27.62433
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0016186{col 26}{space 2} .0003723{col 37}{space 1}    4.35{col 46}{space 3}0.000{col 54}{space 4} .0008723{col 67}{space 3} .0023648
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2354.714{col 26}{space 2} 471.0007{col 37}{space 1}    5.00{col 46}{space 3}0.000{col 54}{space 4} 1410.835{col 67}{space 3} 3298.593
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1 & Race==2 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        67
{txt}{col 49}Average RVI{col 67}= {res}    0.0027
{txt}{col 49}Largest FMI{col 67}= {res}    0.0118
{txt}{col 49}Complete DF{col 67}= {res}        57
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     54.46
{txt}{col 49}        avg{col 67}= {res}     54.99
{txt}{col 49}        max{col 67}= {res}     55.10
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   55.1{txt}){col 67}= {res}      1.94
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0651

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} 1.672095{col 26}{space 2} .9606003{col 37}{space 1}    1.74{col 46}{space 3}0.087{col 54}{space 4}-.2529467{col 67}{space 3} 3.597137
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}  .654228{col 26}{space 2} 1.107658{col 37}{space 1}    0.59{col 46}{space 3}0.557{col 54}{space 4}-1.565488{col 67}{space 3} 2.873945
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0346818{col 26}{space 2} .0522817{col 37}{space 1}    0.66{col 46}{space 3}0.510{col 54}{space 4}-.0700908{col 67}{space 3} .1394544
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-.0069924{col 26}{space 2} .9854927{col 37}{space 1}   -0.01{col 46}{space 3}0.994{col 54}{space 4}-1.981894{col 67}{space 3} 1.967909
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0011274{col 26}{space 2} .0007395{col 37}{space 1}   -1.52{col 46}{space 3}0.133{col 54}{space 4}-.0026095{col 67}{space 3} .0003548
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0884207{col 26}{space 2} .0651351{col 37}{space 1}    1.36{col 46}{space 3}0.180{col 54}{space 4}-.0421099{col 67}{space 3} .2189513
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} .7860412{col 26}{space 2} .8762569{col 37}{space 1}    0.90{col 46}{space 3}0.374{col 54}{space 4}-.9704107{col 67}{space 3} 2.542493
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-1.005078{col 26}{space 2} .5235133{col 37}{space 1}   -1.92{col 46}{space 3}0.060{col 54}{space 4}-2.054215{col 67}{space 3} .0440582
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 5.44e-06{col 26}{space 2} 4.65e-06{col 37}{space 1}    1.17{col 46}{space 3}0.248{col 54}{space 4}-3.89e-06{col 67}{space 3} .0000148
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-5.236261{col 26}{space 2} 5.900927{col 37}{space 1}   -0.89{col 46}{space 3}0.379{col 54}{space 4}-17.06152{col 67}{space 3}    6.589
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. //WHITES//
. 
. use finaldata_imputed_final,clear
{txt}
{com}. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0037
{txt}{col 49}Largest FMI{col 67}= {res}    0.0221
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     81.57
{txt}{col 49}        avg{col 67}= {res}     83.67
{txt}{col 49}        max{col 67}= {res}     84.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.0{txt}){col 67}= {res}      8.40
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippo~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-160.8951{col 26}{space 2} 70.68714{col 37}{space 1}   -2.28{col 46}{space 3}0.025{col 54}{space 4} -301.465{col 67}{space 3}-20.32515
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-56.12398{col 26}{space 2} 92.40839{col 37}{space 1}   -0.61{col 46}{space 3}0.545{col 54}{space 4}-239.8935{col 67}{space 3} 127.6456
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2}-1.066883{col 26}{space 2} 4.283174{col 37}{space 1}   -0.25{col 46}{space 3}0.804{col 54}{space 4}-9.584389{col 67}{space 3} 7.450623
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2}-78.69411{col 26}{space 2} 82.28505{col 37}{space 1}   -0.96{col 46}{space 3}0.342{col 54}{space 4}-242.3317{col 67}{space 3} 84.94352
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .0440509{col 26}{space 2}  .055382{col 37}{space 1}    0.80{col 46}{space 3}0.429{col 54}{space 4}-.0660953{col 67}{space 3} .1541971
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 9.082712{col 26}{space 2} 5.194017{col 37}{space 1}    1.75{col 46}{space 3}0.084{col 54}{space 4} -1.24615{col 67}{space 3} 19.41157
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 67.72412{col 26}{space 2}  97.3007{col 37}{space 1}    0.70{col 46}{space 3}0.488{col 54}{space 4}-125.8531{col 67}{space 3} 261.3014
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-2.897696{col 26}{space 2} 44.16078{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4} -90.7157{col 67}{space 3} 84.92031
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0019729{col 26}{space 2} .0003125{col 37}{space 1}    6.31{col 46}{space 3}0.000{col 54}{space 4} .0013514{col 67}{space 3} .0025944
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1170.859{col 26}{space 2} 500.4826{col 37}{space 1}    2.34{col 46}{space 3}0.022{col 54}{space 4} 175.6012{col 67}{space 3} 2166.116
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1 & Race==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0026
{txt}{col 49}Largest FMI{col 67}= {res}    0.0226
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     81.50
{txt}{col 49}        avg{col 67}= {res}     83.76
{txt}{col 49}        max{col 67}= {res}     84.06
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   84.1{txt}){col 67}= {res}     11.09
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hipp~s{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2}-141.9562{col 26}{space 2} 71.51526{col 37}{space 1}   -1.98{col 46}{space 3}0.050{col 54}{space 4}-284.1708{col 67}{space 3} .2584787
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-197.2273{col 26}{space 2} 93.44347{col 37}{space 1}   -2.11{col 46}{space 3}0.038{col 54}{space 4}-383.0495{col 67}{space 3}-11.40518
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} 1.525537{col 26}{space 2} 4.335239{col 37}{space 1}    0.35{col 46}{space 3}0.726{col 54}{space 4}-7.095492{col 67}{space 3} 10.14657
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} -65.7863{col 26}{space 2} 83.23254{col 37}{space 1}   -0.79{col 46}{space 3}0.432{col 54}{space 4}-231.3046{col 67}{space 3} 99.73196
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2} .1028118{col 26}{space 2} .0558925{col 37}{space 1}    1.84{col 46}{space 3}0.069{col 54}{space 4}-.0083382{col 67}{space 3} .2139618
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} 11.60981{col 26}{space 2} 5.257525{col 37}{space 1}    2.21{col 46}{space 3}0.030{col 54}{space 4} 1.154653{col 67}{space 3} 22.06497
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2} 19.98699{col 26}{space 2} 98.50984{col 37}{space 1}    0.20{col 46}{space 3}0.840{col 54}{space 4}-175.9983{col 67}{space 3} 215.9723
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-34.93767{col 26}{space 2} 44.69341{col 37}{space 1}   -0.78{col 46}{space 3}0.437{col 54}{space 4}-123.8145{col 67}{space 3} 53.93914
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} .0025993{col 26}{space 2} .0003162{col 37}{space 1}    8.22{col 46}{space 3}0.000{col 54}{space 4} .0019704{col 67}{space 3} .0032282
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 522.7933{col 26}{space 2} 506.7082{col 37}{space 1}    1.03{col 46}{space 3}0.305{col 54}{space 4}-484.8511{col 67}{space 3} 1530.438
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume LnNFLw3 Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1 & Race==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}        96
{txt}{col 49}Average RVI{col 67}= {res}    0.0160
{txt}{col 49}Largest FMI{col 67}= {res}    0.1297
{txt}{col 49}Complete DF{col 67}= {res}        86
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}     58.27
{txt}{col 49}        avg{col 67}= {res}     81.31
{txt}{col 49}        max{col 67}= {res}     84.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}   9{txt},{res}   83.9{txt}){col 67}= {res}      0.74
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.6733

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_V~e{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}LnNFLw3 {c |}{col 14}{res}{space 2} .8901593{col 26}{space 2} 1.015709{col 37}{space 1}    0.88{col 46}{space 3}0.383{col 54}{space 4}-1.129679{col 67}{space 3} 2.909997
{txt}{space 9}Sex {c |}{col 14}{res}{space 2}-.4669943{col 26}{space 2} 1.330442{col 37}{space 1}   -0.35{col 46}{space 3}0.726{col 54}{space 4} -3.11295{col 67}{space 3} 2.178961
{txt}{space 7}w1Age {c |}{col 14}{res}{space 2} .0569055{col 26}{space 2} .0616339{col 37}{space 1}    0.92{col 46}{space 3}0.359{col 54}{space 4}-.0656637{col 67}{space 3} .1794747
{txt}{space 8}Race {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}PovStat {c |}{col 14}{res}{space 2} 1.695828{col 26}{space 2} 1.181829{col 37}{space 1}    1.43{col 46}{space 3}0.155{col 54}{space 4}-.6543754{col 67}{space 3} 4.046032
{txt}{space 1}TIME_V1SCAN {c |}{col 14}{res}{space 2}-.0005387{col 26}{space 2} .0007934{col 37}{space 1}   -0.68{col 46}{space 3}0.499{col 54}{space 4}-.0021164{col 67}{space 3} .0010391
{txt}{space 7}w1BMI {c |}{col 14}{res}{space 2} .0267428{col 26}{space 2} .0747527{col 37}{space 1}    0.36{col 46}{space 3}0.721{col 54}{space 4}-.1219168{col 67}{space 3} .1754025
{txt}{space 1}w1currdrugs {c |}{col 14}{res}{space 2}-.8709826{col 26}{space 2} 1.475597{col 37}{space 1}   -0.59{col 46}{space 3}0.557{col 54}{space 4}-3.824422{col 67}{space 3} 2.082457
{txt}{space 7}w1SRH {c |}{col 14}{res}{space 2}-.3477531{col 26}{space 2} .6349672{col 37}{space 1}   -0.55{col 46}{space 3}0.585{col 54}{space 4}-1.610459{col 67}{space 3} .9149528
{txt}{space 3}ICV_volM2 {c |}{col 14}{res}{space 2} 3.45e-06{col 26}{space 2} 4.49e-06{col 37}{space 1}    0.77{col 46}{space 3}0.444{col 54}{space 4}-5.48e-06{col 67}{space 3} .0000124
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -4.55297{col 26}{space 2} 7.208257{col 37}{space 1}   -0.63{col 46}{space 3}0.529{col 54}{space 4}-18.88819{col 67}{space 3} 9.782248
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. ******************INTERACTION by Race***********************
. 
. 
. 
. //ANALYSIS B//
. mi estimate: reg Left_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0021
{txt}{col 49}Largest FMI{col 67}= {res}    0.0169
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    145.18
{txt}{col 49}        avg{col 67}= {res}    148.63
{txt}{col 49}        max{col 67}= {res}    149.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}     12.55
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Left_Hippoca~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-141.7513{col 28}{space 2} 62.50147{col 39}{space 1}   -2.27{col 48}{space 3}0.025{col 56}{space 4}-265.2549{col 69}{space 3} -18.2476
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-414.8302{col 28}{space 2} 205.1136{col 39}{space 1}   -2.02{col 48}{space 3}0.045{col 56}{space 4}-820.1377{col 69}{space 3}-9.522794
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 148.4327{col 28}{space 2} 94.03451{col 39}{space 1}    1.58{col 48}{space 3}0.117{col 56}{space 4}-37.38068{col 69}{space 3} 334.2461
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2} 5.246742{col 28}{space 2} 64.71788{col 39}{space 1}    0.08{col 48}{space 3}0.935{col 56}{space 4}-122.6366{col 69}{space 3} 133.1301
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2}-5.289736{col 28}{space 2} 2.981576{col 39}{space 1}   -1.77{col 48}{space 3}0.078{col 56}{space 4}-11.18139{col 69}{space 3} .6019151
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-170.2923{col 28}{space 2} 57.29563{col 39}{space 1}   -2.97{col 48}{space 3}0.003{col 56}{space 4}-283.5095{col 69}{space 3}-57.07518
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0415331{col 28}{space 2} .0404116{col 39}{space 1}    1.03{col 48}{space 3}0.306{col 56}{space 4}-.0383218{col 69}{space 3}  .121388
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 2.721197{col 28}{space 2} 3.653124{col 39}{space 1}    0.74{col 48}{space 3}0.458{col 56}{space 4}-4.497466{col 69}{space 3}  9.93986
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-45.82645{col 28}{space 2} 59.50186{col 39}{space 1}   -0.77{col 48}{space 3}0.442{col 56}{space 4}-163.4283{col 69}{space 3} 71.77538
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-36.21542{col 28}{space 2} 30.60267{col 39}{space 1}   -1.18{col 48}{space 3}0.239{col 56}{space 4}-96.68692{col 69}{space 3} 24.25608
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2}  .001673{col 28}{space 2} .0002378{col 39}{space 1}    7.03{col 48}{space 3}0.000{col 56}{space 4} .0012031{col 69}{space 3} .0021429
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 2055.745{col 28}{space 2} 352.6015{col 39}{space 1}    5.83{col 48}{space 3}0.000{col 56}{space 4} 1358.996{col 69}{space 3} 2752.494
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. mi estimate: reg Right_Hippocampus c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0036
{txt}{col 49}Largest FMI{col 67}= {res}    0.0291
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    140.79
{txt}{col 49}        avg{col 67}= {res}    148.23
{txt}{col 49}        max{col 67}= {res}    149.03
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}     15.16
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.0000

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}Right_Hippoc~s{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2}-116.0375{col 28}{space 2} 64.02369{col 39}{space 1}   -1.81{col 48}{space 3}0.072{col 56}{space 4}-242.5493{col 69}{space 3} 10.47419
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2}-356.2282{col 28}{space 2} 210.1231{col 39}{space 1}   -1.70{col 48}{space 3}0.092{col 56}{space 4}-771.4354{col 69}{space 3} 58.97912
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} 119.9964{col 28}{space 2} 96.32157{col 39}{space 1}    1.25{col 48}{space 3}0.215{col 56}{space 4}-70.33638{col 69}{space 3} 310.3291
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}-97.62209{col 28}{space 2} 66.30947{col 39}{space 1}   -1.47{col 48}{space 3}0.143{col 56}{space 4}-228.6511{col 69}{space 3} 33.40695
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} -3.82984{col 28}{space 2}  3.05384{col 39}{space 1}   -1.25{col 48}{space 3}0.212{col 56}{space 4} -9.86428{col 69}{space 3} 2.204599
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2}-166.5269{col 28}{space 2} 58.68468{col 39}{space 1}   -2.84{col 48}{space 3}0.005{col 56}{space 4}-282.4887{col 69}{space 3}-50.56501
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2} .0837417{col 28}{space 2} .0414244{col 39}{space 1}    2.02{col 48}{space 3}0.045{col 56}{space 4} .0018842{col 69}{space 3} .1655992
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} 3.067963{col 28}{space 2} 3.741393{col 39}{space 1}    0.82{col 48}{space 3}0.414{col 56}{space 4}-4.325105{col 69}{space 3} 10.46103
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2}-61.40198{col 28}{space 2} 61.31691{col 39}{space 1}   -1.00{col 48}{space 3}0.318{col 56}{space 4}-182.6229{col 69}{space 3}  59.8189
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-50.24106{col 28}{space 2} 31.36095{col 39}{space 1}   -1.60{col 48}{space 3}0.111{col 56}{space 4}-112.2115{col 69}{space 3} 11.72934
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} .0021758{col 28}{space 2} .0002436{col 39}{space 1}    8.93{col 48}{space 3}0.000{col 56}{space 4} .0016945{col 69}{space 3} .0026572
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 1624.432{col 28}{space 2} 361.1352{col 39}{space 1}    4.50{col 48}{space 3}0.000{col 56}{space 4} 910.8219{col 69}{space 3} 2338.043
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. //ANALYSIS C//
. mi estimate: reg LnLesion_Volume c.LnNFLw3##Race Sex w1Age Race PovStat TIME_V1SCAN w1BMI w1currdrugs w1SRH ICV_volM2 if sample_final2==1 
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}Linear regression{col 49}Number of obs{col 67}= {res}       163
{txt}{col 49}Average RVI{col 67}= {res}    0.0072
{txt}{col 49}Largest FMI{col 67}= {res}    0.0756
{txt}{col 49}Complete DF{col 67}= {res}       151
{txt}DF adjustment:{ralign 15: {res:Small sample}}{col 49}DF:     min{col 67}= {res}    117.18
{txt}{col 49}        avg{col 67}= {res}    146.21
{txt}{col 49}        max{col 67}= {res}    149.04
{txt}Model F test:{ralign 16: {res:Equal FMI}}{col 49}F({res}  11{txt},{res}  149.0{txt}){col 67}= {res}      1.33
{txt}Within VCE type: {ralign 12:{res:OLS}}{col 49}Prob > F{col 67}= {res}    0.2130

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}LnLesion_Vol~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}LnNFLw3 {c |}{col 16}{res}{space 2} .9305506{col 28}{space 2}   .84923{col 39}{space 1}    1.10{col 48}{space 3}0.275{col 56}{space 4} -.747538{col 69}{space 3} 2.608639
{txt}{space 14} {c |}
{space 10}Race {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} .2653347{col 28}{space 2} 2.786727{col 39}{space 1}    0.10{col 48}{space 3}0.924{col 56}{space 4}-5.241271{col 69}{space 3}  5.77194
{txt}{space 14} {c |}
Race#c.LnNFLw3 {c |}
{space 8}AfrAm  {c |}{col 16}{res}{space 2} .4984934{col 28}{space 2} 1.277809{col 39}{space 1}    0.39{col 48}{space 3}0.697{col 56}{space 4}-2.026477{col 69}{space 3} 3.023464
{txt}{space 14} {c |}
{space 11}Sex {c |}{col 16}{res}{space 2}  .282963{col 28}{space 2} .8792868{col 39}{space 1}    0.32{col 48}{space 3}0.748{col 56}{space 4}-1.454517{col 69}{space 3} 2.020443
{txt}{space 9}w1Age {c |}{col 16}{res}{space 2} .0545651{col 28}{space 2} .0405291{col 39}{space 1}    1.35{col 48}{space 3}0.180{col 56}{space 4}-.0255217{col 69}{space 3} .1346519
{txt}{space 10}Race {c |}{col 16}{res}{space 2}        0{col 28}{txt}  (omitted)
{space 7}PovStat {c |}{col 16}{res}{space 2} .9599106{col 28}{space 2} .7796134{col 39}{space 1}    1.23{col 48}{space 3}0.220{col 56}{space 4}-.5806603{col 69}{space 3} 2.500482
{txt}{space 3}TIME_V1SCAN {c |}{col 16}{res}{space 2}-.0008023{col 28}{space 2} .0005492{col 39}{space 1}   -1.46{col 48}{space 3}0.146{col 56}{space 4}-.0018876{col 69}{space 3}  .000283
{txt}{space 9}w1BMI {c |}{col 16}{res}{space 2} .0444857{col 28}{space 2} .0496784{col 39}{space 1}    0.90{col 48}{space 3}0.372{col 56}{space 4}-.0536815{col 69}{space 3} .1426529
{txt}{space 3}w1currdrugs {c |}{col 16}{res}{space 2} .2463729{col 28}{space 2} .8324521{col 39}{space 1}    0.30{col 48}{space 3}0.768{col 56}{space 4}-1.402228{col 69}{space 3} 1.894974
{txt}{space 9}w1SRH {c |}{col 16}{res}{space 2}-.5670996{col 28}{space 2} .4156818{col 39}{space 1}   -1.36{col 48}{space 3}0.175{col 56}{space 4}-1.388491{col 69}{space 3} .2542919
{txt}{space 5}ICV_volM2 {c |}{col 16}{res}{space 2} 3.17e-06{col 28}{space 2} 3.23e-06{col 39}{space 1}    0.98{col 48}{space 3}0.329{col 56}{space 4}-3.22e-06{col 69}{space 3} 9.55e-06
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-3.999426{col 28}{space 2}   4.7935{col 39}{space 1}   -0.83{col 48}{space 3}0.405{col 56}{space 4}-13.47159{col 69}{space 3} 5.472734
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_final.dta{rm}
saved
{p_end}

{com}. 
. 
. 
.   
. 
. capture log close
{smcl}
{com}{sf}{ul off}